{
  "course": "ap-physics-1",
  "topic": "Circular Motion & Gravitation",
  "cards": [
    {
      "front": "What is the definition of **Uniform Circular Motion**?",
      "back": "Motion of an object in a circle at a constant speed."
    },
    {
      "front": "In uniform circular motion, is the velocity constant? Is the speed constant?",
      "back": "Speed is constant, but velocity is not constant because its direction is always changing."
    },
    {
      "front": "What is the direction of the velocity vector in uniform circular motion?",
      "back": "Tangent to the circular path."
    },
    {
      "front": "What is the direction of the acceleration vector in uniform circular motion?",
      "back": "Towards the center of the circle (centripetal acceleration)."
    },
    {
      "front": "What is the formula for **centripetal acceleration**?",
      "back": "$$a_c = \\frac{v^2}{r}$$"
    },
    {
      "front": "What is the formula for **centripetal force**?",
      "back": "$$F_c = ma_c = \\frac{mv^2}{r}$$"
    },
    {
      "front": "Is centripetal force a fundamental force of nature?",
      "back": "No, it is the net force that causes circular motion; it can be provided by tension, gravity, friction, etc."
    },
    {
      "front": "If the radius of a circular path is doubled while speed remains constant, what happens to the centripetal acceleration?",
      "back": "It is halved."
    },
    {
      "front": "If the speed of an object in circular motion is doubled while the radius is constant, what happens to the centripetal force?",
      "back": "It becomes four times as large ($$F_c \\propto v^2$$)."
    },
    {
      "front": "What is the relationship between linear speed ($$v$$) and angular speed ($$\\omega$$)?",
      "back": "$$v = r\\omega$$"
    },
    {
      "front": "What is **Newton's Law of Universal Gravitation**?",
      "back": "Every particle attracts every other particle with a force that is directly proportional to the product of their masses and inversely proportional to the square of the distance between their centers."
    },
    {
      "front": "What is the formula for the force of universal gravitation?",
      "back": "$$F_g = \\frac{Gm_1m_2}{r^2}$$"
    },
    {
      "front": "What is the value of the **universal gravitational constant** ($$G$$)?",
      "back": "$$6.67 \\times 10^{-11} \\text{ N} \\cdot \\text{m}^2/\\text{kg}^2$$"
    },
    {
      "front": "If the distance between two objects is doubled, what happens to the gravitational force between them?",
      "back": "It decreases to one-fourth of its original value ($$F_g \\propto 1/r^2$$)."
    },
    {
      "front": "If the mass of one of the objects is doubled, what happens to the gravitational force?",
      "back": "It doubles."
    },
    {
      "front": "What is the formula for the gravitational field strength ($$g$$) at a distance $$r$$ from a central mass $$M$$?",
      "back": "$$g = \\frac{GM}{r^2}$$"
    },
    {
      "front": "In a stable circular orbit, what force provides the centripetal force?",
      "back": "The force of gravity."
    },
    {
      "front": "For an object in orbit around a planet, what is the relationship between centripetal force and gravitational force?",
      "back": "$$F_c = F_g \\Rightarrow \\frac{mv^2}{r} = \\frac{GMm}{r^2}$$"
    },
    {
      "front": "Derive the formula for the speed of a satellite in a circular orbit.",
      "back": "$$v = \\sqrt{\\frac{GM}{r}}$$"
    },
    {
      "front": "Does the orbital speed of a satellite depend on its own mass?",
      "back": "No, the mass of the satellite ($$m$$) cancels out in the derivation of the orbital speed formula."
    },
    {
      "front": "What is the definition of **orbital period** ($$T$$)?",
      "back": "The time it takes for a satellite to complete one full revolution around an orbit."
    },
    {
      "front": "What is the formula for the orbital period in terms of velocity and radius?",
      "back": "$$T = \\frac{2\\pi r}{v}$$"
    },
    {
      "front": "If a satellite is in a stable orbit, does gravity do work on it?",
      "back": "No, gravity is always perpendicular to the direction of motion, so no work is done."
    },
    {
      "front": "In a vertical circular loop, where is the tension in the string or track greatest?",
      "back": "At the bottom of the loop."
    },
    {
      "front": "In a vertical circular loop, where is the tension in the string or track smallest?",
      "back": "At the top of the loop."
    },
    {
      "front": "What is the minimum speed an object must have at the top of a vertical circular loop to complete the loop?",
      "back": "The minimum speed is when the normal force or tension becomes zero; $$v = \\sqrt{gr}$$."
    },
    {
      "front": "What is the force that keeps a car in a horizontal circular turn on a flat road?",
      "back": "Static friction."
    },
    {
      "front": "How does the centripetal force on a car in a turn relate to the friction force?",
      "back": "$$F_{friction} = F_c = \\frac{mv^2}{r}$$"
    },
    {
      "front": "How does the gravitational force on an object on a planet's surface relate to its weight?",
      "back": "The force of gravity is the object's weight ($$F_g = mg$$)."
    },
    {
      "front": "What does the gravitational constant $$G$$ tell us?",
      "back": "It is a proportionality constant that determines the strength of the gravitational force."
    },
    {
      "front": "If a satellite's orbital radius is increased, what happens to its orbital period?",
      "back": "It increases significantly."
    },
    {
      "front": "What is the relationship between the period and radius of an orbit, according to Kepler's Third Law?",
      "back": "$$T^2 \\propto r^3$$"
    },
    {
      "front": "What is the direction of the centripetal acceleration vector?",
      "back": "Always pointing radially inward toward the center of the circle."
    },
    {
      "front": "What are the two components of the acceleration of an object in non-uniform circular motion?",
      "back": "Tangential acceleration (due to changing speed) and centripetal acceleration (due to changing direction)."
    },
    {
      "front": "How does the speed of a satellite change if it moves from a lower to a higher stable orbit?",
      "back": "Its speed decreases."
    },
    {
      "front": "For an object to be in a stable orbit, what must be true about the direction of its velocity and the force of gravity?",
      "back": "Its velocity vector must be perpendicular to the force of gravity vector."
    },
    {
      "front": "What is a **geosynchronous orbit**?",
      "back": "An orbit where a satellite's orbital period matches the Earth's rotational period (24 hours)."
    },
    {
      "front": "If the period of an orbit is measured in seconds, and the radius in meters, what are the units for the universal gravitational constant $$G$$?",
      "back": "$$\\text{N} \\cdot \\text{m}^2/\\text{kg}^2$$."
    },
    {
      "front": "If a planet's mass is doubled but its radius stays the same, how does its surface gravitational acceleration change?",
      "back": "It doubles."
    },
    {
      "front": "Why do astronauts in orbit feel 'weightless'?",
      "back": "They are in a continuous state of free fall around the Earth, so they don't experience a normal force pushing on them."
    }
  ]
}