{
  "course": "ap-physics-1",
  "topic": "Dynamics",
  "cards": [
    {
      "front": "What is **Newton's First Law**?",
      "back": "An object at rest stays at rest, and an object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced force."
    },
    {
      "front": "What is **inertia**?",
      "back": "The resistance of an object to a change in its state of motion."
    },
    {
      "front": "What is the formula for **Newton's Second Law**?",
      "back": "$$\\sum\\vec{F} = m\\vec{a}$$"
    },
    {
      "front": "What does the symbol $$\\sum\\vec{F}$$ represent?",
      "back": "The net force, which is the vector sum of all forces acting on an object."
    },
    {
      "front": "What is **Newton's Third Law**?",
      "back": "For every action, there is an equal and opposite reaction."
    },
    {
      "front": "What is a **Free-Body Diagram** (FBD)?",
      "back": "A diagram that shows all the forces acting on a single object, represented as vectors originating from a single point."
    },
    {
      "front": "What is the standard unit of force?",
      "back": "The Newton (N)."
    },
    {
      "front": "What is the standard unit of mass?",
      "back": "The kilogram (kg)."
    },
    {
      "front": "What is **weight** ($$F_g$$)?",
      "back": "The force of gravity acting on an object's mass."
    },
    {
      "front": "What is the formula for weight?",
      "back": "$$F_g = mg$$"
    },
    {
      "front": "What is the **Normal Force** ($$F_N$$)?",
      "back": "The contact force exerted by a surface on an object that is perpendicular to the surface."
    },
    {
      "front": "If a book is resting on a table, what is the Normal Force equal to?",
      "back": "It is equal in magnitude and opposite in direction to the force of gravity ($$F_N = mg$$)."
    },
    {
      "front": "What is **Tension** ($$T$$)?",
      "back": "The force exerted by a string, rope, or cable when it is stretched taut."
    },
    {
      "front": "What is the difference between **static friction** and **kinetic friction**?",
      "back": "Static friction acts on an object at rest. Kinetic friction acts on an object in motion."
    },
    {
      "front": "What is the formula for the maximum static friction force?",
      "back": "$$f_s \\le \\mu_s F_N$$"
    },
    {
      "front": "What is the formula for kinetic friction force?",
      "back": "$$f_k = \\mu_k F_N$$"
    },
    {
      "front": "In a friction problem, which is typically larger: the coefficient of static friction or the coefficient of kinetic friction?",
      "back": "The coefficient of static friction ($$\\mu_s$$) is typically larger than the coefficient of kinetic friction ($$\\mu_k$$)."
    },
    {
      "front": "What must be true for an object to be in **equilibrium**?",
      "back": "The net force acting on it must be zero ($$\\sum\\vec{F} = 0$$)."
    },
    {
      "front": "What can you say about the acceleration of an object in equilibrium?",
      "back": "Its acceleration is zero."
    },
    {
      "front": "According to Newton's Third Law, if a person pushes on a wall, what is the reaction force?",
      "back": "The wall pushes back on the person with an equal and opposite force."
    },
    {
      "front": "For an object sliding down an incline, what is the direction of the Normal Force?",
      "back": "Perpendicular to the surface of the incline."
    },
    {
      "front": "For an object sliding down an incline, what is the direction of the friction force?",
      "back": "Parallel to the surface of the incline and opposite to the direction of motion."
    },
    {
      "front": "In a system of two connected blocks, what force is the same for both blocks?",
      "back": "The tension in the string connecting them."
    },
    {
      "front": "How do you solve for the acceleration of a system of objects?",
      "back": "Treat the entire system as a single object, and use $$F_{net} = m_{total}a$$."
    },
    {
      "front": "What is the purpose of a **pulley** in a system of objects?",
      "back": "To change the direction of the tension force without changing its magnitude."
    },
    {
      "front": "When are action-reaction forces equal in magnitude?",
      "back": "Always, according to Newton's Third Law."
    },
    {
      "front": "Do action-reaction forces cancel each other out?",
      "back": "No, they act on two different objects and therefore cannot cancel each other out."
    },
    {
      "front": "What does it mean for an object to be in **uniform circular motion**?",
      "back": "It is moving in a circle at a constant speed, but with a changing velocity due to a changing direction."
    },
    {
      "front": "Is an object in uniform circular motion in equilibrium?",
      "back": "No, because its velocity is changing, which means it is accelerating, and therefore has a net force acting on it."
    },
    {
      "front": "What is the direction of the net force on an object in uniform circular motion?",
      "back": "Towards the center of the circle (centripetal force)."
    },
    {
      "front": "What is a **fictitious force**?",
      "back": "An apparent force that arises in a non-inertial reference frame (e.g., centrifugal force)."
    },
    {
      "front": "What is the difference between a mass and weight?",
      "back": "Mass is a measure of inertia, a fundamental property of matter. Weight is the force of gravity on that mass."
    },
    {
      "front": "What happens to your weight if you go to the moon?",
      "back": "It decreases because the acceleration due to gravity is lower, but your mass remains the same."
    },
    {
      "front": "What is the condition for an object to be considered 'weightless'?",
      "back": "It is in a state of free fall, where the Normal Force is zero."
    },
    {
      "front": "What is the difference between an **external force** and an **internal force** on a system?",
      "back": "An external force acts on the system from outside. An internal force acts between objects within the system."
    },
    {
      "front": "Why do we ignore internal forces when applying Newton's Second Law to a system?",
      "back": "Because internal forces always come in action-reaction pairs that cancel each other out."
    },
    {
      "front": "In a free-body diagram, how is a force represented?",
      "back": "As an arrow (a vector) pointing in the direction of the force, with a length proportional to its magnitude."
    },
    {
      "front": "For a book sliding to a stop, what is the direction of the net force?",
      "back": "Opposite to the direction of motion."
    },
    {
      "front": "If an object is moving at a constant velocity, what can you say about the net force acting on it?",
      "back": "The net force is zero."
    },
    {
      "front": "For a person standing in an elevator accelerating upward, what is the relationship between Normal Force and Weight?",
      "back": "The Normal Force is greater than the weight ($$F_N > mg$$)."
    }
  ]
}
