{
  "course": "ap-physics-1",
  "topic": "Energy",
  "cards": [
    {
      "front": "What is the definition of **Work** in physics?",
      "back": "Work is done when a force causes a displacement of an object in the same direction as the force."
    },
    {
      "front": "What is the formula for work done by a constant force?",
      "back": "$$W = Fd\\cos\\theta$$ where $$\\theta$$ is the angle between the force and displacement vectors."
    },
    {
      "front": "What is the **Work-Energy Theorem**?",
      "back": "The net work done on an object is equal to the change in its kinetic energy ($$W_{net} = \\Delta K$$)."
    },
    {
      "front": "What is the formula for **Kinetic Energy**?",
      "back": "$$K = \\frac{1}{2}mv^2$$"
    },
    {
      "front": "What is the formula for **Gravitational Potential Energy**?",
      "back": "$$U_g = mgh$$"
    },
    {
      "front": "What is the formula for **Elastic Potential Energy** stored in a spring?",
      "back": "$$U_s = \\frac{1}{2}kx^2$$"
    },
    {
      "front": "What is the **Law of Conservation of Mechanical Energy**?",
      "back": "In the absence of non-conservative forces (like friction), the total mechanical energy (kinetic + potential) of a system remains constant ($$E_i = E_f$$)."
    },
    {
      "front": "What is **Power**?",
      "back": "The rate at which work is done or energy is transferred."
    },
    {
      "front": "What is the formula for power?",
      "back": "$$P = \\frac{W}{t} = Fv\\cos\\theta$$"
    },
    {
      "front": "What is the standard SI unit for work and energy?",
      "back": "The Joule (J)."
    },
    {
      "front": "What is the standard SI unit for power?",
      "back": "The Watt (W)."
    },
    {
      "front": "What is the difference between a **conservative** and **non-conservative** force?",
      "back": "Work done by a conservative force (like gravity) is path-independent. Work done by a non-conservative force (like friction) is path-dependent and converts mechanical energy to other forms."
    },
    {
      "front": "When a person holds a heavy box but does not move, is work being done on the box?",
      "back": "No, because there is no displacement, so the work done is zero."
    },
    {
      "front": "A ball is thrown straight up. At its highest point, what can you say about its kinetic and potential energy?",
      "back": "Its kinetic energy is at a minimum (zero), and its gravitational potential energy is at a maximum."
    },
    {
      "front": "As a spring is compressed, what happens to the energy of the system?",
      "back": "The kinetic energy of the object doing the compressing is converted into elastic potential energy stored in the spring."
    },
    {
      "front": "What is the purpose of an **energy bar chart**?",
      "back": "To visually represent the energy transformations within a system at different points in time."
    },
    {
      "front": "What is **efficiency**?",
      "back": "The ratio of useful energy output to total energy input, often expressed as a percentage."
    },
    {
      "front": "What is the relationship between work and energy?",
      "back": "Work is the process of transferring energy, and a change in energy is equivalent to the work done."
    },
    {
      "front": "If the velocity of an object is doubled, what happens to its kinetic energy?",
      "back": "It becomes four times as large ($$K \\propto v^2$$)."
    },
    {
      "front": "How does the work done by friction affect a system's mechanical energy?",
      "back": "It causes the mechanical energy of the system to decrease."
    },
    {
      "front": "What is the principle of **Conservation of Total Energy**?",
      "back": "The total energy of an isolated system (including mechanical, thermal, etc.) remains constant."
    },
    {
      "front": "What is **thermal energy**?",
      "back": "Energy associated with the random motion of atoms and molecules; it is often the result of work done by friction."
    },
    {
      "front": "How is the work done by a variable force on a force-displacement graph represented?",
      "back": "As the area under the curve."
    },
    {
      "front": "What is the formula for the average power in terms of force and velocity?",
      "back": "$$P = F_{average}v_{average}\\cos\\theta$$"
    },
    {
      "front": "If you lift a book at a constant speed, what is the net work done on the book?",
      "back": "The net work is zero, because the net force is zero (lifting force equals gravity), and thus there is no change in kinetic energy."
    },
    {
      "front": "What does the slope of a Power vs. Velocity graph represent?",
      "back": "If the force is constant, the slope is the value of the force."
    },
    {
      "front": "Why is a roller coaster's potential energy at the top of a hill not quite equal to its kinetic energy at the bottom?",
      "back": "Because some of the mechanical energy is converted into thermal energy by the work done by friction and air resistance."
    },
    {
      "front": "What happens to the potential energy of a pendulum as it swings from its highest point to its lowest point?",
      "back": "It is converted into kinetic energy."
    },
    {
      "front": "What is the formula for the escape velocity from a planet's gravitational field?",
      "back": "$$v_{escape} = \\sqrt{\\frac{2GM}{r}}$$"
    },
    {
      "front": "What is a **zero energy point** in a potential energy diagram?",
      "back": "A reference point from which potential energy is measured, often chosen to be ground level for gravitational potential energy."
    }
  ]
}