{
  "flashcards": [
    {
      "category": "Fluid Mechanics",
      "cards": [
        {
          "front": "What is the definition of **density**?",
          "back": "Mass per unit volume ($$\\rho = \\frac{m}{V}$$)."
        },
        {
          "front": "What is the definition of **pressure**?",
          "back": "Force per unit area ($$P = \\frac{F}{A}$$)."
        },
        {
          "front": "What are the standard SI units for pressure?",
          "back": "Pascals (Pa), which is equivalent to newtons per square meter ($$N/m^2$$)."
        },
        {
          "front": "How does pressure change with depth in a fluid?",
          "back": "It increases linearly with depth."
        },
        {
          "front": "What is the formula for the pressure at a depth $$h$$ in a fluid?",
          "back": "$$P = P_0 + \\rho gh$$"
        },
        {
          "front": "What is **Pascal's Principle**?",
          "back": "A pressure change applied to an enclosed fluid is transmitted undiminished to every portion of the fluid and the walls of the container."
        },
        {
          "front": "What is the principle behind a hydraulic lift?",
          "back": "Pascal's Principle, where a small force over a small area creates a large force over a large area."
        },
        {
          "front": "What is the formula relating forces and areas in a hydraulic system?",
          "back": "$$\\frac{F_1}{A_1} = \\frac{F_2}{A_2}$$"
        },
        {
          "front": "What is the definition of **buoyant force**?",
          "back": "The upward force exerted by a fluid on a submerged object."
        },
        {
          "front": "State **Archimedes' Principle**.",
          "back": "The buoyant force on a submerged object is equal to the weight of the fluid displaced by the object."
        },
        {
          "front": "What is the formula for buoyant force?",
          "back": "$$F_B = \\rho_{fluid}gV_{submerged}$$"
        },
        {
          "front": "An object is floating. How does its weight compare to the buoyant force on it?",
          "back": "The buoyant force is equal to the object's weight ($$F_B = F_g$$)."
        },
        {
          "front": "An object is sinking. How does its weight compare to the buoyant force on it?",
          "back": "The object's weight is greater than the buoyant force ($$F_g > F_B$$)."
        },
        {
          "front": "What is the condition for an object to float?",
          "back": "The object's average density must be less than or equal to the density of the fluid."
        },
        {
          "front": "What is **Bernoulli's Principle**?",
          "back": "As the speed of a fluid increases, the pressure within the fluid decreases."
        },
        {
          "front": "State the full **Bernoulli's Equation**.",
          "back": "$$P_1 + \\frac{1}{2}\\rho v_1^2 + \\rho gh_1 = P_2 + \\frac{1}{2}\\rho v_2^2 + \\rho gh_2$$"
        },
        {
          "front": "What is the **Continuity Equation**?",
          "back": "For an incompressible fluid, the flow rate is constant: $$A_1v_1 = A_2v_2$$"
        },
        {
          "front": "In the continuity equation, what does $$A$$ represent and what does $$v$$ represent?",
          "back": "$$A$$ is the cross-sectional area of the pipe, and $$v$$ is the speed of the fluid."
        },
        {
          "front": "What is a **streamline**?",
          "back": "A line in a fluid that is tangent to the velocity vector of the fluid at every point."
        },
        {
          "front": "Why does the water coming out of a faucet get thinner as it falls?",
          "back": "Because its speed increases due to gravity, and to maintain constant flow rate, the cross-sectional area must decrease (Continuity Equation)."
        },
        {
          "front": "In a horizontal pipe, where is the pressure lowest?",
          "back": "At the point where the fluid speed is highest."
        },
        {
          "front": "How does an airplane wing create lift?",
          "back": "The curved top forces air to travel faster over the top surface, creating lower pressure there and a net upward force (Bernoulli's Principle)."
        },
        {
          "front": "How does a siphon work?",
          "back": "It uses gravity to create a pressure difference that moves the fluid from a higher reservoir to a lower one."
        },
        {
          "front": "What are the characteristics of an **ideal fluid**?",
          "back": "Incompressible, non-viscous, with laminar flow."
        },
        {
          "front": "Is the buoyant force on a submerged object greater in fresh water or saltwater?",
          "back": "Saltwater, because it is denser."
        },
        {
          "front": "If a floating object is pushed down further into the water, what happens to the buoyant force?",
          "back": "It increases, as more fluid is displaced."
        },
        {
          "front": "How does the pressure at the bottom of a container with a fluid depend on the container's shape?",
          "back": "It doesn't. Pressure depends only on the fluid density and depth, not the shape of the container."
        },
        {
          "front": "What does the term $$\\rho gh$$ represent in Bernoulli's equation?",
          "back": "Gravitational potential energy per unit volume."
        },
        {
          "front": "What does the term $$\\frac{1}{2}\\rho v^2$$ represent in Bernoulli's equation?",
          "back": "Kinetic energy per unit volume."
        },
        {
          "front": "When a fluid flows from a wider pipe into a narrower pipe, what happens to its speed?",
          "back": "Its speed increases."
        },
        {
          "front": "When a fluid flows from a wider pipe into a narrower pipe, what happens to its pressure?",
          "back": "Its pressure decreases."
        },
        {
          "front": "What is **viscosity**?",
          "back": "A measure of a fluid's resistance to flow."
        },
        {
          "front": "When does Bernoulli's Principle not apply?",
          "back": "When there is viscosity or turbulence."
        },
        {
          "front": "How is the human body's blood pressure affected by blood flow speed?",
          "back": "In narrower blood vessels, blood flows faster, and the pressure on the vessel walls decreases."
        },
        {
          "front": "What happens to the pressure on a swimmer as they dive deeper into the water?",
          "back": "The pressure increases due to the increasing weight of the water column above them."
        },
        {
          "front": "An object is fully submerged. How does its volume compare to the volume of the displaced fluid?",
          "back": "They are equal."
        },
        {
          "front": "What is the difference between a liquid and a gas in terms of density?",
          "back": "Liquids have a definite volume and are nearly incompressible, while gases fill their container and are highly compressible."
        },
        {
          "front": "What is the **absolute pressure** at a point in a fluid?",
          "back": "The sum of the atmospheric pressure and the gauge pressure."
        },
        {
          "front": "What happens to the buoyant force on a submerged object as it is taken to a higher altitude?",
          "back": "It decreases slightly, due to the decrease in the density of the air."
        },
        {
          "front": "Why is a large cruise ship able to float?",
          "back": "Because its average density (including the air inside the hull) is less than the density of the water it displaces."
        }
      ]
    }
  ]
}