{
  "flashcards": [
    {
      "category": "Kinematics",
      "cards": [
        {
          "front": "What is the difference between **distance** and **displacement**?",
          "back": "Distance is a scalar quantity and refers to the total path traveled. Displacement is a vector and is the change in position from start to end."
        },
        {
          "front": "What is the difference between **speed** and **velocity**?",
          "back": "Speed is a scalar quantity (distance/time). Velocity is a vector (displacement/time) that includes direction."
        },
        {
          "front": "What does the slope of a **position-time graph** represent?",
          "back": "The velocity of the object."
        },
        {
          "front": "What does the slope of a **velocity-time graph** represent?",
          "back": "The acceleration of the object."
        },
        {
          "front": "What does the area under a **velocity-time graph** represent?",
          "back": "The displacement of the object."
        },
        {
          "front": "What does the area under an **acceleration-time graph** represent?",
          "back": "The change in velocity."
        },
        {
          "front": "State the first kinematic equation that relates final velocity, initial velocity, acceleration, and time.",
          "back": "$$v_f = v_i + at$$"
        },
        {
          "front": "State the second kinematic equation that relates displacement, initial velocity, final velocity, and time.",
          "back": "$$\\Delta x = \\frac{1}{2}(v_i + v_f)t$$"
        },
        {
          "front": "State the third kinematic equation that relates displacement, initial velocity, time, and acceleration.",
          "back": "$$\\Delta x = v_it + \\frac{1}{2}at^2$$"
        },
        {
          "front": "State the fourth kinematic equation that relates final velocity, initial velocity, acceleration, and displacement.",
          "back": "$$v_f^2 = v_i^2 + 2a\\Delta x$$"
        },
        {
          "front": "What is the magnitude of the acceleration due to gravity on Earth?",
          "back": "$$g \\approx 9.8 \\text{ m/s}^2$$"
        },
        {
          "front": "When an object is in free fall, what is its acceleration?",
          "back": "It is constant and equal to the acceleration due to gravity, $$g$$, downward."
        },
        {
          "front": "At the peak of its trajectory, what is the vertical velocity of a projectile?",
          "back": "Zero."
        },
        {
          "front": "For projectile motion, how do you treat the horizontal and vertical components of motion?",
          "back": "They are independent of each other."
        },
        {
          "front": "In the absence of air resistance, what is the horizontal acceleration of a projectile?",
          "back": "Zero."
        },
        {
          "front": "In the absence of air resistance, what is the vertical acceleration of a projectile?",
          "back": "Constant and equal to $$-g$$ (downward)."
        },
        {
          "front": "What does a negative velocity on a position-time graph indicate?",
          "back": "The object is moving in the negative direction."
        },
        {
          "front": "What does a horizontal line on a velocity-time graph indicate?",
          "back": "Constant velocity, meaning zero acceleration."
        },
        {
          "front": "What does a curved line on a position-time graph indicate?",
          "back": "Changing velocity, meaning there is acceleration."
        },
        {
          "front": "What is **instantaneous velocity**?",
          "back": "The velocity of an object at a specific moment in time."
        },
        {
          "front": "What is **average velocity**?",
          "back": "The total displacement divided by the total time taken."
        },
        {
          "front": "How can you find the instantaneous velocity from a position-time graph?",
          "back": "By finding the slope of the tangent line at that specific point in time."
        },
        {
          "front": "What does a line with a negative slope on a velocity-time graph indicate?",
          "back": "The object is slowing down if its velocity is positive, or speeding up if its velocity is negative."
        },
        {
          "front": "What is the difference between a **vector** and a **scalar**?",
          "back": "A vector has both magnitude and direction, while a scalar has only magnitude."
        },
        {
          "front": "Is speed a scalar or a vector?",
          "back": "A scalar."
        },
        {
          "front": "Is displacement a scalar or a vector?",
          "back": "A vector."
        },
        {
          "front": "Is acceleration a scalar or a vector?",
          "back": "A vector."
        },
        {
          "front": "For an object thrown straight up, what is its acceleration at the highest point?",
          "back": "It is still constant at $$-9.8 \\text{ m/s}^2$$ (downward)."
        },
        {
          "front": "What happens to the acceleration of a falling object as it approaches terminal velocity?",
          "back": "Its acceleration decreases to zero."
        },
        {
          "front": "How does the time it takes for a projectile to reach its max height compare to the time it takes to fall back down from that height?",
          "back": "The times are equal, assuming the launch and landing heights are the same."
        },
        {
          "front": "For a projectile launched horizontally, how does its horizontal velocity change?",
          "back": "It remains constant (in the absence of air resistance)."
        },
        {
          "front": "What is the primary difference between kinematics and dynamics?",
          "back": "Kinematics describes motion, while dynamics explains the causes of motion (forces)."
        },
        {
          "front": "What does a horizontal line at zero on an acceleration-time graph mean?",
          "back": "Constant velocity."
        },
        {
          "front": "If a position-time graph is a straight line, what can you say about the object's acceleration?",
          "back": "Its acceleration is zero."
        },
        {
          "front": "What are the standard SI units for displacement?",
          "back": "Meters (m)."
        },
        {
          "front": "What are the standard SI units for velocity?",
          "back": "Meters per second (m/s)."
        },
        {
          "front": "What are the standard SI units for acceleration?",
          "back": "Meters per second squared ($$m/s^2$$)."
        },
        {
          "front": "An object is thrown straight up. What is the direction of its velocity on the way up?",
          "back": "Upward (positive)."
        },
        {
          "front": "What is the direction of an object's velocity on the way down?",
          "back": "Downward (negative)."
        },
        {
          "front": "What does a non-zero, horizontal line on a velocity-time graph indicate?",
          "back": "Constant, non-zero velocity."
        }
      ]
    }
  ]
}