{
  "course": "ap-physics-1",
  "topic": "Momentum",
  "cards": [
    {
      "front": "What is the definition of **linear momentum**?",
      "back": "The product of an object's mass and its velocity."
    },
    {
      "front": "What is the formula for momentum?",
      "back": "$$\\vec{p} = m\\vec{v}$$"
    },
    {
      "front": "Is momentum a scalar or a vector quantity?",
      "back": "It is a **vector** quantity, having both magnitude and direction."
    },
    {
      "front": "What is the definition of **impulse**?",
      "back": "The change in momentum of an object."
    },
    {
      "front": "What is the formula for impulse?",
      "back": "$$\\vec{J} = \\vec{F}_{avg}\\Delta t$$"
    },
    {
      "front": "What is the **Impulse-Momentum Theorem**?",
      "back": "Impulse on an object is equal to the change in its momentum ($$\\vec{J} = \\Delta \\vec{p}$$)."
    },
    {
      "front": "State the **Law of Conservation of Linear Momentum**.",
      "back": "The total momentum of a closed, isolated system remains constant."
    },
    {
      "front": "What is a **closed, isolated system**?",
      "back": "A system with no external forces acting on it."
    },
    {
      "front": "In a collision, what is always conserved?",
      "back": "Linear momentum, as long as the system is isolated."
    },
    {
      "front": "What is an **elastic collision**?",
      "back": "A collision in which both linear momentum and kinetic energy are conserved."
    },
    {
      "front": "What is an **inelastic collision**?",
      "back": "A collision in which linear momentum is conserved but kinetic energy is not."
    },
    {
      "front": "What is a **perfectly inelastic collision**?",
      "back": "A type of inelastic collision in which the colliding objects stick together after the collision."
    },
    {
      "front": "If a bowling ball collides head-on with a stationary bowling pin, what happens to the total momentum of the system?",
      "back": "The total momentum of the ball-pin system is conserved."
    },
    {
      "front": "In a perfectly inelastic collision, what happens to the kinetic energy of the system?",
      "back": "Kinetic energy is lost, often converted into sound, heat, or deformation."
    },
    {
      "front": "What is the formula for the momentum of a system of multiple objects?",
      "back": "$$\\vec{p}_{total} = \\sum\\vec{p}_i = m_1\\vec{v}_1 + m_2\\vec{v}_2 + ...$$"
    },
    {
      "front": "What is the **center of mass** of an object or system?",
      "back": "The point at which the entire mass of the object or system can be considered to be concentrated."
    },
    {
      "front": "How does the center of mass of an isolated system move?",
      "back": "It continues to move with a constant velocity, even if the individual parts of the system are moving."
    },
    {
      "front": "Why is it safer to extend the time of impact in a collision (e.g., using an airbag)?",
      "back": "Increasing the time of impact decreases the average force applied to the object, according to the impulse-momentum theorem ($$F_{avg} = \\Delta p/\\Delta t$$)."
    },
    {
      "front": "What is the relationship between impulse and the change in momentum?",
      "back": "They are equal: a given impulse will produce a predictable change in momentum."
    },
    {
      "front": "If two objects of equal mass collide in an elastic collision, what happens to their velocities?",
      "back": "They exchange velocities."
    },
    {
      "front": "For an explosion, what is the initial momentum of the system?",
      "back": "Zero, assuming the system was initially at rest."
    },
    {
      "front": "Why is it easier to push a car that is already rolling?",
      "back": "Less force is required to maintain its momentum than to give it the initial impulse from rest."
    },
    {
      "front": "How does an isolated system's total momentum change during a collision?",
      "back": "It does not change; it is conserved."
    },
    {
      "front": "What is the formula for the center of mass of two objects along the x-axis?",
      "back": "$$x_{cm} = \\frac{m_1x_1 + m_2x_2}{m_1+m_2}$$"
    },
    {
      "front": "Is momentum conserved in an inelastic collision?",
      "back": "Yes, momentum is always conserved in a collision if the system is isolated."
    },
    {
      "front": "What happens to the kinetic energy of the system in a perfectly inelastic collision?",
      "back": "The loss of kinetic energy is at a maximum."
    },
    {
      "front": "How does a rocket work, in terms of momentum conservation?",
      "back": "The rocket expels exhaust gases at high velocity (backward momentum), and to conserve momentum, the rocket gains forward momentum."
    },
    {
      "front": "If a tennis ball hits a wall and bounces back, is momentum conserved?",
      "back": "No, because the wall-Earth system is not included; there is an external force from the wall on the ball."
    },
    {
      "front": "In a collision where two objects stick together, what is their final velocity?",
      "back": "$$v_f = \\frac{m_1v_1 + m_2v_2}{m_1+m_2}$$"
    },
    {
      "front": "What is the relationship between Newton's Second Law and momentum?",
      "back": "$$\\vec{F}_{net} = \\frac{d\\vec{p}}{dt}$$ (Net force is the rate of change of momentum)."
    },
    {
      "front": "What is the total momentum of a system of two objects with equal and opposite momenta?",
      "back": "Zero."
    },
    {
      "front": "What is the condition for total momentum to be conserved?",
      "back": "The net external force on the system must be zero."
    },
    {
      "front": "For an object sliding on a frictionless surface, is its momentum conserved?",
      "back": "Yes, because the only external forces (gravity and normal force) are vertical and cancel out, so there is no net horizontal force."
    },
    {
      "front": "What does the area under a Force vs. Time graph represent?",
      "back": "Impulse ($$J = F_{avg}\\Delta t$$)."
    },
    {
      "front": "If a heavy truck and a small car collide, how do their impulses compare?",
      "back": "They experience an equal and opposite impulse, according to Newton's Third Law and the impulse-momentum theorem."
    },
    {
      "front": "Is kinetic energy conserved in a perfectly inelastic collision?",
      "back": "No."
    },
    {
      "front": "Is momentum conserved in an explosion?",
      "back": "Yes, assuming the system is isolated."
    },
    {
      "front": "How is the conservation of momentum different from the conservation of energy?",
      "back": "Momentum is a vector quantity and is conserved in all isolated collisions, while kinetic energy is a scalar and is only conserved in elastic collisions."
    },
    {
      "front": "What happens to the kinetic energy of a system during an explosion?",
      "back": "It increases."
    },
    {
      "front": "An object is at rest. It breaks into two pieces. What is the total momentum of the two pieces?",
      "back": "Zero, because momentum is conserved from the initial state."
    }
  ]
}