{
  "flashcards": [
    {
      "category": "Rotational Motion",
      "cards": [
        {
          "front": "What is the rotational analog of linear displacement?",
          "back": "Angular displacement (Δθ), measured in radians."
        },
        {
          "front": "What is the rotational analog of linear velocity?",
          "back": "Angular velocity (ω), measured in radians per second (rad/s)."
        },
        {
          "front": "What is the rotational analog of linear acceleration?",
          "back": "Angular acceleration (α), measured in radians per second squared ($$rad/s^2$$)."
        },
        {
          "front": "What is the formula to relate tangential velocity to angular velocity?",
          "back": "$$v_t = r\\omega$$"
        },
        {
          "front": "What is the formula to relate tangential acceleration to angular acceleration?",
          "back": "$$a_t = r\\alpha$$"
        },
        {
          "front": "What is **Torque**?",
          "back": "The rotational equivalent of force; it causes an object to rotate or change its rotational motion."
        },
        {
          "front": "What is the formula for torque?",
          "back": "$$\\tau = rF\\sin\\theta$$"
        },
        {
          "front": "What is the rotational analog of Newton's First Law?",
          "back": "An object in rotational motion will stay in rotational motion with constant angular velocity unless acted upon by a net torque."
        },
        {
          "front": "What is the rotational analog of Newton's Second Law?",
          "back": "$$\\tau_{net} = I\\alpha$$"
        },
        {
          "front": "What is the rotational analog of mass?",
          "back": "**Rotational inertia** (I), which is a measure of an object's resistance to a change in its rotational motion."
        },
        {
          "front": "What does rotational inertia depend on?",
          "back": "The mass of the object and how that mass is distributed relative to the axis of rotation."
        },
        {
          "front": "For a point mass, what is the formula for rotational inertia?",
          "back": "$$I = mr^2$$"
        },
        {
          "front": "State the law of **Conservation of Angular Momentum**.",
          "back": "The angular momentum of a closed, isolated system remains constant."
        },
        {
          "front": "What is the formula for angular momentum?",
          "back": "$$L = I\\omega$$"
        },
        {
          "front": "In an isolated system, what is the relationship between the initial and final angular momentum?",
          "back": "$$L_{initial} = L_{final}$$ or $$I_i\\omega_i = I_f\\omega_f$$"
        },
        {
          "front": "What does the area under a torque vs. angular displacement graph represent?",
          "back": "Rotational work done."
        },
        {
          "front": "What is the rotational analog of work?",
          "back": "$$W_{rotational} = \\tau\\Delta\\theta$$"
        },
        {
          "front": "What is the rotational analog of kinetic energy?",
          "back": "Rotational kinetic energy, $$K_{rotational} = \\frac{1}{2}I\\omega^2$$"
        },
        {
          "front": "What is the total kinetic energy of a rolling object?",
          "back": "The sum of its translational kinetic energy and rotational kinetic energy ($$K_{total} = \\frac{1}{2}mv^2 + \\frac{1}{2}I\\omega^2$$)."
        },
        {
          "front": "What condition is necessary for an object to roll without slipping?",
          "back": "$$v = r\\omega$$"
        },
        {
          "front": "When a figure skater pulls their arms in, what happens to their rotational inertia and angular speed?",
          "back": "Their rotational inertia decreases, and their angular speed increases to conserve angular momentum."
        },
        {
          "front": "What is the angular analog of linear momentum?",
          "back": "**Angular momentum** ($$L$$)."
        },
        {
          "front": "A spinning disk slows down due to friction. Is angular momentum conserved?",
          "back": "No, because there is an external torque (friction) acting on the system."
        },
        {
          "front": "If a net torque is applied to an object, what will it do?",
          "back": "It will undergo angular acceleration."
        },
        {
          "front": "Which is harder to stop, a rotating solid disk or a rotating ring of the same mass and radius?",
          "back": "The ring, because its mass is distributed farther from the axis of rotation, giving it a larger rotational inertia."
        },
        {
          "front": "How does the torque applied to a door change as you get closer to the hinges?",
          "back": "It decreases for the same amount of applied force."
        },
        {
          "front": "What is the condition for an object to be in **rotational equilibrium**?",
          "back": "The net torque acting on it must be zero."
        },
        {
          "front": "If an object is in both translational and rotational equilibrium, what are the conditions?",
          "back": "The net force is zero ($$\\sum\\vec{F}=0$$) and the net torque is zero ($$\\sum\\tau=0$$)."
        },
        {
          "front": "What does the area under an angular acceleration vs. time graph represent?",
          "back": "The change in angular velocity ($$\\Delta\\omega$$)."
        },
        {
          "front": "What does the slope of an angular velocity vs. time graph represent?",
          "back": "Angular acceleration ($$\\alpha$$)."
        },
        {
          "front": "When a rolling object goes up an incline, what energy transformations occur?",
          "back": "Translational and rotational kinetic energy are converted into gravitational potential energy."
        },
        {
          "front": "Does an object's rotational inertia change if the axis of rotation is changed?",
          "back": "Yes, its value depends on the axis of rotation."
        },
        {
          "front": "Is angular momentum a vector or a scalar?",
          "back": "A **vector** quantity."
        },
        {
          "front": "What is the direction of the angular velocity vector for an object rotating counter-clockwise?",
          "back": "Out of the page (using the right-hand rule)."
        },
        {
          "front": "What is the direction of the angular velocity vector for an object rotating clockwise?",
          "back": "Into the page (using the right-hand rule)."
        },
        {
          "front": "What is the rotational analog of the kinematic equations?",
          "back": "$$\\omega_f = \\omega_i + \\alpha t$$; $$\\Delta\\theta = \\omega_i t + \\frac{1}{2}\\alpha t^2$$; $$\\omega_f^2 = \\omega_i^2 + 2\\alpha\\Delta\\theta$$"
        },
        {
          "front": "Does a rolling object ever slip when it is in an ideal rolling motion?",
          "back": "No, the point of contact with the ground is instantaneously at rest."
        },
        {
          "front": "When a spinning top slows down, what happens to its angular momentum?",
          "back": "It decreases due to the external torque from friction."
        },
        {
          "front": "What is the SI unit for torque?",
          "back": "Newton-meter (N·m)."
        },
        {
          "front": "What is the SI unit for angular momentum?",
          "back": "$$kg \\cdot m^2/s$$"
        }
      ]
    }
  ]
}