{
  "course": "ap-physics-1",
  "topic": "Simple Harmonic Motion",
  "cards": [
    {
      "front": "What is **Simple Harmonic Motion (SHM)**?",
      "back": "A type of periodic motion where the restoring force is directly proportional to the displacement and acts in the direction opposite to the displacement."
    },
    {
      "front": "What is **Hooke's Law**?",
      "back": "The restoring force of an ideal spring is directly proportional to the displacement from equilibrium: $$F_s = -kx$$"
    },
    {
      "front": "In Hooke's Law, what does the variable $$k$$ represent?",
      "back": "The **spring constant**, which is a measure of the stiffness of the spring."
    },
    {
      "front": "What is **amplitude**?",
      "back": "The maximum displacement or distance moved by a point on a vibrating body or wave from its equilibrium position."
    },
    {
      "front": "What is the formula for the **period** ($$T$$) of a mass-spring system?",
      "back": "$$T = 2\\pi\\sqrt{\\frac{m}{k}}$$"
    },
    {
      "front": "What is the formula for the **frequency** ($$f$$) of a mass-spring system?",
      "back": "$$f = \\frac{1}{2\\pi}\\sqrt{\\frac{k}{m}}$$"
    },
    {
      "front": "What is the relationship between period ($$T$$) and frequency ($$f$$)?",
      "back": "$$f = \\frac{1}{T}$$"
    },
    {
      "front": "If the mass attached to a spring is quadrupled, what happens to the period of oscillation?",
      "back": "It doubles, because $$T \\propto \\sqrt{m}$$."
    },
    {
      "front": "If the spring constant is quadrupled, what happens to the period?",
      "back": "It is halved, because $$T \\propto 1/\\sqrt{k}$$."
    },
    {
      "front": "What is the formula for the elastic potential energy stored in a spring?",
      "back": "$$U_s = \\frac{1}{2}kx^2$$"
    },
    {
      "front": "How does the total mechanical energy change in an ideal mass-spring system?",
      "back": "It remains constant, as energy is continuously converted between kinetic energy and elastic potential energy."
    },
    {
      "front": "At what point in its oscillation is the speed of an object in SHM at a maximum?",
      "back": "At the equilibrium position."
    },
    {
      "front": "At what point in its oscillation is the acceleration of an object in SHM at a maximum?",
      "back": "At the maximum displacement (amplitude)."
    },
    {
      "front": "At what point in its oscillation is the kinetic energy of an object in SHM at a maximum?",
      "back": "At the equilibrium position."
    },
    {
      "front": "At what point in its oscillation is the potential energy of an object in SHM at a maximum?",
      "back": "At the maximum displacement (amplitude)."
    },
    {
      "front": "What is the formula for the **period** ($$T$$) of a simple pendulum?",
      "back": "$$T = 2\\pi\\sqrt{\\frac{L}{g}}$$"
    },
    {
      "front": "What is the formula for the **frequency** ($$f$$) of a simple pendulum?",
      "back": "$$f = \\frac{1}{2\\pi}\\sqrt{\\frac{g}{L}}$$"
    },
    {
      "front": "For what condition does a pendulum approximate SHM?",
      "back": "For small angles of displacement (generally less than 15 degrees)."
    },
    {
      "front": "What happens to the period of a pendulum if its length is quadrupled?",
      "back": "It doubles, because $$T \\propto \\sqrt{L}$$."
    },
    {
      "front": "What happens to the period of a pendulum if the mass of the bob is doubled?",
      "back": "Nothing; the period is independent of the mass."
    },
    {
      "front": "If a pendulum is moved from Earth to the moon, what happens to its period?",
      "back": "It increases, because the acceleration due to gravity ($$g$$) is smaller on the moon."
    },
    {
      "front": "What does the slope of a position-time graph for SHM represent?",
      "back": "The instantaneous velocity."
    },
    {
      "front": "What does the slope of a velocity-time graph for SHM represent?",
      "back": "The instantaneous acceleration."
    },
    {
      "front": "What does a position-time graph of SHM look like?",
      "back": "A sinusoidal curve (either a sine or cosine wave)."
    },
    {
      "front": "Where is the acceleration vector for an object in SHM always pointing?",
      "back": "Towards the equilibrium position."
    },
    {
      "front": "Where is the velocity vector for an object in SHM always pointing?",
      "back": "Tangent to the path of the motion."
    },
    {
      "front": "Does the amplitude of oscillation affect the period of a mass-spring system?",
      "back": "No, the period is independent of amplitude for an ideal SHM system."
    },
    {
      "front": "Does the amplitude of oscillation affect the period of a simple pendulum?",
      "back": "Yes, for large amplitudes, the period increases slightly, but it is considered independent for small angles."
    },
    {
      "front": "What provides the restoring force for a pendulum?",
      "back": "A component of the gravitational force."
    },
    {
      "front": "What provides the restoring force for a mass-spring system?",
      "back": "The spring force."
    },
    {
      "front": "If the spring is compressed from equilibrium, what is the direction of the spring force?",
      "back": "The spring force is in the positive direction (away from the equilibrium position)."
    },
    {
      "front": "If a pendulum is at its highest point, what is the magnitude of its velocity and acceleration?",
      "back": "Velocity is zero, and acceleration is at its maximum magnitude."
    },
    {
      "front": "How does a pendulum's energy change as it swings from its highest point to its lowest point?",
      "back": "Potential energy is converted into kinetic energy."
    },
    {
      "front": "How does a spring's energy change as a mass moves from maximum compression to the equilibrium position?",
      "back": "Elastic potential energy is converted into kinetic energy."
    },
    {
      "front": "What is the total mechanical energy in a mass-spring system at any point?",
      "back": "The sum of the kinetic energy and the elastic potential energy ($$E = K + U_s$$)."
    },
    {
      "front": "What is the total mechanical energy in a pendulum system at any point?",
      "back": "The sum of the kinetic energy and the gravitational potential energy ($$E = K + U_g$$)."
    },
    {
      "front": "Does a spring-mass system's period change on the moon?",
      "back": "No, because the period formula ($$T = 2\\pi\\sqrt{m/k}$$) does not depend on $$g$$."
    },
    {
      "front": "What does the slope of a force-displacement graph for a spring represent?",
      "back": "The spring constant, $$k$$."
    },
    {
      "front": "What does the area under a force-displacement graph for a spring represent?",
      "back": "The work done on the spring, which is equal to the elastic potential energy stored in the spring."
    },
    {
      "front": "Is the acceleration in SHM constant?",
      "back": "No, acceleration is constantly changing, being a maximum at the amplitude and zero at equilibrium."
    }
  ]
}