{
  "flashcards": [
    {
      "category": "Demand and Supply",
      "cards": [
        {
          "front": "What is the Law of Demand?",
          "back": "The principle that, all else being equal, as the price of a good or service increases, the quantity demanded decreases."
        },
        {
          "front": "What is the Law of Supply?",
          "back": "The principle that, all else being equal, as the price of a good or service increases, the quantity supplied increases."
        },
        {
          "front": "What is the key non-price determinant of demand?",
          "back": "Consumer income, tastes and preferences, prices of related goods, consumer expectations, and population size."
        },
        {
          "front": "What is the key non-price determinant of supply?",
          "back": "Input prices, technology, number of sellers, and producer expectations."
        },
        {
          "front": "What is a normal good?",
          "back": "A good for which demand increases as consumer income increases."
        },
        {
          "front": "What is an inferior good?",
          "back": "A good for which demand decreases as consumer income increases."
        },
        {
          "front": "What are substitute goods?",
          "back": "Goods that can be used in place of one another. An increase in the price of one leads to an increase in demand for the other."
        },
        {
          "front": "What are complementary goods?",
          "back": "Goods that are consumed together. An increase in the price of one leads to a decrease in demand for the other."
        },
        {
          "front": "What is a 'shift' in the demand curve?",
          "back": "A change in demand caused by a non-price determinant, moving the entire curve left or right."
        },
        {
          "front": "What is a 'movement along' the demand curve?",
          "back": "A change in quantity demanded caused by a change in the price of the good itself."
        },
        {
          "front": "What is a 'shift' in the supply curve?",
          "back": "A change in supply caused by a non-price determinant, moving the entire curve left or right."
        },
        {
          "front": "What is a 'movement along' the supply curve?",
          "back": "A change in quantity supplied caused by a change in the price of the good itself."
        },
        {
          "front": "What is 'market equilibrium'?",
          "back": "The point where the demand curve and supply curve intersect, where the quantity demanded equals the quantity supplied."
        },
        {
          "front": "What is 'equilibrium price'?",
          "back": "The price at which the quantity demanded and the quantity supplied are equal."
        },
        {
          "front": "What is a 'surplus'?",
          "back": "A situation where the price is above equilibrium, causing the quantity supplied to be greater than the quantity demanded."
        },
        {
          "front": "What is a 'shortage'?",
          "back": "A situation where the price is below equilibrium, causing the quantity demanded to be greater than the quantity supplied."
        },
        {
          "front": "What happens to the equilibrium price and quantity when demand increases?",
          "back": "Both the equilibrium price and quantity increase."
        },
        {
          "front": "What happens to the equilibrium price and quantity when supply increases?",
          "back": "Equilibrium price decreases and equilibrium quantity increases."
        },
        {
          "front": "What happens to the equilibrium price and quantity when demand decreases?",
          "back": "Both the equilibrium price and quantity decrease."
        },
        {
          "front": "What happens to the equilibrium price and quantity when supply decreases?",
          "back": "Equilibrium price increases and equilibrium quantity decreases."
        }
      ]
    }
  ]
}
