{
  "flashcards": [
    {
      "category": "Basic Concepts & Tools of Economic Analysis",
      "cards": [
        {
          "front": "What does the Production Possibilities Frontier (PPF) illustrate?",
          "back": "The maximum combination of two goods that an economy can produce given its available resources and technology."
        },
        {
          "front": "What does a point on the PPF curve represent?",
          "back": "An efficient use of all resources."
        },
        {
          "front": "What does a point inside the PPF curve signify?",
          "back": "An inefficient use of resources, where the economy is producing less than it could."
        },
        {
          "front": "What does a point outside the PPF curve represent?",
          "back": "A production combination that is currently unattainable with the available resources and technology."
        },
        {
          "front": "What concept is represented by the downward slope of the PPF?",
          "back": "Opportunity cost. To produce more of one good, you must produce less of another."
        },
        {
          "front": "What is the principle of 'comparative advantage'?",
          "back": "The ability of an individual, firm, or country to produce a good or service at a lower opportunity cost than another producer."
        },
        {
          "front": "What is the principle of 'absolute advantage'?",
          "back": "The ability of an individual, firm, or country to produce more of a good or service than competitors using the same amount of resources."
        },
        {
          "front": "According to the Law of Demand, what is the relationship between price and quantity demanded?",
          "back": "As the price of a good increases, the quantity demanded decreases, and vice versa."
        },
        {
          "front": "According to the Law of Supply, what is the relationship between price and quantity supplied?",
          "back": "As the price of a good increases, the quantity supplied increases, and vice versa."
        },
        {
          "front": "What is a 'demand curve'?",
          "back": "A graphical representation showing the relationship between the price of a good or service and the quantity demanded over a period of time."
        },
        {
          "front": "What is a 'supply curve'?",
          "back": "A graphical representation showing the relationship between the price of a good or service and the quantity supplied over a period of time."
        },
        {
          "front": "What is 'market equilibrium'?",
          "back": "The point where the supply and demand curves intersect, indicating a price where quantity supplied equals quantity demanded."
        },
        {
          "front": "What is a 'shortage'?",
          "back": "A situation where the quantity demanded is greater than the quantity supplied at the current market price."
        },
        {
          "front": "What is a 'surplus'?",
          "back": "A situation where the quantity supplied is greater than the quantity demanded at the current market price."
        },
        {
          "front": "What causes a 'shift' in the demand curve?",
          "back": "A change in a non-price factor, such as consumer income, tastes, or the price of a related good."
        },
        {
          "front": "What causes a 'shift' in the supply curve?",
          "back": "A change in a non-price factor, such as production costs, technology, or the number of sellers."
        },
        {
          "front": "What is a 'market' in economics?",
          "back": "A place or mechanism where buyers and sellers interact to trade goods and services."
        },
        {
          "front": "What is the term for a situation where a country's production capacity expands?",
          "back": "Economic Growth. This is shown by an outward shift of the PPF."
        },
        {
          "front": "When a country specializes in producing a good for which it has a lower opportunity cost, it is engaging in what?",
          "back": "Trade based on comparative advantage."
        },
        {
          "front": "What economic tool is used to analyze the trade-offs between producing two different goods?",
          "back": "The Production Possibilities Frontier (PPF)."
        }
      ]
    }
  ]
}
