{
  "flashcards": [
    {
      "category": "Elasticity of Demand and Supply",
      "cards": [
        {
          "front": "What is **price elasticity of demand**?",
          "back": "A measure of how sensitive the quantity demanded is to a change in price."
        },
        {
          "front": "What does it mean if demand is **elastic**?",
          "back": "The quantity demanded changes by a larger percentage than the price change. Price elasticity of demand (PED) is greater than 1."
        },
        {
          "front": "What does it mean if demand is **inelastic**?",
          "back": "The quantity demanded changes by a smaller percentage than the price change. PED is less than 1."
        },
        {
          "front": "What is **unit elastic** demand?",
          "back": "The percentage change in quantity demanded is equal to the percentage change in price. PED is equal to 1."
        },
        {
          "front": "What is **price elasticity of supply**?",
          "back": "A measure of how sensitive the quantity supplied is to a change in price."
        },
        {
          "front": "What does it mean if supply is **elastic**?",
          "back": "The quantity supplied changes by a larger percentage than the price change. Price elasticity of supply (PES) is greater than 1."
        },
        {
          "front": "What does it mean if supply is **inelastic**?",
          "back": "The quantity supplied changes by a smaller percentage than the price change. PES is less than 1."
        },
        {
          "front": "What is **income elasticity of demand**?",
          "back": "A measure of how the quantity demanded for a good changes in response to a change in consumer income."
        },
        {
          "front": "What is a **normal good** in terms of income elasticity?",
          "back": "A good with a positive income elasticity; as income rises, demand for the good also rises."
        },
        {
          "front": "What is an **inferior good** in terms of income elasticity?",
          "back": "A good with a negative income elasticity; as income rises, demand for the good falls."
        },
        {
          "front": "What is **cross-price elasticity of demand**?",
          "back": "A measure of how the quantity demanded for one good changes in response to a change in the price of another good."
        },
        {
          "front": "What does a **positive** cross-price elasticity of demand indicate?",
          "back": "That the two goods are **substitutes**. An increase in the price of one leads to an increase in demand for the other (e.g., coffee and tea)."
        },
        {
          "front": "What does a **negative** cross-price elasticity of demand indicate?",
          "back": "That the two goods are **complements**. An increase in the price of one leads to a decrease in demand for the other (e.g., printers and ink cartridges)."
        },
        {
          "front": "Name a key factor that influences the price elasticity of demand.",
          "back": "The availability of close substitutes."
        },
        {
          "front": "How does elasticity help businesses?",
          "back": "It helps them predict how sales will change if they adjust their prices, which is crucial for pricing strategy."
        },
        {
          "front": "How does elasticity help the government?",
          "back": "It helps them predict the impact of taxes or subsidies on a market. For example, a tax on an inelastic good (like cigarettes) will generate more revenue."
        },
        {
          "front": "When is demand for a good perfectly inelastic?",
          "back": "When a change in price causes no change in the quantity demanded. The PED is 0 (e.g., life-saving medicine)."
        },
        {
          "front": "What is the formula for calculating price elasticity of demand?",
          "back": "Percentage change in quantity demanded divided by the percentage change in price."
        },
        {
          "front": "If the price of a good increases by 10% and the quantity demanded falls by 20%, what is the PED?",
          "back": "2 (since | -20% / 10% | = 2). The demand is elastic."
        },
        {
          "front": "What is the relationship between the slope of a demand curve and elasticity?",
          "back": "While related, they are not the same. A steeper demand curve is generally more inelastic, but elasticity changes along a linear demand curve even though the slope is constant."
        }
      ]
    }
  ]
}
