{
  "flashcards": [
    {
      "category": "Employment and Inflation",
      "cards": [
        {
          "front": "What is **unemployment rate**?",
          "back": "The percentage of the labour force that is unemployed."
        },
        {
          "front": "Who is considered **unemployed**?",
          "back": "A person who is not currently working but is actively looking for a job."
        },
        {
          "front": "What is **frictional unemployment**?",
          "back": "Unemployment that occurs when people are voluntarily moving between jobs."
        },
        {
          "front": "What is **structural unemployment**?",
          "back": "Unemployment caused by a mismatch between the skills of job seekers and the skills required for the jobs available."
        },
        {
          "front": "What is **cyclical unemployment**?",
          "back": "Unemployment that rises during economic downturns and falls when the economy improves."
        },
        {
          "front": "What is **inflation**?",
          "back": "A general, sustained increase in the prices of goods and services over a period of time."
        },
        {
          "front": "How is inflation commonly measured?",
          "back": "Using the Consumer Price Index (CPI) or the GDP deflator."
        },
        {
          "front": "What is the **Consumer Price Index (CPI)**?",
          "back": "A measure of the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services."
        },
        {
          "front": "What is **demand-pull inflation**?",
          "back": "Inflation caused by an increase in aggregate demand, which pulls prices up."
        },
        {
          "front": "What is **cost-push inflation**?",
          "back": "Inflation caused by an increase in the costs of production, which pushes prices up."
        },
        {
          "front": "What is the **Phillips Curve**?",
          "back": "A curve that shows the historical inverse relationship between the rate of unemployment and the rate of inflation."
        },
        {
          "front": "What does the short-run Phillips Curve suggest about the trade-off between inflation and unemployment?",
          "back": "It suggests that policymakers can choose between a lower rate of unemployment and a higher rate of inflation, or vice versa."
        },
        {
          "front": "What is the natural rate of unemployment?",
          "back": "The unemployment rate that would exist in a healthy economy, consisting only of frictional and structural unemployment."
        },
        {
          "front": "What is **deflation**?",
          "back": "A decrease in the general price level of goods and services."
        },
        {
          "front": "What is the **labour force**?",
          "back": "The total number of employed and unemployed people in an economy."
        },
        {
          "front": "How is the unemployment rate calculated?",
          "back": "Unemployment rate = (Number of Unemployed / Labour Force) x 100."
        },
        {
          "front": "What are some of the costs of inflation?",
          "back": "Reduced purchasing power, uncertainty, and a redistribution of wealth from savers to borrowers."
        },
        {
          "front": "What is **stagflation**?",
          "back": "A period of high inflation and high unemployment, contradicting the traditional Phillips Curve."
        },
        {
          "front": "How can government policy affect unemployment?",
          "back": "Through fiscal policies like government spending or monetary policies like interest rate changes."
        },
        {
          "front": "Why might the long-run Phillips Curve be vertical?",
          "back": "Because in the long run, unemployment will return to its natural rate regardless of the inflation rate."
        }
      ]
    }
  ]
}
