{
  "flashcards": [
    {
      "category": "Government and Fiscal Policy",
      "cards": [
        {
          "front": "What is **fiscal policy**?",
          "back": "The use of government spending and taxation to influence the economy's performance."
        },
        {
          "front": "What is the primary goal of **expansionary fiscal policy**?",
          "back": "To stimulate the economy during a recession by increasing government spending or cutting taxes."
        },
        {
          "front": "What is the primary goal of **contractionary fiscal policy**?",
          "back": "To slow down an economy during a period of high inflation by decreasing government spending or raising taxes."
        },
        {
          "front": "What is a **budget deficit**?",
          "back": "A situation where a government's spending exceeds its revenue (taxes) in a given fiscal year."
        },
        {
          "front": "What is **national debt**?",
          "back": "The total accumulation of a country's budget deficits over time."
        },
        {
          "front": "What are some examples of government spending?",
          "back": "Spending on infrastructure (roads), defense, education, and social programs."
        },
        {
          "front": "What are the two main types of taxes?",
          "back": "Direct taxes (on income and wealth) and indirect taxes (on goods and services)."
        },
        {
          "front": "How can fiscal policy affect aggregate demand?",
          "back": "An increase in government spending or a decrease in taxes shifts the aggregate demand curve to the right."
        },
        {
          "front": "What is the **crowding-out effect**?",
          "back": "A situation where increased government spending financed by borrowing leads to higher interest rates and a reduction in private investment."
        },
        {
          "front": "What is the **Keynesian multiplier**?",
          "back": "The idea that an initial change in spending (by government or consumers) can lead to a much larger change in national income."
        },
        {
          "front": "What is an **automatic stabilizer**?",
          "back": "A feature of the tax and transfer system that automatically works to stabilize the economy without deliberate government action (e.g., unemployment benefits)."
        },
        {
          "front": "What is a major potential problem with fiscal policy?",
          "back": "It can be subject to significant time lags (recognition, administrative, and impact lags), which can make it difficult to implement effectively."
        },
        {
          "front": "What is the difference between a **progressive tax** and a **regressive tax**?",
          "back": "A progressive tax takes a larger percentage of income from high-income earners, while a regressive tax takes a larger percentage from low-income earners."
        },
        {
          "front": "What is a **balanced budget**?",
          "back": "A situation where government revenues are equal to government spending in a fiscal year."
        },
        {
          "front": "How can a government finance a budget deficit?",
          "back": "By borrowing money, typically by selling government bonds to the public."
        },
        {
          "front": "What are the potential consequences of high national debt?",
          "back": "Higher interest payments, a potential burden on future generations, and a risk to a country's credit rating."
        },
        {
          "front": "What is the relationship between fiscal policy and monetary policy?",
          "back": "They are the two primary tools used by governments to manage the economy, often used in conjunction."
        },
        {
          "front": "What is **discretionary fiscal policy**?",
          "back": "Fiscal policy that involves intentional changes in government spending or taxes to influence the economy, as opposed to automatic stabilizers."
        },
        {
          "front": "How do tax cuts affect the economy?",
          "back": "They increase consumers' disposable income, which can lead to increased consumption and investment, stimulating the economy."
        },
        {
          "front": "What is the **Ricardian equivalence** theory?",
          "back": "The idea that taxpayers will anticipate future tax increases to pay for current deficits and will therefore save more, negating the stimulative effect of the deficit."
        }
      ]
    }
  ]
}
