{
  "flashcards": [
    {
      "category": "Introduction to Economics",
      "cards": [
        {
          "front": "What is the definition of Economics?",
          "back": "The study of how individuals and societies choose to allocate scarce resources to satisfy unlimited wants."
        },
        {
          "front": "Explain the concept of scarcity.",
          "back": "The fundamental economic problem of having seemingly unlimited human wants and needs in a world of limited resources. It forces us to make choices."
        },
        {
          "front": "What is 'opportunity cost'?",
          "back": "The value of the next-best alternative that must be forgone when a choice is made."
        },
        {
          "front": "What is a 'scale of preference'?",
          "back": "A list of a person's wants arranged in order of importance or priority."
        },
        {
          "front": "What is an 'economic decision-making unit'?",
          "back": "An individual, household, firm, or government that makes choices on the use of scarce resources."
        },
        {
          "front": "What is 'Macroeconomics'?",
          "back": "The branch of economics that studies the behavior and performance of an economy as a whole, focusing on issues like GDP, inflation, and unemployment."
        },
        {
          "front": "What is 'Microeconomics'?",
          "back": "The branch of economics that studies the behavior of individual economic agents, such as consumers and firms, and their interactions in specific markets."
        },
        {
          "front": "What is a 'positive statement'?",
          "back": "A factual statement that can be tested, proven, or disproven by referring to economic data. It describes 'what is'."
        },
        {
          "front": "What is a 'normative statement'?",
          "back": "A statement that is based on value judgments and opinions. It describes 'what ought to be' or 'what should be'."
        },
        {
          "front": "Who is known as the 'Father of Modern Economics' and wrote 'The Wealth of Nations'?",
          "back": "Adam Smith. He introduced the concept of the 'invisible hand'."
        },
        {
          "front": "Which famous economist developed the theory of comparative advantage?",
          "back": "David Ricardo. This theory explains why countries benefit from international trade."
        },
        {
          "front": "Which economist is famous for defining economics as the science of choice under scarcity?",
          "back": "Lionel Robbins."
        },
        {
          "front": "Which economist is considered a founder of macroeconomics and advocated for government spending to combat recessions?",
          "back": "John Maynard Keynes."
        },
        {
          "front": "Which economist is known for formalizing the modern theory of supply and demand?",
          "back": "Alfred Marshall."
        },
        {
          "front": "Who defined economics as 'a science which studies human behaviour as a relationship between ends and scarce means which have alternative uses'?",
          "back": "Lionel Robbins"
        },
        {
          "front": "Who defined economics as 'an inquiry into the nature and causes of the wealth of nations'?",
          "back": "Adam Smith"
        },
        {
          "front": "Adam Smith believed the economy would always self-regulate without state intervention because of what two words?",
          "back": "The Invisible Hand"
        },
        {
          "front": "Opportunity cost is also known as what?",
          "back": "Real Cost"
        },
        {
          "front": "The study of how household income and spending affects a country's economic growth is a study of what?",
          "back": "Macroeconomics"
        },
        {
          "front": "What is the study of how one family's spending habits affect the prices of goods and services?",
          "back": "Microeconomics"
        }
      ]
    }
  ]
}