{
  "flashcards": [
    {
      "category": "Market Structures",
      "cards": [
        {
          "front": "What is **perfect competition**?",
          "back": "A market structure with many sellers, identical products, easy entry and exit, and no single firm having control over price."
        },
        {
          "front": "What is a **monopoly**?",
          "back": "A market structure where there is a single seller of a product with no close substitutes, and high barriers to entry."
        },
        {
          "front": "What is **monopolistic competition**?",
          "back": "A market structure with many sellers, but each offers a slightly differentiated product, and there is easy entry and exit."
        },
        {
          "front": "What is an **oligopoly**?",
          "back": "A market structure with a few large firms that dominate the market, often with high barriers to entry and a focus on strategic interaction."
        },
        {
          "front": "In which market structure are firms considered **price takers**?",
          "back": "Perfect competition, because they have to accept the market price set by the forces of supply and demand."
        },
        {
          "front": "How is price determined in a perfectly competitive market?",
          "back": "The market price is determined by the intersection of market supply and demand curves. Individual firms sell at this price."
        },
        {
          "front": "How does a monopolist determine its price and output?",
          "back": "A monopolist maximizes profit by producing where marginal revenue (MR) equals marginal cost (MC), and then sets the price according to the demand curve at that output level."
        },
        {
          "front": "What is the key characteristic of products in monopolistic competition?",
          "back": "Product differentiation, which gives firms some control over their prices."
        },
        {
          "front": "What is a major barrier to entry in an oligopoly?",
          "back": "High capital requirements, economies of scale, patents, or control of essential resources."
        },
        {
          "front": "What is **long-run equilibrium** for a perfectly competitive firm?",
          "back": "A state where the firm earns zero economic profit, as new firms have entered the market, driving down price to the minimum of the average total cost curve."
        },
        {
          "front": "Can a monopolist earn economic profits in the long run?",
          "back": "Yes, because high barriers to entry prevent new firms from entering the market to compete away profits."
        },
        {
          "front": "How does monopolistic competition differ from a monopoly?",
          "back": "In monopolistic competition, there are many firms and easy entry/exit, while a monopoly has only one firm and high barriers to entry."
        },
        {
          "front": "What is a **cartel**?",
          "back": "A formal agreement among a group of oligopoly firms to coordinate their output and prices, often acting like a single monopoly."
        },
        {
          "front": "What is the relationship between price and marginal revenue in a monopoly?",
          "back": "Price is always greater than marginal revenue because the monopolist must lower the price on all units sold to sell one more unit."
        },
        {
          "front": "Why do firms in monopolistic competition spend money on advertising?",
          "back": "To highlight the unique features of their products and convince consumers that their product is superior to those of their competitors."
        },
        {
          "front": "In a perfectly competitive market, what is the relationship between price, marginal revenue, and average revenue?",
          "back": "Price = Marginal Revenue (MR) = Average Revenue (AR)."
        },
        {
          "front": "What is an example of an oligopoly?",
          "back": "The market for airlines, cell phone carriers, or soft drinks, where a few large companies dominate."
        },
        {
          "front": "What is the primary goal of a firm, regardless of market structure?",
          "back": "To maximize profit."
        },
        {
          "front": "What is a natural monopoly?",
          "back": "A type of monopoly that exists due to the high start-up costs or powerful economies of scale in a particular industry, making it efficient for a single firm to serve the entire market."
        },
        {
          "front": "How does a firm in monopolistic competition determine its price and output in the short run?",
          "back": "Similar to a monopoly, it produces where marginal revenue equals marginal cost and then sets the price on the demand curve."
        }
      ]
    }
  ]
}
