{
  "flashcards": [
    {
      "category": "National Income and Circular Flow",
      "cards": [
        {
          "front": "What does **Gross Domestic Product (GDP)** measure?",
          "back": "The total market value of all final goods and services produced within a country's borders in a specific time period."
        },
        {
          "front": "What is the key difference between GDP and **Gross National Product (GNP)**?",
          "back": "GDP measures production within a country's borders, while GNP measures the production of a country's citizens, regardless of where they are located."
        },
        {
          "front": "What is the **circular flow of income** model?",
          "back": "A diagram that shows the flow of money, goods, and services between different sectors of the economy, such as households and firms."
        },
        {
          "front": "In the simplest circular flow model, what flows from firms to households?",
          "back": "Wages, rent, interest, and profit (income)."
        },
        {
          "front": "In the simplest circular flow model, what flows from households to firms?",
          "back": "Spending on goods and services."
        },
        {
          "front": "What are **leakages** in the circular flow model?",
          "back": "Money that leaves the circular flow of income, reducing the amount available for spending (e.g., saving, taxes, and imports)."
        },
        {
          "front": "What are **injections** in the circular flow model?",
          "back": "Money that enters the circular flow of income, increasing the amount available for spending (e.g., investment, government spending, and exports)."
        },
        {
          "front": "What is the equation for GDP using the expenditure approach?",
          "back": "GDP = C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports."
        },
        {
          "front": "Why are intermediate goods not included in GDP calculations?",
          "back": "To avoid double-counting. Only the value of final goods and services is counted."
        },
        {
          "front": "What is **Nominal GDP**?",
          "back": "The value of goods and services produced, measured at current market prices."
        },
        {
          "front": "What is **Real GDP**?",
          "back": "The value of goods and services produced, adjusted for inflation, to reflect changes in the actual quantity of output."
        },
        {
          "front": "How do you calculate Real GDP?",
          "back": "By dividing Nominal GDP by the GDP deflator (a price index)."
        },
        {
          "front": "What does GDP per capita measure?",
          "back": "The average economic output per person in a country, often used as a measure of a country's standard of living."
        },
        {
          "front": "What is the primary difference between Net National Product (NNP) and GNP?",
          "back": "NNP is GNP minus capital consumption allowance (depreciation)."
        },
        {
          "front": "What is a major limitation of GDP as a measure of a nation's well-being?",
          "back": "It does not account for non-market activities (like household production), income distribution, environmental quality, or leisure time."
        },
        {
          "front": "What happens to the circular flow of income if saving exceeds investment?",
          "back": "The level of national income will decrease."
        },
        {
          "front": "What happens to the circular flow of income if government spending exceeds taxation?",
          "back": "The level of national income will increase."
        },
        {
          "front": "What happens to the circular flow of income if exports exceed imports?",
          "back": "The level of national income will increase."
        },
        {
          "front": "What is the **income approach** to calculating GDP?",
          "back": "Summing up all the incomes earned from production, such as wages, rent, interest, and profits."
        },
        {
          "front": "What is a **transfer payment** and why is it excluded from GDP calculations?",
          "back": "A payment made without goods or services being received in return (e.g., social security). It is excluded because it is not a payment for current production."
        }
      ]
    }
  ]
}
