{
  "flashcards": [
    {
      "category": "Production and Costs",
      "cards": [
        {
          "front": "What is a **production function**?",
          "back": "A mathematical relationship that describes the maximum output that can be produced with a given set of inputs."
        },
        {
          "front": "What is the **short run** in economics?",
          "back": "A period of time during which at least one input (like a factory or land) is fixed and cannot be changed."
        },
        {
          "front": "What is the **long run** in economics?",
          "back": "A period of time during which all inputs, including the size of the factory, are variable."
        },
        {
          "front": "What are **fixed costs**?",
          "back": "Costs that do not change with the level of output (e.g., rent, insurance)."
        },
        {
          "front": "What are **variable costs**?",
          "back": "Costs that vary with the level of output (e.g., raw materials, wages for production workers)."
        },
        {
          "front": "What is **total cost**?",
          "back": "The sum of a firm's fixed costs and variable costs."
        },
        {
          "front": "What is **marginal cost**?",
          "back": "The additional cost incurred by producing one more unit of a good or service."
        },
        {
          "front": "What is the **Law of Diminishing Marginal Returns**?",
          "back": "The principle that as more units of a variable input are added to a fixed input, the marginal product of the variable input will eventually decrease."
        },
        {
          "front": "What is **marginal product**?",
          "back": "The change in total output that results from employing one additional unit of a variable input, like labor."
        },
        {
          "front": "What is the relationship between marginal cost and marginal product?",
          "back": "Marginal cost falls when marginal product rises, and marginal cost rises when marginal product falls."
        },
        {
          "front": "What is **average total cost**?",
          "back": "Total cost divided by the quantity of output produced."
        },
        {
          "front": "What is the shape of the short-run average total cost curve?",
          "back": "It is U-shaped, reflecting the effects of diminishing returns."
        },
        {
          "front": "What are **economies of scale**?",
          "back": "A situation in which a firm's average total cost of production decreases as its scale of output increases."
        },
        {
          "front": "What are **diseconomies of scale**?",
          "back": "A situation in which a firm's average total cost of production increases as its scale of output increases."
        },
        {
          "front": "What causes diseconomies of scale?",
          "back": "Management difficulties, coordination problems, and other inefficiencies that arise as a firm becomes too large."
        },
        {
          "front": "What are **constant returns to scale**?",
          "back": "A situation in which a firm's average total cost remains constant as its scale of output increases."
        },
        {
          "front": "What is the relationship between the short-run average total cost curves and the long-run average cost curve?",
          "back": "The long-run average cost curve is an envelope that touches the bottom of all possible short-run average total cost curves."
        },
        {
          "front": "What is the primary goal of a firm in a market economy?",
          "back": "To maximize profit, which is the difference between total revenue and total cost."
        },
        {
          "front": "If a firm's total cost is $500 and it produces 100 units, what is its average total cost?",
          "back": "$5 per unit ($500 / 100 units)."
        },
        {
          "front": "What is the term for the revenue a firm earns from selling one additional unit of output?",
          "back": "Marginal Revenue."
        }
      ]
    }
  ]
}
