{
  "flashcards": [
    {
      "category": "Labour Market and Wages",
      "cards": [
        {
          "front": "What is the **demand for labour**?",
          "back": "The number of workers that firms are willing and able to hire at a given wage rate."
        },
        {
          "front": "What is the **supply of labour**?",
          "back": "The number of workers willing and able to work at a given wage rate."
        },
        {
          "front": "What is the **equilibrium wage rate**?",
          "back": "The wage at which the quantity of labour demanded equals the quantity of labour supplied."
        },
        {
          "front": "What are the key determinants of labour **demand**?",
          "back": "The price of the firm's product, the productivity of workers, and the cost of other inputs."
        },
        {
          "front": "What are the key determinants of labour **supply**?",
          "back": "The wage rate, non-monetary benefits of a job, workers' preferences for leisure, and the size of the working-age population."
        },
        {
          "front": "What is a **trade union**?",
          "back": "An organization that acts as a collective bargaining agent for its members to improve working conditions, wages, and benefits."
        },
        {
          "front": "How can a union influence wages?",
          "back": "By using its bargaining power to negotiate higher wages than the equilibrium wage rate."
        },
        {
          "front": "What is the **minimum wage**?",
          "back": "A government-mandated price floor on the wage rate, setting the lowest hourly wage that an employer can legally pay workers."
        },
        {
          "front": "What is the potential negative effect of a minimum wage increase?",
          "back": "It can lead to a surplus of labour, causing unemployment, particularly for low-skilled workers."
        },
        {
          "front": "What is **human capital**?",
          "back": "The knowledge, skills, and experience that an individual possesses, which can be used to produce economic value."
        },
        {
          "front": "How does human capital affect wages?",
          "back": "Workers with higher levels of human capital are generally more productive and can command higher wages."
        },
        {
          "front": "What is a **monopsony** in the labour market?",
          "back": "A market structure where there is a single buyer of labour (a single employer) who has significant power to influence the wage rate."
        },
        {
          "front": "How does a monopsony determine wages?",
          "back": "It hires fewer workers and pays a lower wage than a competitive labour market would."
        },
        {
          "front": "What is **derived demand**?",
          "back": "The demand for a factor of production, like labour, which is derived from the demand for the goods or services that the factor helps produce."
        },
        {
          "front": "How does a labour market's elasticity of demand affect a union's bargaining power?",
          "back": "If labour demand is inelastic, a union has more power to raise wages with little impact on employment."
        },
        {
          "front": "What does a backward-bending labour supply curve illustrate?",
          "back": "That at very high wages, workers may choose to work fewer hours, as the higher income allows them to 'purchase' more leisure time."
        },
        {
          "front": "What is the **wage-price spiral**?",
          "back": "A situation where rising wages lead to increased prices, which in turn leads to demands for even higher wages."
        },
        {
          "front": "What is **wage discrimination**?",
          "back": "Paying different wages to different workers for the same job, often based on factors like gender, race, or age, which is illegal in many places."
        },
        {
          "front": "What is a **living wage**?",
          "back": "A wage that is high enough to maintain a normal standard of living."
        },
        {
          "front": "What is the **substitution effect** of a wage increase?",
          "back": "As wages rise, the opportunity cost of leisure increases, so a worker may choose to substitute more work for leisure."
        }
      ]
    }
  ]
}
