{
  "flashcards": [
    {
      "category": "Alternating Current & Circuits",
      "cards": [
        {
          "front": "What is the key difference between **Alternating Current (AC)** and **Direct Current (DC)**?",
          "back": "AC periodically reverses direction, while DC flows in only one direction."
        },
        {
          "front": "What does **RMS** stand for and what does it represent?",
          "back": "Root Mean Square. It represents the effective value of an AC voltage or current, which delivers the same power as a DC source."
        },
        {
          "front": "What is the relationship between the RMS voltage and the peak voltage for a sine wave?",
          "back": "$$V_{RMS} = \\frac{V_{peak}}{\\sqrt{2}}$$"
        },
        {
          "front": "What is the relationship between the RMS current and the peak current ($$I_{peak}$$)?",
          "back": "$$I_{RMS} = \\frac{I_{peak}}{\\sqrt{2}}$$"
        },
        {
          "front": "How does a **resistor** behave in an AC circuit?",
          "back": "The resistor's opposition to current, its resistance, is constant and independent of frequency."
        },
        {
          "front": "What is the **phase relationship** between voltage and current in a purely resistive AC circuit?",
          "back": "They are in phase, meaning their peaks and zeros occur at the same time."
        },
        {
          "front": "What is a **capacitor**?",
          "back": "An electrical component that stores energy in an electric field."
        },
        {
          "front": "How does a capacitor behave in an AC circuit?",
          "back": "It opposes the change in voltage, with its opposition to current decreasing as frequency increases."
        },
        {
          "front": "What is the **capacitive reactance** ($$X_C$$)?",
          "back": "The opposition a capacitor offers to alternating current."
        },
        {
          "front": "What is the formula for capacitive reactance?",
          "back": "$$X_C = \\frac{1}{2\\pi fC}$$"
        },
        {
          "front": "What is the **phase relationship** between voltage and current in a purely capacitive AC circuit?",
          "back": "The current leads the voltage by 90 degrees ($$\\frac{\\pi}{2}$$ radians)."
        },
        {
          "front": "What is an **inductor**?",
          "back": "A coil of wire that stores energy in a magnetic field."
        },
        {
          "front": "How does an inductor behave in an AC circuit?",
          "back": "It opposes changes in current, with its opposition to current increasing as frequency increases."
        },
        {
          "front": "What is the **inductive reactance** ($$X_L$$)?",
          "back": "The opposition an inductor offers to alternating current."
        },
        {
          "front": "What is the formula for inductive reactance?",
          "back": "$$X_L = 2\\pi fL$$"
        },
        {
          "front": "What is the **phase relationship** between voltage and current in a purely inductive AC circuit?",
          "back": "The voltage leads the current by 90 degrees ($$\\frac{\\pi}{2}$$ radians)."
        },
        {
          "front": "What is **impedance** ($$Z$$)?",
          "back": "The total opposition to alternating current in a circuit, combining resistance and reactance."
        },
        {
          "front": "What is the formula for the impedance of a series RLC circuit?",
          "back": "$$Z = \\sqrt{R^2 + (X_L - X_C)^2}$$"
        },
        {
          "front": "What is **Ohm's Law** for AC circuits?",
          "back": "$$V = IZ$$"
        },
        {
          "front": "What is a **series RLC circuit**?",
          "back": "A circuit containing a resistor, inductor, and capacitor connected in series with an AC voltage source."
        },
        {
          "front": "What is the condition for **resonance** in a series RLC circuit?",
          "back": "Inductive reactance equals capacitive reactance ($$X_L = X_C$$)."
        },
        {
          "front": "What happens to impedance at resonance?",
          "back": "Impedance is at its minimum value, equal to the resistance ($$Z = R$$)."
        },
        {
          "front": "What happens to the current at resonance?",
          "back": "Current is at its maximum value."
        },
        {
          "front": "What is the formula for the **resonant frequency** ($$f_0$$)?",
          "back": "$$f_0 = \\frac{1}{2\\pi\\sqrt{LC}}$$"
        },
        {
          "front": "What is the **phase angle** ($$\\phi$$) of a series RLC circuit?",
          "back": "The angle between the voltage and current phasors, representing the phase difference."
        },
        {
          "front": "What is the formula for the phase angle?",
          "back": "$$\\phi = \\arctan\\left(\\frac{X_L - X_C}{R}\\right)$$ (also called the power factor angle)."
        },
        {
          "front": "In a series RLC circuit, when is the voltage lagging the current?",
          "back": "When the circuit is capacitive ($$X_C > X_L$$), resulting in a negative phase angle."
        },
        {
          "front": "What is **power factor**?",
          "back": "The ratio of true power (or real power) to apparent power in an AC circuit."
        },
        {
          "front": "What is the formula for power factor?",
          "back": "$$PF = \\cos\\phi = \\frac{R}{Z}$$"
        },
        {
          "front": "What is the formula for the average power in a series RLC circuit?",
          "back": "$$P_{avg} = V_{RMS}I_{RMS}\\cos\\phi$$"
        },
        {
          "front": "Why is power factor important?",
          "back": "A low power factor indicates an inefficient use of power, as a larger current is needed to deliver the same amount of useful energy."
        },
        {
          "front": "What is a **transformer**?",
          "back": "A device that uses induction to change AC voltage from one level to another."
        },
        {
          "front": "Why do transformers only work with AC, not DC?",
          "back": "Transformers require a changing magnetic flux to induce a voltage in the secondary coil, which is only produced by alternating current."
        },
        {
          "front": "What is the **Transformer Equation**?",
          "back": "$$\\frac{V_s}{V_p} = \\frac{N_s}{N_p}$$"
        },
        {
          "front": "What is a **step-up transformer**?",
          "back": "A transformer that increases voltage by having more turns on the secondary coil ($$N_s > N_p$$)."
        },
        {
          "front": "What is a **step-down transformer**?",
          "back": "A transformer that decreases voltage by having fewer turns on the secondary coil ($$N_s < N_p$$)."
        },
        {
          "front": "Why are high voltages used for long-distance power transmission?",
          "back": "To reduce current and minimize energy losses due to resistance ($$P_{loss} = I^2R$$)."
        },
        {
          "front": "In an AC circuit, what is the instantaneous voltage?",
          "back": "$$V(t) = V_{peak}\\sin(2\\pi ft)$$."
        },
        {
          "front": "What happens to the impedance of a series RLC circuit when the frequency is much lower than the resonant frequency?",
          "back": "The circuit becomes highly capacitive, and the impedance is dominated by $$X_C$$."
        },
        {
          "front": "What happens to the impedance of a series RLC circuit when the frequency is much higher than the resonant frequency?",
          "back": "The circuit becomes highly inductive, and the impedance is dominated by $$X_L$$."
        }
      ]
    }
  ]
}
