{
  "flashcards": [
    {
      "category": "Atomic & Nuclear Physics",
      "cards": [
        {
          "front": "What are the three main subatomic particles in an atom?",
          "back": "Protons, neutrons, and electrons."
        },
        {
          "front": "What is the **atomic number** ($$Z$$)?",
          "back": "The number of protons in the nucleus of an atom."
        },
        {
          "front": "What is the **mass number** ($$A$$)?",
          "back": "The total number of protons and neutrons in the nucleus."
        },
        {
          "front": "What is an **isotope**?",
          "back": "Atoms of the same element (same number of protons) but with a different number of neutrons."
        },
        {
          "front": "What is **radioactivity**?",
          "back": "The spontaneous emission of radiation from an unstable atomic nucleus."
        },
        {
          "front": "What is **alpha ($$\\alpha$$) decay**?",
          "back": "The emission of an alpha particle (a helium nucleus, $$^4_2\\text{He}$$) from a nucleus."
        },
        {
          "front": "How does alpha decay affect the atomic and mass numbers?",
          "back": "The atomic number ($$Z$$) decreases by 2, and the mass number ($$A$$) decreases by 4."
        },
        {
          "front": "What is **beta ($$\\beta$$) decay**?",
          "back": "The emission of a beta particle (an electron or positron) from a nucleus."
        },
        {
          "front": "How does beta-minus ($$\\beta^-$$) decay affect the atomic and mass numbers?",
          "back": "A neutron turns into a proton, so the atomic number ($$Z$$) increases by 1, and the mass number ($$A$$) remains the same."
        },
        {
          "front": "What is **gamma ($$\\gamma$$) decay**?",
          "back": "The emission of a gamma ray (a high-energy photon) from an excited nucleus."
        },
        {
          "front": "How does gamma decay affect the atomic and mass numbers?",
          "back": "It does not change either the atomic number or the mass number; it only releases energy."
        },
        {
          "front": "What is **half-life**?",
          "back": "The time required for half of the radioactive nuclei in a sample to undergo decay."
        },
        {
          "front": "What is the formula for the number of remaining radioactive nuclei after n half-lives?",
          "back": "$$N = N_0 \\left(\\frac{1}{2}\\right)^n$$"
        },
        {
          "front": "What is **nuclear fission**?",
          "back": "The splitting of a large, unstable nucleus into two or more smaller nuclei, releasing a large amount of energy."
        },
        {
          "front": "What is a **chain reaction**?",
          "back": "A self-sustaining series of nuclear fissions where the neutrons released from one fission trigger subsequent fissions."
        },
        {
          "front": "What is **nuclear fusion**?",
          "back": "The process of combining two light atomic nuclei to form a single, heavier nucleus, releasing a huge amount of energy."
        },
        {
          "front": "Where does nuclear fusion naturally occur?",
          "back": "In the cores of stars, such as our sun."
        },
        {
          "front": "What is **mass defect**?",
          "back": "The difference between the mass of a nucleus and the sum of the masses of its individual protons and neutrons."
        },
        {
          "front": "Why does mass defect occur?",
          "back": "Some of the mass of the protons and neutrons is converted into binding energy to hold the nucleus together."
        },
        {
          "front": "What is **binding energy**?",
          "back": "The energy required to disassemble a nucleus into its individual protons and neutrons."
        },
        {
          "front": "What is the relationship between mass defect and binding energy?",
          "back": "They are related by Einstein's mass-energy equivalence equation, $$E = \\Delta m c^2$$."
        },
        {
          "front": "What is the **strong nuclear force**?",
          "back": "The fundamental force that holds protons and neutrons together in the nucleus, overcoming the electrostatic repulsion between protons."
        },
        {
          "front": "Why is the strong force called a short-range force?",
          "back": "It is only effective over very small distances, on the scale of the nucleus itself."
        },
        {
          "front": "What is an **isobar**?",
          "back": "Atoms of different elements with the same mass number ($$A$$) but different atomic numbers ($$Z$$)."
        },
        {
          "front": "What is a **nucleon**?",
          "back": "A collective term for a proton or a neutron."
        },
        {
          "front": "What is the difference in penetrating power between alpha, beta, and gamma radiation?",
          "back": "Gamma has the highest, followed by beta, and alpha has the lowest."
        },
        {
          "front": "What can stop alpha radiation?",
          "back": "A sheet of paper or the outer layer of skin."
        },
        {
          "front": "What can stop beta radiation?",
          "back": "A thin sheet of aluminum or wood."
        },
        {
          "front": "What can stop gamma radiation?",
          "back": "A thick layer of lead or concrete."
        },
        {
          "front": "What is the process called when an unstable nucleus becomes stable by emitting particles or energy?",
          "back": "Radioactive decay."
        },
        {
          "front": "What is the **activity** of a radioactive sample?",
          "back": "The rate at which nuclei decay."
        },
        {
          "front": "What is the unit of activity?",
          "back": "The Becquerel (Bq), which is one decay per second."
        },
        {
          "front": "What is the primary product of a beta-plus ($$\\beta^+$$) decay?",
          "back": "A positron and a neutron, as a proton turns into a neutron."
        },
        {
          "front": "In a nuclear equation, what must be conserved?",
          "back": "Both mass number ($$A$$) and atomic number ($$Z$$)."
        },
        {
          "front": "What is the main component of a **nuclear reactor**?",
          "back": "A core with fuel rods, control rods, and a moderator to control the chain reaction."
        },
        {
          "front": "What is the role of the **moderator** in a nuclear reactor?",
          "back": "To slow down fast neutrons to increase the probability of fission."
        },
        {
          "front": "What are **quarks**?",
          "back": "The fundamental particles that make up protons and neutrons."
        },
        {
          "front": "What is the quark composition of a proton?",
          "back": "Two 'up' quarks and one 'down' quark (uud)."
        },
        {
          "front": "What is the quark composition of a neutron?",
          "back": "One 'up' quark and two 'down' quarks (udd)."
        },
        {
          "front": "What is the difference between an excited state and a ground state in an atom?",
          "back": "An excited state is any energy level higher than the lowest possible energy level (ground state)."
        }
      ]
    }
  ]
}
