{
  "flashcards": [
    {
      "category": "Electric Fields & Potential",
      "cards": [
        {
          "front": "What is **Coulomb's Law**?",
          "back": "The force between two point charges is directly proportional to the product of the charges and inversely proportional to the square of the distance between them."
        },
        {
          "front": "What is the formula for the magnitude of the electrostatic force?",
          "back": "$$F = k\\frac{|q_1q_2|}{r^2}$$"
        },
        {
          "front": "What is the value of **Coulomb's constant** ($$k$$)?",
          "back": "$$8.99 \\times 10^9 \\text{ N} \\cdot \\text{m}^2/\\text{C}^2$$"
        },
        {
          "front": "What is an **electric field**?",
          "back": "A region of space where a charged object would experience an electric force."
        },
        {
          "front": "What is the formula for electric field strength in terms of force?",
          "back": "$$\\vec{E} = \\frac{\\vec{F}}{q}$$"
        },
        {
          "front": "What is the formula for the electric field from a point charge?",
          "back": "$$E = k\\frac{|q|}{r^2}$$"
        },
        {
          "front": "How are electric field lines drawn around a positive charge?",
          "back": "They point radially outward from the charge."
        },
        {
          "front": "How are electric field lines drawn around a negative charge?",
          "back": "They point radially inward towards the charge."
        },
        {
          "front": "How does the density of electric field lines indicate field strength?",
          "back": "A higher density of lines indicates a stronger electric field."
        },
        {
          "front": "What is **electric potential energy**?",
          "back": "The energy a charge possesses due to its position in an electric field."
        },
        {
          "front": "What is the formula for the electric potential energy of two point charges?",
          "back": "$$U = k\\frac{q_1q_2}{r}$$"
        },
        {
          "front": "What is **electric potential** (or **voltage**)?",
          "back": "Electric potential energy per unit charge, representing the potential for a charge to do work at a given location."
        },
        {
          "front": "What is the formula for electric potential from a point charge?",
          "back": "$$V = k\\frac{q}{r}$$"
        },
        {
          "front": "What is **potential difference**?",
          "back": "The change in electric potential between two points, also known as voltage ($$\\Delta V$$)."
        },
        {
          "front": "What is the relationship between electric potential and electric field?",
          "back": "The electric field is the negative gradient of the electric potential ($$\\vec{E} = -\\nabla V$$)."
        },
        {
          "front": "What is an **equipotential line**?",
          "back": "A line or surface where the electric potential is constant. No work is done moving a charge along an equipotential line."
        },
        {
          "front": "How do equipotential lines relate to electric field lines?",
          "back": "They are always perpendicular to each other."
        },
        {
          "front": "What is the electric field inside a charged conductor in electrostatic equilibrium?",
          "back": "Zero."
        },
        {
          "front": "Where does all the excess charge reside on a conductor?",
          "back": "On its outer surface."
        },
        {
          "front": "What is the electric potential on the surface of a charged conductor?",
          "back": "It is constant and equal to the potential at all points inside the conductor."
        },
        {
          "front": "What is a **dielectric**?",
          "back": "An insulating material that becomes polarized in the presence of an electric field, reducing the field's strength."
        },
        {
          "front": "What is the **Principle of Superposition** for electric forces?",
          "back": "The net force on a charge is the vector sum of all individual forces exerted by other charges."
        },
        {
          "front": "What is the **Principle of Superposition** for electric fields?",
          "back": "The net electric field at a point is the vector sum of the electric fields from all individual charges."
        },
        {
          "front": "How does the electrostatic force between two charges change if the distance between them is tripled?",
          "back": "The force decreases to one-ninth of its original value."
        },
        {
          "front": "How does the electric potential from a point charge change if the distance from the charge is doubled?",
          "back": "The potential is halved."
        },
        {
          "front": "What is the unit of electric potential energy?",
          "back": "Joules (J)."
        },
        {
          "front": "What is the unit of electric potential?",
          "back": "Volts (V)."
        },
        {
          "front": "What is the unit of electric field strength?",
          "back": "Newtons per Coulomb (N/C) or Volts per meter (V/m)."
        },
        {
          "front": "If a positive charge is moved in the direction of an electric field, does its electric potential energy increase or decrease?",
          "back": "Decrease."
        },
        {
          "front": "If a negative charge is moved in the direction of an electric field, does its electric potential energy increase or decrease?",
          "back": "Increase."
        },
        {
          "front": "What is the formula for the work done by an electric field on a charge?",
          "back": "$$W = -\\Delta U = -q\\Delta V$$"
        },
        {
          "front": "What is the **electron-volt** (eV)?",
          "back": "A unit of energy equal to the work done on an electron when it is moved through a potential difference of 1 volt."
        },
        {
          "front": "Why is the electric field always perpendicular to the surface of a charged conductor?",
          "back": "If it had a parallel component, it would cause charges to move on the surface, which contradicts the state of electrostatic equilibrium."
        },
        {
          "front": "What is the difference between a **conductor** and an **insulator**?",
          "back": "Conductors allow charges to move freely, while insulators restrict charge movement."
        },
        {
          "front": "In a uniform electric field, how does the potential difference relate to the field strength?",
          "back": "$$\\Delta V = -E\\Delta d$$ where $$\\Delta d$$ is the displacement in the direction of the field."
        },
        {
          "front": "How can you tell the direction of an electric field by looking at equipotential lines?",
          "back": "The electric field points from higher potential to lower potential, and is perpendicular to the equipotential lines."
        },
        {
          "front": "What is the magnitude of the force a proton would experience in an electric field of 500 N/C?",
          "back": "The force is the product of the field strength and the elementary charge ($$F = Eq$$)."
        },
        {
          "front": "What is the value of an elementary charge ($$e$$)?",
          "back": "$$1.602 \\times 10^{-19} \\text{ C}$$"
        },
        {
          "front": "What is the total charge of an object that has 5 excess electrons?",
          "back": "The total charge is $$5 \\times (-e)$$."
        },
        {
          "front": "How does the electrostatic force between two charges compare to the gravitational force between them?",
          "back": "The electrostatic force is significantly stronger than the gravitational force."
        }
      ]
    }
  ]
}
