{
  "flashcards": [
    {
      "category": "Gravitation & Satellites",
      "cards": [
        {
          "front": "What is **Newton's Law of Universal Gravitation**?",
          "back": "Every particle in the universe attracts every other particle with a force directly proportional to the product of their masses and inversely proportional to the square of the distance between them."
        },
        {
          "front": "What is the formula for Universal Gravitation?",
          "back": "$$F = G\\frac{m_1m_2}{r^2}$$"
        },
        {
          "front": "What is the value of the **Universal Gravitational Constant** ($$G$$)?",
          "back": "$$6.67 \\times 10^{-11} \\text{ N} \\cdot \\text{m}^2/\\text{kg}^2$$"
        },
        {
          "front": "What is a **gravitational field**?",
          "back": "A region of space around a massive object where another object would experience a gravitational force."
        },
        {
          "front": "What is the formula for **gravitational field strength** ($$g$$)?",
          "back": "$$g = G\\frac{M}{r^2}$$"
        },
        {
          "front": "How does the gravitational force change if the distance between two objects is doubled?",
          "back": "The force decreases to one-quarter of its original value."
        },
        {
          "front": "How does the gravitational force change if one of the masses is doubled?",
          "back": "The force doubles."
        },
        {
          "front": "What is **gravitational potential energy**?",
          "back": "The energy an object possesses due to its position in a gravitational field."
        },
        {
          "front": "What is the formula for gravitational potential energy?",
          "back": "$$U = -G\\frac{Mm}{r}$$"
        },
        {
          "front": "Why is gravitational potential energy always a negative value?",
          "back": "It is defined as zero at an infinite distance, and energy must be added to a system to move objects apart from a closer distance."
        },
        {
          "front": "What is the **orbital velocity** of a satellite?",
          "back": "The tangential speed required for a satellite to maintain a stable orbit around a central body."
        },
        {
          "front": "What is the formula for orbital velocity?",
          "back": "$$v_{orbital} = \\sqrt{\\frac{GM}{r}}$$"
        },
        {
          "front": "What is **escape velocity**?",
          "back": "The minimum speed an object needs to escape the gravitational pull of a planet or star completely."
        },
        {
          "front": "What is the formula for escape velocity?",
          "back": "$$v_{esc} = \\sqrt{\\frac{2GM}{r}}$$"
        },
        {
          "front": "What is the relationship between orbital velocity and escape velocity?",
          "back": "Escape velocity is $$\\sqrt{2}$$ times the orbital velocity at the same radius."
        },
        {
          "front": "Why does a satellite not fall back to Earth?",
          "back": "It is constantly falling towards the Earth, but its horizontal velocity is high enough that it continually 'misses' the surface."
        },
        {
          "front": "What is **Kepler's First Law**?",
          "back": "The orbit of a planet is an ellipse with the Sun at one of the two foci."
        },
        {
          "front": "What is **Kepler's Second Law**?",
          "back": "A line segment joining a planet and the Sun sweeps out equal areas during equal intervals of time."
        },
        {
          "front": "What is **Kepler's Third Law**?",
          "back": "The square of the orbital period ($$T^2$$) of a planet is directly proportional to the cube of the average distance from the sun ($$r^3$$)."
        },
        {
          "front": "What is a **geostationary satellite**?",
          "back": "A satellite that orbits the Earth at a specific altitude and has an orbital period of 24 hours, so it appears stationary from the ground."
        },
        {
          "front": "At what point in an elliptical orbit is a planet moving fastest?",
          "back": "When it is closest to the Sun (at perihelion)."
        },
        {
          "front": "At what point in an elliptical orbit is a planet moving slowest?",
          "back": "When it is farthest from the Sun (at aphelion)."
        },
        {
          "front": "What is **total mechanical energy** in an orbital system?",
          "back": "The sum of the kinetic energy and the gravitational potential energy ($$E_{total} = K + U$$)."
        },
        {
          "front": "How does the total mechanical energy of an orbiting satellite change?",
          "back": "It remains constant, assuming no external forces like air resistance."
        },
        {
          "front": "What is the **centripetal force** that keeps a satellite in orbit?",
          "back": "The gravitational force of the central body."
        },
        {
          "front": "If the mass of a planet were to double, how would the orbital speed of a satellite at the same radius change?",
          "back": "It would increase by a factor of $$\\sqrt{2}$$."
        },
        {
          "front": "What is the **orbital period**?",
          "back": "The time it takes for a satellite to complete one full revolution around its central body."
        },
        {
          "front": "Why are astronauts weightless in orbit?",
          "back": "They are in a state of continuous freefall, so they do not feel the normal force that creates the sensation of weight."
        },
        {
          "front": "What is the relationship between gravitational potential energy and distance from the central body?",
          "back": "Gravitational potential energy increases (becomes less negative) as the distance increases."
        },
        {
          "front": "Why do satellites require a launch vehicle to reach orbit?",
          "back": "They need to be lifted to a high altitude and given a high tangential velocity to achieve a stable orbit."
        },
        {
          "front": "What is the difference between a geosynchronous and a geostationary orbit?",
          "back": "A geosynchronous orbit has a 24-hour period but can be inclined. A geostationary orbit is a type of geosynchronous orbit that is directly above the equator."
        },
        {
          "front": "How does the angular momentum of a planet in orbit change?",
          "back": "It remains constant because there is no net external torque acting on it."
        },
        {
          "front": "What is the purpose of the **G** in the Universal Gravitation formula?",
          "back": "It is a proportionality constant that allows the equation to be used with standard units of force, mass, and distance."
        },
        {
          "front": "What is the relationship between the period and radius of a satellite's orbit?",
          "back": "The square of the period is proportional to the cube of the radius ($$T^2 \\propto r^3$$)."
        },
        {
          "front": "What is the condition for a stable circular orbit?",
          "back": "The gravitational force must be equal to the required centripetal force."
        },
        {
          "front": "What is the **tidal force**?",
          "back": "The differential gravitational force exerted by a celestial body on a body of a different size, causing tides."
        },
        {
          "front": "What are the two major forces acting on a rocket during launch?",
          "back": "The upward thrust from its engines and the downward force of gravity."
        },
        {
          "front": "How does the value of the acceleration due to gravity ($$g$$) on a planet change with altitude?",
          "back": "It decreases as altitude increases, following the inverse square law."
        },
        {
          "front": "How does the energy of a satellite change if it is moved to a higher orbit?",
          "back": "Its total energy increases (becomes less negative) because its gravitational potential energy increases."
        },
        {
          "front": "What does the **escape velocity** depend on?",
          "back": "The mass and radius of the central body."
        }
      ]
    }
  ]
}
