{
  "flashcards": [
    {
      "category": "Advanced Kinematics, Forces, & Momentum",
      "cards": [
        {
          "front": "What is the key difference between an **inertial** and a **non-inertial** reference frame?",
          "back": "An inertial frame is one that is not accelerating, whereas a non-inertial frame is accelerating and requires the use of fictitious forces to explain motion."
        },
        {
          "front": "What is the velocity of a projectile at the peak of its flight?",
          "back": "Its vertical velocity is zero, but its horizontal velocity is constant (neglecting air resistance)."
        },
        {
          "front": "For a projectile launched at an angle, what is the vertical acceleration?",
          "back": "Constant and equal to the gravitational acceleration ** - g ** (- 9.8m/s^2) throughout its flight."
        },
        {
          "front": "When are the horizontal and vertical components of a projectile's motion independent?",
          "back": "Always, assuming gravity is the only force acting vertically and there is no horizontal force."
        },
        {
          "front": "What is **relative velocity**?",
          "back": "The velocity of an object as observed from a particular reference frame."
        },
        {
          "front": "How is the velocity of a boat relative to the shore calculated if it is moving across a river with a current?",
          "back": "By vector addition of the boat's velocity relative to the water and the water's velocity relative to the shore ($$\\vec{v}_{BS} = \\vec{v}_{BW} + \\vec{v}_{WS}$$)."
        },
        {
          "front": "What is the **impulse-momentum theorem**?",
          "back": "The impulse applied to an object is equal to the change in its momentum ($$J = \\Delta p$$)."
        },
        {
          "front": "What is **impulse**?",
          "back": "The product of the average force applied to an object and the time interval over which the force is applied ($$J = F_{avg}\\Delta t$$)."
        },
        {
          "front": "When is **momentum conserved** in a collision?",
          "back": "When the net external force on the system is zero."
        },
        {
          "front": "What is an **elastic collision**?",
          "back": "A collision in which both momentum and kinetic energy are conserved."
        },
        {
          "front": "What is an **inelastic collision**?",
          "back": "A collision in which momentum is conserved, but kinetic energy is not."
        },
        {
          "front": "In a perfectly inelastic collision, what happens to the objects?",
          "back": "They stick together and move as a single unit after the collision."
        },
        {
          "front": "What is the **center of mass** of a system?",
          "back": "The average position of all the mass in a system. For a system of particles, it is the point where the entire mass can be considered to be concentrated."
        },
        {
          "front": "What happens to the velocity of the center of mass in a collision?",
          "back": "It remains constant, assuming no net external force acts on the system."
        },
        {
          "front": "How does friction affect the conservation of mechanical energy?",
          "back": "Friction is a non-conservative force that converts mechanical energy into thermal energy."
        },
        {
          "front": "What is a **non-conservative force**?",
          "back": "A force for which the work done in moving an object between two points depends on the path taken (e.g., friction, air resistance)."
        },
        {
          "front": "What is **power**?",
          "back": "The rate at which work is done or energy is transferred ($$P = \\frac{W}{\\Delta t}$$)."
        },
        {
          "front": "What is the relationship between power, force, and velocity?",
          "back": "The power can be calculated as the dot product of force and velocity ($$P = \\vec{F} \\cdot \\vec{v}$$)."
        },
        {
          "front": "What is a **fictitious force**?",
          "back": "An apparent force that arises in a non-inertial reference frame (e.g., centrifugal force)."
        },
        {
          "front": "What is the difference between centripetal force and centrifugal force?",
          "back": "Centripetal force is a real force that points inward, while centrifugal force is a fictitious force that appears to point outward in a rotating reference frame."
        },
        {
          "front": "What is the **normal force** on an object on an inclined plane?",
          "back": "The component of the gravitational force perpendicular to the surface."
        },
        {
          "front": "What is the formula for the component of gravity parallel to an inclined plane?",
          "back": "$$F_\\parallel = mg\\sin\\theta$$"
        },
        {
          "front": "What is the formula for the component of gravity perpendicular to an inclined plane?",
          "back": "$$F_\\perp = mg\\cos\\theta$$"
        },
        {
          "front": "What is **static friction**?",
          "back": "The force that prevents an object from starting to slide."
        },
        {
          "front": "What is **kinetic friction**?",
          "back": "The force that opposes the motion of a sliding object."
        },
        {
          "front": "Which is typically greater: static friction or kinetic friction?",
          "back": "Static friction."
        },
        {
          "front": "What is the net force on an object in **uniform circular motion**?",
          "back": "The centripetal force, which is directed towards the center."
        },
        {
          "front": "What is the work done by the centripetal force?",
          "back": "Zero, because the force is always perpendicular to the direction of motion."
        },
        {
          "front": "What is the **work-energy theorem**?",
          "back": "The net work done on an object equals the change in its kinetic energy ($$W_{net} = \\Delta K$$)."
        },
        {
          "front": "In what type of collision is momentum conserved in both the x and y directions?",
          "back": "Any 2-dimensional collision where there is no net external force."
        },
        {
          "front": "What is a **system** in physics?",
          "back": "A set of objects or particles chosen for analysis."
        },
        {
          "front": "How does the period of a pendulum's swing change if the length of the string is doubled?",
          "back": "The period increases by a factor of $$\\sqrt{2}$$, since $$T \\propto \\sqrt{L}$$."
        },
        {
          "front": "How does the maximum speed of a mass on a spring change if the amplitude is doubled?",
          "back": "The maximum speed doubles, as $$v_{max} \\propto A$$."
        },
        {
          "front": "What is the **coefficient of kinetic friction**?",
          "back": "A dimensionless constant that relates the force of kinetic friction to the normal force."
        },
        {
          "front": "What is **terminal velocity**?",
          "back": "The constant speed that a freely falling object eventually reaches when the resistance of the medium (e.g., air) prevents further acceleration."
        },
        {
          "front": "In a two-mass Atwood machine, what is the magnitude of the tension force?",
          "back": "The tension is less than the gravitational force of the heavier mass and greater than the gravitational force of the lighter mass."
        },
        {
          "front": "What is the **principle of superposition** for forces?",
          "back": "The net force on an object is the vector sum of all individual forces acting on it."
        },
        {
          "front": "How does a car turning a corner demonstrate a non-inertial reference frame?",
          "back": "In the car's frame of reference, you feel a 'centrifugal' force pushing you outward, which is not a real force."
        },
        {
          "front": "If an object is launched from a moving train, what is its velocity relative to the ground?",
          "back": "The vector sum of its velocity relative to the train and the train's velocity relative to the ground."
        },
        {
          "front": "When a system's momentum is conserved, what is the net external force on the system?",
          "back": "Zero."
        }
      ]
    }
  ]
}