{
  "flashcards": [
    {
      "category": "Magnetic Fields & Induction",
      "cards": [
        {
          "front": "What is the source of a **magnetic field**?",
          "back": "Moving electric charges (currents) or permanent magnets."
        },
        {
          "front": "What is a **magnetic field line**?",
          "back": "An imaginary line representing the direction of the magnetic field at any point, tangent to the field at that point."
        },
        {
          "front": "How do magnetic field lines behave around a magnet?",
          "back": "They emerge from the north pole and enter the south pole, forming closed loops."
        },
        {
          "front": "What is the formula for the **magnetic force** on a moving charge?",
          "back": "$$\\vec{F} = q(\\vec{v} \\times \\vec{B})$$, or for magnitude, $$F = |q|vB\\sin\\theta$$."
        },
        {
          "front": "How do you find the direction of the magnetic force on a positive charge using the **Right-Hand Rule**?",
          "back": "Point fingers in the direction of velocity ($$\\vec{v}$$), curl towards the magnetic field ($$\\vec{B}$$), and the thumb points in the direction of the force ($$\\vec{F}$$)."
        },
        {
          "front": "What is the formula for the magnetic force on a current-carrying wire?",
          "back": "$$\\vec{F} = I(\\vec{L} \\times \\vec{B})$$, or for magnitude, $$F = ILB\\sin\\theta$$."
        },
        {
          "front": "What is the unit of magnetic field strength?",
          "back": "The Tesla (T)."
        },
        {
          "front": "What is **magnetic flux** ($$\\Phi_B$$)?",
          "back": "The measure of the total number of magnetic field lines passing through a given area."
        },
        {
          "front": "What is the formula for magnetic flux?",
          "back": "$$\\Phi_B = BA\\cos\\theta$$"
        },
        {
          "front": "What is **Faraday's Law of Induction**?",
          "back": "The induced electromotive force ($$\\mathcal{E}$$) in a closed loop is equal to the negative of the time rate of change of the magnetic flux through the loop."
        },
        {
          "front": "What is the formula for Faraday's Law?",
          "back": "$$\\mathcal{E} = -N\\frac{\\Delta\\Phi_B}{\\Delta t}$$"
        },
        {
          "front": "What is **Lenz's Law**?",
          "back": "The direction of the induced current creates a magnetic field that opposes the change in magnetic flux that produced it."
        },
        {
          "front": "When a magnet is moved towards a coil, in what direction does the induced magnetic field point?",
          "back": "It points away from the magnet to repel its motion, in opposition to the change in flux."
        },
        {
          "front": "How does a simple electric **generator** work?",
          "back": "It converts mechanical energy into electrical energy by rotating a coil in a magnetic field, inducing a current."
        },
        {
          "front": "How does a simple electric **motor** work?",
          "back": "It converts electrical energy into mechanical energy by using the force on a current-carrying wire in a magnetic field to cause rotation."
        },
        {
          "front": "What is a **transformer**?",
          "back": "A device that uses induction to change AC voltage from one level to another."
        },
        {
          "front": "What is the **transformer equation**?",
          "back": "$$\\frac{V_s}{V_p} = \\frac{N_s}{N_p}$$"
        },
        {
          "front": "What is the purpose of a **step-up transformer**?",
          "back": "To increase voltage by having more turns on the secondary coil than on the primary coil ($$N_s > N_p$$)."
        },
        {
          "front": "What is the purpose of a **step-down transformer**?",
          "back": "To decrease voltage by having fewer turns on the secondary coil than on the primary coil ($$N_s < N_p$$)."
        },
        {
          "front": "What is the formula for the magnetic field at the center of a current loop?",
          "back": "$$B = \\frac{\\mu_0 I}{2R}$$"
        },
        {
          "front": "What is the formula for the magnetic field inside a long solenoid?",
          "back": "$$B = \\mu_0 nI$$ where $$n$$ is the number of turns per unit length."
        },
        {
          "front": "What is the permeability of free space ($$\\mu_0$$)?",
          "back": "$$4\\pi \\times 10^{-7} \\text{ T} \\cdot \\text{m/A}$$"
        },
        {
          "front": "What is the difference between a DC motor and an AC motor?",
          "back": "A DC motor requires a commutator to reverse current direction, while an AC motor's current naturally alternates."
        },
        {
          "front": "What happens to the magnetic force on a charged particle if it moves parallel to the magnetic field?",
          "back": "The force is zero, because the angle between velocity and the magnetic field is zero."
        },
        {
          "front": "What type of material is strongly attracted to a magnet?",
          "back": "**Ferromagnetic** materials, such as iron, nickel, and cobalt."
        },
        {
          "front": "What is a **paramagnetic** material?",
          "back": "A material that is weakly attracted to a magnetic field."
        },
        {
          "front": "What is a **diamagnetic** material?",
          "back": "A material that is weakly repelled by a magnetic field."
        },
        {
          "front": "What is an **electromagnet**?",
          "back": "A type of magnet in which the magnetic field is produced by an electric current."
        },
        {
          "front": "How can you increase the strength of an electromagnet?",
          "back": "By increasing the number of turns in the coil, increasing the current, or inserting an iron core."
        },
        {
          "front": "What is the force on a wire in a magnetic field if the wire is parallel to the field?",
          "back": "Zero."
        },
        {
          "front": "What is a **Hall effect**?",
          "back": "The production of a voltage difference across an electrical conductor that is transverse to an electric current and to an applied magnetic field."
        },
        {
          "front": "What is an **eddy current**?",
          "back": "A circular electrical current induced within conductors by a changing magnetic field."
        },
        {
          "front": "How does an induction stove work?",
          "back": "It uses an oscillating magnetic field to induce eddy currents in a metal pot, which then heats up due to the resistance of the metal."
        },
        {
          "front": "What is the purpose of a **transformer core**?",
          "back": "To concentrate the magnetic flux lines and improve the efficiency of the transformer."
        },
        {
          "front": "What happens to the magnetic flux through a coil if the coil is rotated from being perpendicular to a magnetic field to being parallel?",
          "back": "The flux decreases from a maximum value to zero."
        },
        {
          "front": "What is the direction of the magnetic field outside a long, straight current-carrying wire?",
          "back": "It forms concentric circles around the wire, determined by the Right-Hand Grip Rule."
        },
        {
          "front": "What is the **Right-Hand Grip Rule** for a straight wire?",
          "back": "Point the thumb of your right hand in the direction of the current, and your fingers curl in the direction of the magnetic field lines."
        },
        {
          "front": "In a transformer, what is the relationship between power in the primary and secondary coils (assuming 100% efficiency)?",
          "back": "$$P_p = P_s$$ or $$I_p V_p = I_s V_s$$."
        },
        {
          "front": "What is the phenomenon of **electromagnetic induction**?",
          "back": "The production of an electromotive force (EMF) across an electrical conductor by its motion in a magnetic field."
        },
        {
          "front": "What is the maximum force on a charged particle in a magnetic field?",
          "back": "The maximum force occurs when the velocity of the particle is perpendicular to the magnetic field ($$\\sin\\theta = 1$$)."
        }
      ]
    }
  ]
}
