{
  "flashcards": [
    {
      "category": "Oscillations & Resonance",
      "cards": [
        {
          "front": "What are the two conditions for an object to be in **Simple Harmonic Motion** (SHM)?",
          "back": "The restoring force must be directly proportional to the displacement from equilibrium, and the restoring force must act in the opposite direction of the displacement."
        },
        {
          "front": "What is the formula for the restoring force in a mass-spring system?",
          "back": "$$F = -kx$$ (Hooke's Law)"
        },
        {
          "front": "What is the **period** of an oscillation?",
          "back": "The time it takes for one complete cycle or oscillation."
        },
        {
          "front": "What is the **frequency** of an oscillation?",
          "back": "The number of cycles or oscillations that occur per unit of time."
        },
        {
          "front": "What is the relationship between period and frequency?",
          "back": "$$T = \\frac{1}{f}$$"
        },
        {
          "front": "What is the formula for the period of a mass-spring system?",
          "back": "$$T = 2\\pi\\sqrt{\\frac{m}{k}}$$"
        },
        {
          "front": "How does increasing the mass affect the period of a mass-spring system?",
          "back": "The period increases, as it is directly proportional to the square root of the mass."
        },
        {
          "front": "How does using a stiffer spring affect the period of a mass-spring system?",
          "back": "The period decreases, as it is inversely proportional to the square root of the spring constant ($$k$$)."
        },
        {
          "front": "What is the formula for the period of a simple pendulum?",
          "back": "$$T = 2\\pi\\sqrt{\\frac{L}{g}}$$"
        },
        {
          "front": "How does increasing the length of a pendulum affect its period?",
          "back": "The period increases, as it is directly proportional to the square root of the length."
        },
        {
          "front": "How does the mass of the bob affect the period of a simple pendulum?",
          "back": "It does not affect the period."
        },
        {
          "front": "In SHM, where is the object's **kinetic energy** at a maximum?",
          "back": "At the equilibrium position, where velocity is at a maximum."
        },
        {
          "front": "In SHM, where is the object's **potential energy** at a maximum?",
          "back": "At the points of maximum displacement (amplitude), where the restoring force is greatest."
        },
        {
          "front": "What is **damping** in an oscillation?",
          "back": "The dissipation of energy from an oscillating system due to forces like friction or air resistance, causing the amplitude to decrease over time."
        },
        {
          "front": "What is **underdamped oscillation**?",
          "back": "An oscillation that slowly decreases in amplitude but still completes several cycles."
        },
        {
          "front": "What is **overdamped oscillation**?",
          "back": "An oscillation that returns to equilibrium without oscillating at all, taking a long time to do so."
        },
        {
          "front": "What is **critical damping**?",
          "back": "The fastest return to equilibrium without any oscillation, an ideal state for many systems like car shocks and door closers."
        },
        {
          "front": "What is a **forced oscillation**?",
          "back": "An oscillation that is maintained by a periodic external force."
        },
        {
          "front": "What is **resonance**?",
          "back": "The large increase in amplitude that occurs when the frequency of a forced oscillation is equal to the system's natural frequency."
        },
        {
          "front": "Give a famous example of resonance causing a large-scale structural failure.",
          "back": "The collapse of the Tacoma Narrows Bridge in 1940."
        },
        {
          "front": "How do musical instruments use resonance?",
          "back": "They use resonance to amplify sound by forcing air inside a tube or a vibrating string to oscillate at its natural frequency."
        },
        {
          "front": "What is the **angular frequency** ($$\\omega$$) of an oscillation?",
          "back": "The rate of change of the angular position of a system in SHM. It is related to frequency by $$\\omega = 2\\pi f$$."
        },
        {
          "front": "What is the formula for maximum velocity in SHM?",
          "back": "$$v_{max} = A\\omega$$ where $$A$$ is amplitude."
        },
        {
          "front": "What is the total energy of an undamped mass-spring system?",
          "back": "The sum of its kinetic and potential energy, which remains constant ($$E = \\frac{1}{2}mv^2 + \\frac{1}{2}kx^2 = \\frac{1}{2}kA^2$$)."
        },
        {
          "front": "What is a **transverse wave**?",
          "back": "A wave in which the particles of the medium oscillate perpendicular to the direction of wave propagation (e.g., a wave on a string)."
        },
        {
          "front": "What is a **longitudinal wave**?",
          "back": "A wave in which the particles of the medium oscillate parallel to the direction of wave propagation (e.g., sound waves)."
        },
        {
          "front": "What is a **standing wave**?",
          "back": "A wave pattern that remains in a constant position, formed by the superposition of two waves traveling in opposite directions."
        },
        {
          "front": "What is the difference between a wave and an oscillation?",
          "back": "An oscillation is a single point moving back and forth, while a wave is a disturbance that transfers energy through a medium."
        },
        {
          "front": "What is a **node** in a standing wave?",
          "back": "A point that remains at rest and has zero amplitude."
        },
        {
          "front": "What is an **antinode** in a standing wave?",
          "back": "A point of maximum amplitude."
        },
        {
          "front": "What happens to the period of a pendulum if it is taken to the Moon?",
          "back": "The period increases because the acceleration due to gravity ($$g$$) is lower on the Moon."
        },
        {
          "front": "What is the **amplitude** of an oscillation?",
          "back": "The maximum displacement or distance moved by a point on a vibrating body or wave, measured from its equilibrium position."
        },
        {
          "front": "In a mass-spring system, what happens to the period if the spring is stretched further before release?",
          "back": "The period remains the same, as the period is independent of amplitude."
        },
        {
          "front": "What is **wave interference**?",
          "back": "The phenomenon that occurs when two or more waves overlap and combine to form a new wave."
        },
        {
          "front": "What is **constructive interference**?",
          "back": "When two waves combine to produce a wave with a larger amplitude."
        },
        {
          "front": "What is **destructive interference**?",
          "back": "When two waves combine to produce a wave with a smaller or zero amplitude."
        },
        {
          "front": "What is a **natural frequency**?",
          "back": "The frequency at which a system oscillates when disturbed from its equilibrium position."
        },
        {
          "front": "What is the relationship between the natural frequency of a system and resonance?",
          "back": "Resonance occurs when the driving frequency matches the natural frequency."
        },
        {
          "front": "How does the total energy of a damped oscillator change?",
          "back": "It decreases over time as energy is dissipated into the environment."
        },
        {
          "front": "What is the speed of a wave?",
          "back": "The product of its frequency and wavelength ($$v = f\\lambda$$)."
        }
      ]
    }
  ]
}
