{
  "flashcards": [
    {
      "category": "Quantum Physics",
      "cards": [
        {
          "front": "What is a **quantum**?",
          "back": "The minimum amount of any physical entity involved in an interaction. It's the smallest indivisible unit of energy."
        },
        {
          "front": "What is **Planck's Hypothesis**?",
          "back": "Energy is not continuous but is emitted or absorbed in discrete packets called quanta."
        },
        {
          "front": "What is the formula for the energy of a photon?",
          "back": "$$E = hf$$ (where h is Planck's constant and f is the frequency."
        },
        {
          "front": "What is the value of **Planck's constant** ($$h$$)?",
          "back": "$$6.626 \\times 10^{-34} \\text{ J} \\cdot \\text{s}$$"
        },
        {
          "front": "What is the **photoelectric effect**?",
          "back": "The emission of electrons from a material when light shines on it."
        },
        {
          "front": "What is the key experimental observation that the photoelectric effect posed for classical physics?",
          "back": "Electrons are only emitted when the light's frequency is above a certain threshold, regardless of intensity."
        },
        {
          "front": "What is the **work function** ($$\\phi$$)?",
          "back": "The minimum energy required to remove an electron from the surface of a material."
        },
        {
          "front": "What is the formula for the maximum kinetic energy of an emitted photoelectron?",
          "back": "$$K_{max} = hf - \\phi$$"
        },
        {
          "front": "What is a **photon**?",
          "back": "A quantum of light, or the basic particle of all electromagnetic radiation."
        },
        {
          "front": "What is **wave-particle duality**?",
          "back": "The concept that every particle or quantum entity may be described as either a particle or a wave."
        },
        {
          "front": "What is the **de Broglie wavelength**?",
          "back": "The wavelength associated with a moving particle, showing its wave-like properties."
        },
        {
          "front": "What is the formula for the de Broglie wavelength?",
          "back": "$$\\lambda = \\frac{h}{p}$$ where $$p$$ is momentum."
        },
        {
          "front": "What did the **double-slit experiment** demonstrate about electrons?",
          "back": "That electrons, like light waves, can exhibit an interference pattern, demonstrating their wave-like nature."
        },
        {
          "front": "What is the **Heisenberg Uncertainty Principle**?",
          "back": "It is impossible to know both the exact position and the exact momentum of a particle at the same time."
        },
        {
          "front": "What is the formula for the position-momentum uncertainty principle?",
          "back": "$$\\Delta x \\Delta p_x \\ge \\frac{\\hbar}{2}$$"
        },
        {
          "front": "What is the **Bohr Model** of the atom?",
          "back": "A model that proposed that electrons orbit the nucleus in specific, quantized energy levels."
        },
        {
          "front": "What is an **electron shell**?",
          "back": "A principal energy level that electrons occupy in the Bohr model."
        },
        {
          "front": "What happens when an electron transitions from a higher to a lower energy level?",
          "back": "It emits a photon with energy equal to the energy difference between the levels ($$\\Delta E = hf$$)."
        },
        {
          "front": "What is the **quantum mechanical model** of the atom?",
          "back": "A model that describes electrons as occupying probable regions of space (orbitals) rather than fixed orbits."
        },
        {
          "front": "What is a **wave function** ($$\\psi$$)?",
          "back": "A mathematical function that describes the quantum state of a particle."
        },
        {
          "front": "What does the square of the wave function ($$|\\psi|^2$$) represent?",
          "back": "The probability density of finding the particle at a particular location."
        },
        {
          "front": "What is **quantum tunneling**?",
          "back": "A quantum mechanical phenomenon where a particle can pass through a potential energy barrier even if it does not have enough energy to do so classically."
        },
        {
          "front": "What is the **Pauli Exclusion Principle**?",
          "back": "No two electrons in the same atom can have the same four quantum numbers."
        },
        {
          "front": "What are the four **quantum numbers**?",
          "back": "Principal ($$n$$), Azimuthal ($$l$$), Magnetic ($$m_l$$), and Spin ($$m_s$$)."
        },
        {
          "front": "What is a **blackbody**?",
          "back": "An idealized object that absorbs all incident electromagnetic radiation, regardless of frequency or angle of incidence."
        },
        {
          "front": "What was the **ultraviolet catastrophe**?",
          "back": "A prediction of classical physics that a blackbody would radiate an infinite amount of energy at high frequencies, which was not observed experimentally."
        },
        {
          "front": "How did Max Planck solve the ultraviolet catastrophe?",
          "back": "By proposing that energy is quantized, meaning it can only be radiated in discrete units."
        },
        {
          "front": "What is a **quantum leap**?",
          "back": "The instantaneous transition of an electron from one energy level to another, absorbing or emitting a photon."
        },
        {
          "front": "What is the unit of work function and kinetic energy in the photoelectric effect?",
          "back": "Joules (J), but it is often expressed in electron-volts (eV)."
        },
        {
          "front": "What is the **Compton effect**?",
          "back": "The scattering of a photon by a charged particle, resulting in a decrease in photon energy and an increase in its wavelength."
        },
        {
          "front": "What is the difference between a classical particle and a quantum particle?",
          "back": "A classical particle has a definite position and momentum, while a quantum particle's properties are described by probabilities."
        },
        {
          "front": "What is the role of a potential energy barrier in quantum mechanics?",
          "back": "It is a region of space that a particle must pass through, and quantum tunneling allows it to pass through it even if its energy is insufficient."
        },
        {
          "front": "What is **Schrödinger's cat**?",
          "back": "A thought experiment illustrating the paradox of quantum superposition, where a cat is simultaneously both alive and dead."
        },
        {
          "front": "What is the **ground state** of an atom?",
          "back": "The lowest possible energy state of an electron in an atom."
        },
        {
          "front": "What is an **excited state**?",
          "back": "Any energy state higher than the ground state."
        },
        {
          "front": "What determines the color of light emitted by an atom?",
          "back": "The specific energy difference between the electron's initial and final energy levels, which corresponds to the energy of the emitted photon."
        },
        {
          "front": "Why is the Bohr Model considered a simplified model today?",
          "back": "It fails to account for the wave nature of the electron and doesn't explain the fine details of atomic spectra."
        },
        {
          "front": "What is the **stopping potential** in the photoelectric effect?",
          "back": "The minimum reverse voltage required to stop the most energetic photoelectrons from reaching the collector electrode."
        },
        {
          "front": "What is the significance of the wave-particle duality for everyday objects?",
          "back": "The de Broglie wavelength for macroscopic objects is so infinitesimally small that their wave-like properties are undetectable."
        },
        {
          "front": "What is the relationship between the momentum of a photon and its wavelength?",
          "back": "$$p = \\frac{h}{\\lambda}$$"
        }
      ]
    }
  ]
}
