{
  "flashcards": [
    {
      "category": "Relativity (Intro)",
      "cards": [
        {
          "front": "What is the **Principle of Relativity** (Galilean version)?",
          "back": "The laws of motion are the same in all inertial frames of reference."
        },
        {
          "front": "What is an **inertial reference frame**?",
          "back": "A frame of reference that is not accelerating."
        },
        {
          "front": "What is the first postulate of **Special Relativity**?",
          "back": "The laws of physics are the same for all observers in all inertial frames of reference."
        },
        {
          "front": "What is the second postulate of **Special Relativity**?",
          "back": "The speed of light in a vacuum ($$c$$) is the same for all inertial observers, regardless of the motion of the light source."
        },
        {
          "front": "What is the speed of light in a vacuum?",
          "back": "$$c \\approx 3.00 \\times 10^8 \\text{ m/s}$$"
        },
        {
          "front": "What is **time dilation**?",
          "back": "The phenomenon where time appears to slow down for an object moving at a high speed relative to an observer."
        },
        {
          "front": "What is the formula for time dilation?",
          "back": "$$t' = \\frac{t}{\\sqrt{1 - \\frac{v^2}{c^2}}} = \\gamma t$$"
        },
        {
          "front": "What is the **Lorentz factor** ($$\\gamma$$)?",
          "back": "$$\\gamma = \\frac{1}{\\sqrt{1 - \\frac{v^2}{c^2}}}$$"
        },
        {
          "front": "When is the Lorentz factor significant?",
          "back": "When the speed of an object ($$v$$) is a significant fraction of the speed of light ($$c$$)."
        },
        {
          "front": "What is **length contraction**?",
          "back": "The phenomenon where the length of a moving object appears to shrink in the direction of its motion, as observed from an inertial frame."
        },
        {
          "front": "What is the formula for length contraction?",
          "back": "$$L' = L\\sqrt{1 - \\frac{v^2}{c^2}} = \\frac{L}{\\gamma}$$"
        },
        {
          "front": "Does length contraction occur perpendicular to the direction of motion?",
          "back": "No, it only occurs in the direction of motion."
        },
        {
          "front": "What is **rest energy**?",
          "back": "The energy an object has just by virtue of its mass, according to $$E = mc^2$$."
        },
        {
          "front": "What is the formula for mass-energy equivalence?",
          "back": "$$E = mc^2$$"
        },
        {
          "front": "What is **relativistic momentum**?",
          "back": "The momentum of an object taking into account the effects of special relativity."
        },
        {
          "front": "What is the formula for relativistic momentum?",
          "back": "$$p = \\gamma mv$$"
        },
        {
          "front": "What is a **spacetime diagram**?",
          "back": "A diagram that plots an object's position on one axis and its time on another, showing its trajectory through spacetime."
        },
        {
          "front": "What is a **world line**?",
          "back": "The path of an object in a spacetime diagram."
        },
        {
          "front": "What is a **light cone**?",
          "back": "A cone-shaped region on a spacetime diagram that represents all possible future and past positions of a particle that can travel at or below the speed of light."
        },
        {
          "front": "What is the **twin paradox**?",
          "back": "A thought experiment where one twin travels at near the speed of light and returns to find their stay-at-home twin has aged more."
        },
        {
          "front": "What is the resolution to the twin paradox?",
          "back": "The traveling twin is not in an inertial frame (they accelerate and decelerate), so the two twins' experiences are not symmetrical."
        },
        {
          "front": "What is the **Principle of Equivalence** (General Relativity)?",
          "back": "The effects of gravity are indistinguishable from the effects of uniform acceleration."
        },
        {
          "front": "How does **General Relativity** explain gravity?",
          "back": "Gravity is not a force but a manifestation of the curvature of spacetime caused by mass and energy."
        },
        {
          "front": "What is the phenomenon of **gravitational lensing**?",
          "back": "The bending of light from a distant source as it passes a massive object, acting like a lens."
        },
        {
          "front": "How does mass affect time?",
          "back": "Time appears to slow down in a stronger gravitational field, a phenomenon called **gravitational time dilation**."
        },
        {
          "front": "Where is gravitational time dilation most pronounced?",
          "back": "Near very massive objects, like black holes."
        },
        {
          "front": "What is a **black hole**?",
          "back": "A region of spacetime where gravity is so strong that nothing—not even light—can escape."
        },
        {
          "front": "What is the **event horizon** of a black hole?",
          "back": "The boundary beyond which events cannot affect an outside observer."
        },
        {
          "front": "What does the **escape velocity** of an object need to be to become a black hole?",
          "back": "The escape velocity must be equal to or greater than the speed of light."
        },
        {
          "front": "What is a **geodesic**?",
          "back": "The shortest path between two points in curved spacetime, which is what objects follow under the influence of gravity."
        },
        {
          "front": "What is the difference between an inertial frame and a non-inertial frame?",
          "back": "An inertial frame is not accelerating, while a non-inertial frame is accelerating and requires fictitious forces to explain motion."
        },
        {
          "front": "According to Special Relativity, is mass a conserved quantity?",
          "back": "No, mass is a form of energy and can be created or destroyed, but mass-energy ($$E=mc^2$$) is conserved."
        },
        {
          "front": "What happens to the kinetic energy of a particle as it approaches the speed of light?",
          "back": "Its kinetic energy approaches infinity."
        },
        {
          "front": "Can a massive object ever reach the speed of light?",
          "back": "No, because its relativistic mass and kinetic energy would become infinite, requiring an infinite amount of energy to accelerate."
        },
        {
          "front": "What is the formula for the total energy of a particle?",
          "back": "$$E^2 = (pc)^2 + (m_0c^2)^2$$"
        },
        {
          "front": "What is the **rest mass** ($$m_0$$)?",
          "back": "The mass of an object when it is at rest relative to an observer."
        },
        {
          "front": "What is a **gravitational redshift**?",
          "back": "The increase in the wavelength of light as it moves away from a gravitational source."
        },
        {
          "front": "What is a **singularit**y in a black hole?",
          "back": "A point of infinite density at the center of a black hole where the laws of physics as we know them break down."
        },
        {
          "front": "What is **spacetime**?",
          "back": "A four-dimensional continuum combining the three dimensions of space and one dimension of time."
        },
        {
          "front": "How does the clock on a GPS satellite behave relative to a clock on Earth?",
          "back": "It runs slightly faster due to being in a weaker gravitational field, an effect corrected by special and general relativity."
        }
      ]
    }
  ]
}
