{
  "topic": "10.9 Review Questions",
  "expanded_description": "This section provides comprehensive practice problems covering the entire electricity unit. Questions test conceptual understanding, mathematical application, and the ability to connect principles across different topics, from static electricity and Coulomb's Law to circuit analysis with Ohm's Law and power calculations.",
  "core_concept": {
    "principle": "Effective review integrates conceptual understanding of electrical phenomena, mathematical problem-solving with electrical equations, and practical application of principles to analyze both electrostatic interactions and current-carrying circuits.",
    "explanation": "Mastering this unit requires connecting microscopic charge interactions to macroscopic circuit behavior, applying mathematical relationships from Coulomb's Law to Ohm's Law, and understanding how energy transforms in electrical systems from electrostatic potential to useful work."
  },
  "sections": [
    {
      "section_title": "Static Electricity and Charge Interactions",
      "introduction": "These questions test fundamental understanding of electric charge, charging methods, and electrostatic forces.",
      "key_concept": {
        "definition": "**Core Concepts:**\n- Charge types and conservation\n- Charging methods: friction, conduction, induction\n- Coulomb's Law: F = k|q₁q₂|/r²\n- Conductors vs insulators\n- Electric fields and field lines",
        "context": "Understanding electrostatic principles provides the foundation for all electrical phenomena, from atomic interactions to circuit behavior."
      },
      "examples": [
        {
          "process": "**Conceptual Questions:**\n1. Explain why a charged balloon sticks to a neutral wall. Include the roles of polarization and induced charges in your explanation.\n2. Compare and contrast charging by conduction versus charging by induction. What fundamental principle is demonstrated by both methods?\n3. Why do you often get a static shock when touching a metal doorknob after walking on carpet, but not when touching a wooden door?",
          "explanation": "Tests understanding of charging mechanisms, polarization, and material properties in electrostatic phenomena."
        },
        {
          "process": "**Mathematical Problems:**\n1. Two point charges of +3 μC and -5 μC are separated by 0.2 m. Calculate the magnitude and direction of the force on each charge.\n2. Three charges form an equilateral triangle with 0.1 m sides: q₁ = +2 μC, q₂ = +2 μC, q₃ = -4 μC. Calculate the net force on q₁.\n3. If the force between two identical charges is 0.36 N when they are 0.3 m apart, what is the magnitude of each charge?",
          "explanation": "Applies Coulomb's Law to various charge configurations, including vector addition for multiple charges."
        }
      ]
    },
    {
      "section_title": "Circuit Fundamentals and Ohm's Law",
      "key_concept": {
        "definition": "**Fundamental Relationships:**\n- Ohm's Law: V = IR\n- Electrical power: P = IV = I²R = V²/R\n- Energy: E = Pt = IVt\n- Resistance: R = ρL/A",
        "context": "Ohm's Law provides the mathematical foundation for analyzing current-carrying circuits and understanding energy transformations in electrical systems."
      },
      "examples": [
        {
          "process": "**Basic Circuit Analysis:**\n1. A 120 V circuit has a current of 2.5 A. What is the resistance of the load and how much power is it consuming?\n2. A 100 Ω resistor dissipates 400 W. What current flows through it and what voltage is across it?\n3. Calculate the resistance of a copper wire that is 50 m long with a cross-sectional area of 2.5 mm². (ρ_copper = 1.68 × 10⁻⁸ Ω·m)",
          "explanation": "Tests application of Ohm's Law, power formulas, and resistance calculations with realistic values."
        },
        {
          "process": "**Energy and Cost Calculations:**\n1. A 1500 W space heater is used for 6 hours daily. If electricity costs $0.15 per kWh, what is the monthly (30-day) cost?\n2. An LED bulb (12 W) replaces an incandescent bulb (60 W). If used 5 hours daily, how much money is saved annually at $0.12/kWh?\n3. A car battery provides 45 A at 12 V for 3 minutes to start an engine. How much energy is delivered?",
          "explanation": "Applies energy and power relationships to practical cost-saving and energy consumption scenarios."
        }
      ]
    },
    {
      "section_title": "Series and Parallel Circuit Analysis",
      "classifications": [
        {
          "type": "Circuit Configuration Problems",
          "value": "Analyzing circuits with multiple components in different configurations",
          "characteristics": ["Equivalent resistance", "Current distribution", "Voltage division", "Power calculations"],
          "behavior": "Successful circuit analysis requires recognizing series and parallel configurations and applying the appropriate mathematical relationships for each.",
          "examples": [
            {
              "process": "**Series Circuit Problems:**\n1. Three resistors (22 Ω, 47 Ω, 100 Ω) are connected in series to a 24 V source. Calculate:\n   a) Total resistance\n   b) Circuit current\n   c) Voltage across each resistor\n   d) Power dissipated by each resistor\n\n2. A string of 20 identical Christmas lights (series) operates at 120 V. If each bulb has 12 Ω resistance when lit, what current flows and what happens if one bulb burns out?",
              "explanation": "Tests comprehensive analysis of series circuits including resistance, current, voltage, and power calculations."
            },
            {
              "process": "**Parallel Circuit Problems:**\n1. Three resistors (100 Ω, 200 Ω, 300 Ω) are connected in parallel to a 60 V source. Calculate:\n   a) Equivalent resistance\n   b) Total current\n   c) Current through each branch\n   d) Power in each resistor\n\n2. A household circuit (120 V, 15 A breaker) has these devices operating simultaneously:\n   - Lamp: 100 W\n   - TV: 150 W\n   - Computer: 300 W\n   Will the breaker trip? What's the maximum additional power that can be safely added?",
              "explanation": "Challenges students with parallel circuit analysis and practical circuit capacity calculations."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Mixed Circuit Configurations",
      "classifications": [
        {
          "type": "Complex Circuit Analysis",
          "value": "Solving problems with combined series and parallel elements",
          "characteristics": ["Stepwise simplification", "Current paths", "Voltage drops", "Power distribution"],
          "behavior": "Real circuits often contain both series and parallel elements, requiring systematic approaches to reduce complex networks to equivalent circuits.",
          "examples": [
            {
              "process": "**Combination Circuit Problems:**\n1. For the circuit: R₁ = 10 Ω (series), then R₂ = 20 Ω || R₃ = 30 Ω (parallel), with 12 V source:\n   a) Find equivalent resistance\n   b) Calculate total current\n   c) Find voltage across the parallel combination\n   d) Determine current through each resistor\n\n2. Design a voltage divider using two resistors that provides exactly 1/3 of the source voltage across one resistor. If the total resistance should be 1200 Ω, what values should the resistors have?",
              "explanation": "Tests ability to analyze combination circuits and design simple networks for specific functions."
            },
            {
              "process": "**Practical Design Problems:**\n1. Design a circuit with three LEDs (each requires 2 V, 20 mA) powered by a 9 V battery. Calculate the required series resistance and its power rating.\n\n2. A security system needs to monitor three doors with magnetic switches (normally closed). Design a circuit that will indicate if ANY door opens. What type of circuit configuration is this?",
              "explanation": "Applies circuit principles to practical design scenarios requiring component selection and configuration understanding."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Experimental and Measurement Scenarios",
      "classifications": [
        {
          "type": "Laboratory Applications",
          "value": "Applying concepts to experimental setups and data interpretation",
          "characteristics": ["Circuit construction", "Measurement techniques", "Data analysis", "Error identification"],
          "behavior": "Experimental work reinforces theoretical understanding and develops skills in measurement, data analysis, and troubleshooting.",
          "examples": [
            {
              "process": "**Experimental Design:**\n1. Design an experiment to verify Ohm's Law using a resistor, power supply, and multimeters. What measurements would you take and how would you analyze the data?\n\n2. Describe how you would use a multimeter to troubleshoot a circuit where one lamp in a parallel string doesn't light, but the others do. What measurements would you take and what would they tell you?",
              "explanation": "Tests understanding of experimental methods and troubleshooting procedures for electrical circuits."
            },
            {
              "process": "**Data Analysis:**\nA student collects the following data for an unknown device:\nVoltage (V) | Current (A)\n2.0 | 0.10\n4.0 | 0.40\n6.0 | 0.90\n8.0 | 1.60\n\nAnalyze this data to:\na) Determine if the device is ohmic\nb) Calculate its resistance at each voltage\nc) Explain the physical reason for the observed behavior\nd) Calculate power at 8.0 V",
              "explanation": "Assesses ability to interpret experimental data and identify non-ohmic behavior."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Comparative Analysis and Critical Thinking",
      "classifications": [
        {
          "type": "Synthesis Questions",
          "value": "Comparing different concepts and applying principles to novel situations",
          "characteristics": ["Concept comparison", "Scenario analysis", "Design optimization", "Problem diagnosis"],
          "behavior": "These questions require students to connect concepts from different sections and apply them to analyze complex scenarios and make design decisions.",
          "examples": [
            {
              "process": "**Concept Comparison:**\n1. Compare series and parallel circuits in terms of:\n   - Current behavior\n   - Voltage distribution\n   - Effect of adding more loads\n   - Failure modes\n   - Practical applications\n\n2. Explain why high voltage is used for long-distance power transmission, using both power formulas and practical considerations in your answer.",
              "explanation": "Tests comprehensive understanding of key differences between circuit types and practical engineering considerations."
            },
            {
              "process": "**Troubleshooting Scenarios:**\n1. In a house circuit, several outlets in one room stop working simultaneously, but outlets in other rooms are fine. Using circuit principles, diagnose the most likely problem and explain your reasoning.\n\n2. A student builds a series circuit with three different resistors, but measures different currents at different points. Identify the error in measurement technique and explain what the current should actually be.",
              "explanation": "Challenges students to apply circuit principles to diagnose real-world problems and identify measurement errors."
            }
          ]
        }
      ]
    },
    {
      "section_title": "Integrated Problem Solving",
      "classifications": [
        {
          "type": "Complex Scenario Analysis",
          "value": "Multi-step problems requiring synthesis of multiple concepts",
          "characteristics": ["Real-world context", "Multiple concepts integration", "Quantitative reasoning", "Qualitative explanation"],
          "behavior": "These challenging problems require students to connect concepts from different sections and apply them to novel situations with practical significance.",
          "examples": [
            {
              "process": "**Comprehensive Scenarios:**\n1. **The Home Lighting Project:**\n   A room has three 100 W incandescent bulbs (120 V) that are always used together.\n   a) Calculate the current drawn when all are on\n   b) If replaced with 15 W LED bulbs providing equivalent light, calculate the new current\n   c) Calculate annual energy savings if used 6 hours daily at $0.14/kWh\n   d) Should these bulbs be connected in series or parallel? Justify your answer.\n\n2. **The Car Electrical System:**\n   A car has these devices operating with the engine off (12 V battery):\n   - Headlights: 120 W total\n   - Radio: 30 W\n   - Heater fan: 90 W\n   The battery capacity is 60 Ah (ampere-hours).\n   a) Calculate total current drawn\n   b) How long until the battery is 50% discharged?\n   c) What happens if you try to add a 500 W device?",
              "explanation": "Presents realistic scenarios requiring application of power calculations, circuit analysis, and practical limitations."
            },
            {
              "process": "**Design Challenges:**\n1. Design a circuit for a school science fair that demonstrates both series and parallel connections using three identical lamps. The circuit should:\n   - Show current is same in series\n   - Show voltage is same in parallel\n   - Allow individual lamp control\n   - Include switches for demonstration\n   Draw the circuit diagram and explain how it demonstrates each principle.\n\n2. Propose a method to experimentally determine if an unknown component is ohmic or non-ohmic. What equipment would you need, what measurements would you take, and how would you interpret the results?",
              "explanation": "Challenges students to design circuits and experiments that demonstrate key electrical principles."
            }
          ]
        }
      ]
    }
  ],
  "key_terms": [
    "Electric Charge",
    "Coulomb's Law",
    "Electrostatic Force",
    "Charging Methods",
    "Conductor",
    "Insulator",
    "Ohm's Law",
    "Voltage",
    "Current",
    "Resistance",
    "Electrical Power",
    "Series Circuit",
    "Parallel Circuit",
    "Equivalent Resistance",
    "Kirchhoff's Laws",
    "Voltage Divider",
    "Current Divider",
    "Power Dissipation",
    "Energy Consumption",
    "Circuit Analysis"
  ],
  "summary": "This comprehensive review covers the complete electricity unit, testing understanding from fundamental electrostatic principles to complex circuit analysis. Questions range from conceptual explanations of charge interactions and charging methods to mathematical applications of Coulomb's Law for multiple charge systems. Circuit analysis problems include calculating equivalent resistance, current distribution, voltage division, and power dissipation in series, parallel, and combination circuits. Practical applications test energy cost calculations, circuit design, and troubleshooting skills. Experimental questions assess understanding of measurement techniques and data interpretation. Comparative analysis challenges students to explain key differences between series and parallel configurations and justify engineering choices like high-voltage transmission. Integrated scenarios require synthesizing multiple concepts to solve real-world problems involving energy efficiency, circuit design, and system limitations. Mastery of these questions demonstrates the ability to both calculate precise electrical quantities and explain the physical principles governing diverse electrical phenomena in theoretical and practical contexts."
}

