{
  "flashcards": [
    {
      "category": "Biotechnology",
      "cards": [
        {
          "front": "What is **genetic engineering**?",
          "back": "The direct manipulation of genes for practical purposes."
        },
        {
          "front": "What is **recombinant DNA**?",
          "back": "A DNA molecule formed by combining genetic material from two different sources."
        },
        {
          "front": "What is a **plasmid**?",
          "back": "A small, circular DNA molecule in bacteria, often used as a vector for genetic engineering."
        },
        {
          "front": "What is the function of **restriction enzymes**?",
          "back": "To cut DNA molecules at specific, short nucleotide sequences, creating 'sticky ends'."
        },
        {
          "front": "What is the function of **DNA ligase**?",
          "back": "To join DNA fragments together by forming new phosphodiester bonds."
        },
        {
          "front": "What is **gel electrophoresis**?",
          "back": "A technique used to separate DNA fragments by size by pushing them through a gel matrix with an electric current."
        },
        {
          "front": "Why does DNA move toward the positive electrode in gel electrophoresis?",
          "back": "The phosphate groups in the DNA backbone give the molecule a negative charge, so it is attracted to the positive electrode."
        },
        {
          "front": "What is **PCR**?",
          "back": "Polymerase Chain Reaction, a technique used to amplify a specific segment of DNA to produce millions of copies."
        },
        {
          "front": "What are the three main steps of a single PCR cycle?",
          "back": "Denaturation, annealing, and extension."
        },
        {
          "front": "What is the purpose of **denaturation** in PCR?",
          "back": "To heat the DNA sample to a high temperature to separate the double-stranded DNA into single strands."
        },
        {
          "front": "What is the purpose of **annealing** in PCR?",
          "back": "To cool the sample to allow primers to bind to their complementary sequences on the single DNA strands."
        },
        {
          "front": "What is the purpose of **extension** in PCR?",
          "back": "To allow a heat-stable DNA polymerase (like Taq polymerase) to synthesize new DNA strands."
        },
        {
          "front": "What is the function of **Taq polymerase**?",
          "back": "A heat-stable DNA polymerase used in PCR that can withstand the high temperatures required for denaturation."
        },
        {
          "front": "What does **CRISPR-Cas9** stand for?",
          "back": "Clustered Regularly Interspaced Short Palindromic Repeats and CRISPR-associated protein 9."
        },
        {
          "front": "What is the role of the **Cas9** protein in the CRISPR system?",
          "back": "It is a nuclease that acts as a pair of molecular scissors to precisely cut DNA at a specific location."
        },
        {
          "front": "What is the role of the **guide RNA** in the CRISPR system?",
          "back": "It is a short RNA molecule that guides the Cas9 protein to the target DNA sequence to be cut."
        },
        {
          "front": "What is **gene therapy**?",
          "back": "The process of introducing a new, healthy gene into an individual's cells to treat a genetic disorder."
        },
        {
          "front": "What are **transgenic organisms**?",
          "back": "Organisms that have had foreign DNA (a gene from another species) introduced into their genome."
        },
        {
          "front": "What are some common applications of biotechnology in agriculture?",
          "back": "Creating crops with increased nutritional value, resistance to pests or herbicides, or a longer shelf life."
        },
        {
          "front": "What is a key ethical concern regarding human germline editing?",
          "back": "The changes would be heritable and passed down to future generations, with unknown long-term consequences."
        },
        {
          "front": "How is gel electrophoresis used in forensics?",
          "back": "To create a 'DNA fingerprint' by comparing the unique band patterns of different DNA samples."
        },
        {
          "front": "What is **gene cloning**?",
          "back": "The production of multiple, identical copies of a single gene."
        },
        {
          "front": "What is the main purpose of a **DNA vector** in genetic engineering?",
          "back": "To carry a foreign gene into a host cell for cloning or expression."
        },
        {
          "front": "What is a **DNA library**?",
          "back": "A collection of an organism's DNA fragments stored and replicated in vectors."
        },
        {
          "front": "What are **sticky ends**?",
          "back": "The single-stranded overhangs created when DNA is cut by restriction enzymes; they allow for the joining of DNA fragments."
        },
        {
          "front": "What is **gene editing**?",
          "back": "A type of genetic engineering in which DNA is inserted, deleted, or replaced at a specific location in the genome."
        },
        {
          "front": "What is the difference between somatic gene therapy and germline gene therapy?",
          "back": "Somatic therapy affects only body cells and is not heritable; germline therapy affects reproductive cells and is heritable."
        },
        {
          "front": "Why is CRISPR considered a more efficient and precise gene editing tool than older methods?",
          "back": "It can be programmed to target a specific DNA sequence with high accuracy, whereas older methods were less specific."
        },
        {
          "front": "What is a common ethical concern about genetically modified organisms (GMOs)?",
          "back": "They may lead to a decrease in biodiversity or have unforeseen impacts on the ecosystem."
        },
        {
          "front": "What is **bioinformatics**?",
          "back": "The use of computational tools to analyze and interpret large biological data sets, such as DNA sequences."
        },
        {
          "front": "What is the purpose of a **DNA probe**?",
          "back": "A labeled molecule (often radioactive or fluorescent) used to find a specific nucleotide sequence."
        },
        {
          "front": "What is **transformation** in genetic engineering?",
          "back": "The uptake of foreign DNA from the surrounding environment by a cell."
        },
        {
          "front": "What is the role of a **reporter gene** in genetic engineering?",
          "back": "A gene that is attached to a gene of interest and is used to determine if the host cell has successfully taken up the foreign DNA (e.g., an antibiotic resistance gene)."
        },
        {
          "front": "What is **cloning**?",
          "back": "The production of a genetically identical individual from a single somatic cell of an organism."
        },
        {
          "front": "What is a key ethical consideration in human reproductive cloning?",
          "back": "The potential for human rights violations, psychological harm to the clone, and a lack of genetic diversity."
        },
        {
          "front": "What is **DNA sequencing**?",
          "back": "The process of determining the precise order of nucleotides within a DNA molecule."
        },
        {
          "front": "How does PCR differ from natural DNA replication?",
          "back": "PCR is done in vitro (in a lab) and uses cycles of heating and cooling, while natural replication occurs in a living cell and requires many more enzymes."
        },
        {
          "front": "How does gel electrophoresis relate to DNA fingerprinting?",
          "back": "Gel electrophoresis separates DNA fragments by size, and the resulting banding pattern is a unique DNA fingerprint for an individual."
        },
        {
          "front": "What is a **DNA fingerprint**?",
          "back": "An individual's unique banding pattern of DNA fragments, often used in forensics and paternity testing."
        },
        {
          "front": "What is a **GMO**?",
          "back": "A genetically modified organism, one whose genetic material has been altered using genetic engineering techniques."
        }
      ]
    }
  ]
}
