{
  "flashcards": [
    {
      "category": "Cell Structure & Function",
      "cards": [
        {
          "front": "What is the key difference between prokaryotic and eukaryotic cells?",
          "back": "Eukaryotic cells have a membrane-bound nucleus and organelles, while prokaryotic cells do not."
        },
        {
          "front": "What is the function of the **nucleus**?",
          "back": "It houses the cell's genetic material (DNA) and controls the cell's activities."
        },
        {
          "front": "What is the function of **ribosomes**?",
          "back": "They are the sites of protein synthesis (translation)."
        },
        {
          "front": "What is the function of the **endoplasmic reticulum (ER)**?",
          "back": "A network of membranes involved in protein and lipid synthesis and transport."
        },
        {
          "front": "What is the difference between the rough ER and the smooth ER?",
          "back": "Rough ER has ribosomes on its surface and synthesizes proteins; smooth ER lacks ribosomes and synthesizes lipids."
        },
        {
          "front": "What is the function of the **Golgi apparatus**?",
          "back": "It modifies, sorts, and packages proteins and lipids for secretion or delivery to other organelles."
        },
        {
          "front": "What is the function of the **lysosomes**?",
          "back": "They contain hydrolytic enzymes that digest and recycle worn-out cell parts and break down foreign substances."
        },
        {
          "front": "What is the function of the **mitochondria**?",
          "back": "They are the site of cellular respiration, producing ATP (the cell's energy currency)."
        },
        {
          "front": "What is the function of **chloroplasts**?",
          "back": "They are the sites of photosynthesis in plant cells and algae."
        },
        {
          "front": "What is the function of the **vacuole**?",
          "back": "A large sac in plant cells that stores water and nutrients and provides structural support."
        },
        {
          "front": "What is the function of the **cytoskeleton**?",
          "back": "A network of protein fibers that gives the cell its shape, provides structural support, and facilitates movement."
        },
        {
          "front": "What is the primary component of the cell membrane?",
          "back": "A **phospholipid bilayer**."
        },
        {
          "front": "What does it mean for the cell membrane to be **selectively permeable**?",
          "back": "It allows some substances to pass through more easily than others."
        },
        {
          "front": "Explain the **fluid mosaic model** of the cell membrane.",
          "back": "The membrane is a fluid structure with a 'mosaic' of various proteins and other molecules embedded in or attached to a phospholipid bilayer."
        },
        {
          "front": "What is **passive transport**?",
          "back": "The movement of substances across a membrane without the use of cellular energy (ATP)."
        },
        {
          "front": "What is **diffusion**?",
          "back": "The passive movement of molecules from an area of higher concentration to an area of lower concentration."
        },
        {
          "front": "What is **osmosis**?",
          "back": "The passive diffusion of water across a selectively permeable membrane."
        },
        {
          "front": "What is **facilitated diffusion**?",
          "back": "The passive transport of molecules across a membrane with the help of transport proteins."
        },
        {
          "front": "What is **active transport**?",
          "back": "The movement of substances across a membrane against their concentration gradient, requiring cellular energy (ATP)."
        },
        {
          "front": "What is the function of the sodium-potassium pump?",
          "back": "An example of active transport that pumps sodium out of the cell and potassium into the cell against their concentration gradients."
        },
        {
          "front": "What is a **hypertonic solution**?",
          "back": "A solution with a higher solute concentration than the cell, causing water to leave the cell and the cell to shrink."
        },
        {
          "front": "What is a **hypotonic solution**?",
          "back": "A solution with a lower solute concentration than the cell, causing water to enter the cell and the cell to swell."
        },
        {
          "front": "What is an **isotonic solution**?",
          "back": "A solution with the same solute concentration as the cell, resulting in no net movement of water."
        },
        {
          "front": "What is **endocytosis**?",
          "back": "The process of a cell taking in materials by forming vesicles from the plasma membrane."
        },
        {
          "front": "What is **exocytosis**?",
          "back": "The process of a cell expelling materials by fusing vesicles with the plasma membrane."
        },
        {
          "front": "What is the difference in DNA structure between prokaryotic and eukaryotic cells?",
          "back": "Prokaryotic DNA is a single circular chromosome in the cytoplasm; eukaryotic DNA is linear and found in multiple chromosomes in the nucleus."
        },
        {
          "front": "Which organelle is responsible for breaking down hydrogen peroxide into water and oxygen?",
          "back": "Peroxisomes."
        },
        {
          "front": "What are **transport proteins**?",
          "back": "Proteins that span the cell membrane and assist in the movement of substances across it."
        },
        {
          "front": "What is the primary function of the **cell wall**?",
          "back": "To provide structural support and protection to the cell; found in plant cells, fungi, and bacteria."
        },
        {
          "front": "What is the difference between a plant cell and an animal cell?",
          "back": "Plant cells have a cell wall, chloroplasts, and a large central vacuole, which animal cells lack."
        },
        {
          "front": "What is the theory that explains how eukaryotic cells evolved from prokaryotic cells?",
          "back": "The **endosymbiotic theory**, which suggests that mitochondria and chloroplasts were once free-living prokaryotes."
        },
        {
          "front": "What is the function of **plasmids** in prokaryotic cells?",
          "back": "Small, circular DNA molecules that can replicate independently and often carry genes for antibiotic resistance."
        },
        {
          "front": "What is **pinocytosis**?",
          "back": "A form of endocytosis in which the cell takes in fluid ('cell drinking')."
        },
        {
          "front": "What is **phagocytosis**?",
          "back": "A form of endocytosis in which the cell takes in large particles or other cells ('cell eating')."
        },
        {
          "front": "What is the role of cholesterol in the cell membrane?",
          "back": "It helps maintain the membrane's fluidity and stability by preventing it from becoming too rigid or too fluid at different temperatures."
        },
        {
          "front": "What is a **concentration gradient**?",
          "back": "The difference in the concentration of a substance between two areas."
        },
        {
          "front": "Which type of transport moves molecules from a low concentration to a high concentration?",
          "back": "Active transport."
        },
        {
          "front": "What is the function of a **flagellum** or **cilia**?",
          "back": "They are hair-like appendages used for cell movement."
        },
        {
          "front": "Where is the DNA of a prokaryotic cell located?",
          "back": "In the **nucleoid** region of the cytoplasm."
        },
        {
          "front": "Which type of transport is responsible for a cell taking in glucose?",
          "back": "Facilitated diffusion, as glucose is too large to pass through the membrane on its own but does not require energy to move down its gradient."
        }
      ]
    }
  ]
}
