{
  "flashcards": [
    {
      "category": "Cell Communication & Cell Cycle",
      "cards": [
        {
          "front": "What are the three stages of **cell signaling**?",
          "back": "Reception, transduction, and response."
        },
        {
          "front": "What is a **ligand** in cell communication?",
          "back": "A signaling molecule that binds to a specific receptor on or in a cell."
        },
        {
          "front": "What is **transduction**?",
          "back": "A series of steps in a signal transduction pathway that converts the signal to a form that can bring about a cellular response."
        },
        {
          "front": "What are **second messengers**?",
          "back": "Small, non-protein, water-soluble molecules or ions that relay a signal inside the cell (e.g., cAMP and calcium ions)."
        },
        {
          "front": "What is the function of **protein kinases**?",
          "back": "Enzymes that transfer phosphate groups from ATP to other proteins, a process called phosphorylation."
        },
        {
          "front": "What is the function of **protein phosphatases**?",
          "back": "Enzymes that remove phosphate groups from proteins, a process called dephosphorylation, to turn off a signal."
        },
        {
          "front": "What is the **cell cycle**?",
          "back": "The life of a cell from the time it is first formed from a dividing parent cell until its own division into two daughter cells."
        },
        {
          "front": "What are the two main phases of the cell cycle?",
          "back": "**Interphase** (growth and DNA replication) and the **mitotic (M) phase** (cell division)."
        },
        {
          "front": "What are the three subphases of Interphase?",
          "back": "G1 (Gap 1), S (Synthesis), and G2 (Gap 2)."
        },
        {
          "front": "What happens during the **S phase**?",
          "back": "The cell's DNA is replicated (synthesized)."
        },
        {
          "front": "What are **chromosomes**?",
          "back": "Structures of DNA and protein that contain a cell's genetic information."
        },
        {
          "front": "What are **sister chromatids**?",
          "back": "Two identical copies of a chromosome joined together at a centromere."
        },
        {
          "front": "What are the four main stages of **mitosis**?",
          "back": "Prophase, metaphase, anaphase, and telophase."
        },
        {
          "front": "What happens during **prophase**?",
          "back": "Chromatin condenses into visible chromosomes, and the mitotic spindle begins to form."
        },
        {
          "front": "What happens during **metaphase**?",
          "back": "The chromosomes align at the metaphase plate (the cell's equator)."
        },
        {
          "front": "What happens during **anaphase**?",
          "back": "Sister chromatids separate and move to opposite poles of the cell."
        },
        {
          "front": "What happens during **telophase**?",
          "back": "Chromosomes decondense, nuclear envelopes reform around the two sets of chromosomes, and cytokinesis begins."
        },
        {
          "front": "What is **cytokinesis**?",
          "back": "The division of the cytoplasm to form two separate daughter cells."
        },
        {
          "front": "What is the purpose of **cell cycle checkpoints**?",
          "back": "They are control points where the cell stops and assesses its progress before proceeding to the next stage of the cycle."
        },
        {
          "front": "What are the two main regulatory proteins of the cell cycle?",
          "back": "Cyclins and cyclin-dependent kinases (Cdks)."
        },
        {
          "front": "How do cyclins and Cdks work together?",
          "back": "Cyclins activate Cdks by binding to them, forming an active complex (MPF) that triggers cell cycle progression."
        },
        {
          "front": "What is **apoptosis**?",
          "back": "Programmed cell death, a controlled process for eliminating old or damaged cells."
        },
        {
          "front": "What is the difference between a benign tumor and a malignant tumor?",
          "back": "A benign tumor remains at its original site; a malignant tumor invades surrounding tissues and can metastasize."
        },
        {
          "front": "What is **cancer**?",
          "back": "A disease caused by uncontrolled cell growth due to a failure in cell cycle regulation."
        },
        {
          "front": "What is the G1 checkpoint responsible for?",
          "back": "Deciding whether the cell should proceed to the S phase or enter the G0 phase (a non-dividing state)."
        },
        {
          "front": "What is the M checkpoint responsible for?",
          "back": "Ensuring all chromosomes are properly attached to the spindle fibers before anaphase begins."
        },
        {
          "front": "What is **reception** in cell signaling?",
          "back": "A signaling molecule (ligand) binds to a receptor protein, causing it to change shape."
        },
        {
          "front": "What is a common type of cell surface receptor?",
          "back": "G protein-coupled receptors (GPCRs)."
        },
        {
          "front": "How do water-soluble signaling molecules usually transmit their signal?",
          "back": "They bind to cell-surface receptors and trigger a signal transduction pathway inside the cell."
        },
        {
          "front": "How do lipid-soluble signaling molecules usually transmit their signal?",
          "back": "They can diffuse through the plasma membrane and bind to intracellular receptors in the cytoplasm or nucleus."
        },
        {
          "front": "What is the purpose of **phosphorylation cascades** in transduction?",
          "back": "They amplify the signal and provide more opportunities for regulation."
        },
        {
          "front": "How does **quorum sensing** work in bacteria?",
          "back": "Bacteria secrete signaling molecules that allow them to coordinate their behavior in response to population density."
        },
        {
          "front": "What is the difference between paracrine and endocrine signaling?",
          "back": "Paracrine signaling targets nearby cells; endocrine signaling uses hormones to target distant cells via the bloodstream."
        },
        {
          "front": "What is the role of **mitosis**?",
          "back": "To produce two genetically identical daughter cells for growth, repair, and asexual reproduction."
        },
        {
          "front": "What is a **mutation**?",
          "back": "A change in the DNA sequence that can affect the function of a protein, potentially leading to cancer if it affects cell cycle regulation."
        },
        {
          "front": "What is the role of **p53** in the cell cycle?",
          "back": "A tumor suppressor gene that halts the cell cycle and can initiate apoptosis if DNA damage is detected."
        },
        {
          "front": "What is the final result of mitosis?",
          "back": "Two genetically identical diploid cells from a single diploid parent cell."
        },
        {
          "front": "What is the main role of the **G2 checkpoint**?",
          "back": "To ensure all chromosomes have been replicated correctly before the cell enters mitosis."
        },
        {
          "front": "What happens to the chromosomes in **metaphase**?",
          "back": "They are lined up along the metaphase plate, with their centromeres facing opposite poles."
        },
        {
          "front": "How is cell division regulated in healthy cells?",
          "back": "Through a complex system of internal and external signals, including growth factors, checkpoints, and cyclin/Cdk complexes."
        }
      ]
    }
  ]
}
