{
  "flashcards": [
    {
      "category": "Chemistry of Life",
      "cards": [
        {
          "front": "What is the smallest unit of matter that still retains the properties of an element?",
          "back": "An **atom**."
        },
        {
          "front": "What are the three subatomic particles and their charges?",
          "back": "Protons (+), neutrons (neutral), and electrons (-)."
        },
        {
          "front": "What is a **covalent bond**?",
          "back": "A strong chemical bond formed by the sharing of one or more pairs of valence electrons."
        },
        {
          "front": "What is an **ionic bond**?",
          "back": "A chemical bond resulting from the attraction between oppositely charged ions after a transfer of electrons."
        },
        {
          "front": "What is a **hydrogen bond**?",
          "back": "A weak chemical bond formed between a partially positive hydrogen atom and a partially negative atom (like oxygen or nitrogen)."
        },
        {
          "front": "What is a **polar covalent bond**?",
          "back": "A covalent bond where electrons are shared unequally between atoms, creating partial positive and negative charges."
        },
        {
          "front": "What property of water causes it to be a good solvent?",
          "back": "Its **polarity**. The partial positive and negative charges on the water molecule allow it to dissolve other polar substances."
        },
        {
          "front": "What is **cohesion**?",
          "back": "The sticking together of water molecules to other water molecules due to hydrogen bonds."
        },
        {
          "front": "What is **adhesion**?",
          "back": "The clinging of water molecules to other polar surfaces."
        },
        {
          "front": "Why does water have a high specific heat?",
          "back": "Hydrogen bonds absorb a lot of heat when they break and release heat when they form, allowing water to resist changes in temperature."
        },
        {
          "front": "What is a **macromolecule**?",
          "back": "A large biological molecule, such as a carbohydrate, lipid, protein, or nucleic acid."
        },
        {
          "front": "What is the building block (monomer) of carbohydrates?",
          "back": "Monosaccharides, such as glucose."
        },
        {
          "front": "What is the function of carbohydrates?",
          "back": "To provide a primary source of quick energy (e.g., starch, glucose) and structural support (e.g., cellulose)."
        },
        {
          "front": "What are the building blocks of a protein?",
          "back": "Amino acids."
        },
        {
          "front": "What is the bond that links amino acids together?",
          "back": "A **peptide bond**."
        },
        {
          "front": "What are some functions of proteins?",
          "back": "Catalyzing reactions (enzymes), structural support, transport, and defense."
        },
        {
          "front": "What is the building block of a lipid?",
          "back": "Glycerol and fatty acids."
        },
        {
          "front": "What are some functions of lipids?",
          "back": "Long-term energy storage, insulation, and forming cell membranes."
        },
        {
          "front": "What are the building blocks of nucleic acids?",
          "back": "Nucleotides."
        },
        {
          "front": "What is the function of nucleic acids?",
          "back": "To store and transmit hereditary information (DNA and RNA)."
        },
        {
          "front": "What are **enzymes**?",
          "back": "Biological catalysts that speed up the rate of chemical reactions without being consumed in the reaction."
        },
        {
          "front": "How do enzymes speed up reactions?",
          "back": "By lowering the **activation energy** required for the reaction to occur."
        },
        {
          "front": "What is a **substrate**?",
          "back": "The reactant an enzyme acts on."
        },
        {
          "front": "What is the **active site** of an enzyme?",
          "back": "The specific region of an enzyme that binds to the substrate."
        },
        {
          "front": "Explain the **induced-fit model** of enzyme-substrate binding.",
          "back": "The active site changes its shape slightly to fit the substrate more snugly after binding, like a handshake."
        },
        {
          "front": "What happens to an enzyme's shape when it is **denatured**?",
          "back": "Its 3D structure changes, causing it to lose its function."
        },
        {
          "front": "What two factors can denature an enzyme?",
          "back": "Extreme temperature and pH levels outside of the enzyme's optimal range."
        },
        {
          "front": "What is an **inhibitor**?",
          "back": "A molecule that binds to an enzyme and decreases its activity."
        },
        {
          "front": "What is the difference between a competitive and a non-competitive inhibitor?",
          "back": "A competitive inhibitor binds to the active site; a non-competitive inhibitor binds to a different site, changing the active site's shape."
        },
        {
          "front": "What is a **catalyst**?",
          "back": "A substance that speeds up a chemical reaction without itself being changed."
        },
        {
          "front": "What is the process of building a polymer from monomers?",
          "back": "Dehydration synthesis (or condensation reaction), which removes a water molecule."
        },
        {
          "front": "What is the process of breaking down a polymer into monomers?",
          "back": "Hydrolysis, which adds a water molecule to break the bond."
        },
        {
          "front": "What is the name for a molecule with a long carbon backbone and a carboxyl group, found in lipids?",
          "back": "A **fatty acid**."
        },
        {
          "front": "What is the primary function of DNA?",
          "back": "To contain the genetic instructions for the development, functioning, growth, and reproduction of all known organisms."
        },
        {
          "front": "What is a **phospholipid**?",
          "back": "A lipid that is the main component of cell membranes, having a hydrophilic head and a hydrophobic tail."
        },
        {
          "front": "What is a **buffer**?",
          "back": "A substance that minimizes changes in pH by accepting or donating H+ ions."
        },
        {
          "front": "What is the term for a molecule that has both a hydrophilic and a hydrophobic part?",
          "back": "Amphipathic."
        },
        {
          "front": "How does an enzyme's active site relate to its substrate?",
          "back": "It has a specific shape and chemical properties that are complementary to the substrate."
        },
        {
          "front": "What is the energy currency of the cell?",
          "back": "ATP (adenosine triphosphate)."
        },
        {
          "front": "What is the difference between saturated and unsaturated fats?",
          "back": "Saturated fats have no double bonds in their fatty acid chains, making them straight; unsaturated fats have one or more double bonds, causing them to bend."
        }
      ]
    }
  ]
}