{
  "flashcards": [
    {
      "category": "Cellular Energetics",
      "cards": [
        {
          "front": "What is **ATP**?",
          "back": "Adenosine triphosphate, the main energy currency of a cell."
        },
        {
          "front": "How does ATP store energy?",
          "back": "In the chemical bonds between its three phosphate groups. The breaking of the outermost bond releases a large amount of energy."
        },
        {
          "front": "What is **energy coupling**?",
          "back": "The use of an exergonic (energy-releasing) process to drive an endergonic (energy-requiring) one."
        },
        {
          "front": "What is the overall equation for **photosynthesis**?",
          "back": "$6CO_2 + 6H_2O + \\text{light energy} \\rightarrow C_6H_{12}O_6 + 6O_2$."
        },
        {
          "front": "Where in a plant cell does photosynthesis take place?",
          "back": "In the **chloroplasts**."
        },
        {
          "front": "What are the two main stages of photosynthesis?",
          "back": "The **light-dependent reactions** and the **Calvin cycle** (or light-independent reactions)."
        },
        {
          "front": "What is the primary function of the light-dependent reactions?",
          "back": "To convert light energy into chemical energy (ATP and NADPH)."
        },
        {
          "front": "What is the primary function of the Calvin cycle?",
          "back": "To use the ATP and NADPH from the light reactions to convert carbon dioxide into glucose."
        },
        {
          "front": "What is the overall equation for **cellular respiration**?",
          "back": "$C_6H_{12}O_6 + 6O_2 \\rightarrow 6CO_2 + 6H_2O + \\text{ATP}$."
        },
        {
          "front": "Where in a cell does cellular respiration take place?",
          "back": "Primarily in the **mitochondria**."
        },
        {
          "front": "What are the three main stages of aerobic cellular respiration?",
          "back": "**Glycolysis**, the **Krebs cycle** (or citric acid cycle), and **oxidative phosphorylation**."
        },
        {
          "front": "What is the purpose of glycolysis?",
          "back": "To split one molecule of glucose into two molecules of pyruvate, producing a small amount of ATP and NADH."
        },
        {
          "front": "What is the purpose of the Krebs cycle?",
          "back": "To complete the breakdown of pyruvate and release energy in the form of ATP, NADH, and $FADH_2$."
        },
        {
          "front": "What is the purpose of oxidative phosphorylation?",
          "back": "To use the NADH and $FADH_2$ from previous steps to create a proton gradient and generate a large amount of ATP."
        },
        {
          "front": "What is the final electron acceptor in aerobic cellular respiration?",
          "back": "**Oxygen ($O_2$)**."
        },
        {
          "front": "What happens in a cell when oxygen is not available?",
          "back": "It undergoes **fermentation**, which allows glycolysis to continue producing a small amount of ATP."
        },
        {
          "front": "What is the difference between alcoholic fermentation and lactic acid fermentation?",
          "back": "Alcoholic fermentation produces ethanol and carbon dioxide; lactic acid fermentation produces lactic acid."
        },
        {
          "front": "What is a **photoautotroph**?",
          "back": "An organism that uses light to synthesize organic molecules (e.g., plants, algae)."
        },
        {
          "front": "What is a **chemoheterotroph**?",
          "back": "An organism that obtains energy by consuming other organisms (e.g., animals, fungi)."
        },
        {
          "front": "What is the pigment responsible for absorbing light energy in photosynthesis?",
          "back": "**Chlorophyll**."
        },
        {
          "front": "What is the waste product of photosynthesis?",
          "back": "Oxygen ($O_2$) gas."
        },
        {
          "front": "What is the waste product of aerobic cellular respiration?",
          "back": "Carbon dioxide ($CO_2$) and water ($H_2O$)."
        },
        {
          "front": "What is the role of the electron transport chain in photosynthesis?",
          "back": "To use the energy from electrons to pump protons and create a proton gradient for ATP synthesis."
        },
        {
          "front": "What is the role of the electron transport chain in cellular respiration?",
          "back": "To use the energy from electrons to pump protons into the intermembrane space, creating a proton gradient."
        },
        {
          "front": "What enzyme synthesizes ATP using the proton gradient?",
          "back": "**ATP synthase**."
        },
        {
          "front": "What is **NADH** and **$FADH_2$**?",
          "back": "Electron carriers that transport high-energy electrons to the electron transport chain."
        },
        {
          "front": "What is the process of splitting water molecules during photosynthesis?",
          "back": "**Photolysis**."
        },
        {
          "front": "What is **photophosphorylation**?",
          "back": "The process of generating ATP from ADP and phosphate by using light energy."
        },
        {
          "front": "What is **oxidative phosphorylation**?",
          "back": "The process of generating ATP from ADP and phosphate by using the energy from the oxidation of electron carriers."
        },
        {
          "front": "In photosynthesis, where do the light-dependent reactions occur?",
          "back": "In the **thylakoid membranes** of the chloroplasts."
        },
        {
          "front": "In photosynthesis, where does the Calvin cycle occur?",
          "back": "In the **stroma** of the chloroplasts."
        },
        {
          "front": "In cellular respiration, where does glycolysis occur?",
          "back": "In the **cytoplasm**."
        },
        {
          "front": "In cellular respiration, where does the Krebs cycle occur?",
          "back": "In the **mitochondrial matrix**."
        },
        {
          "front": "In cellular respiration, where does oxidative phosphorylation occur?",
          "back": "In the **inner mitochondrial membrane**."
        },
        {
          "front": "What is the purpose of fermentation from the perspective of glycolysis?",
          "back": "To regenerate **$NAD^+$** from NADH so that glycolysis can continue to produce ATP."
        },
        {
          "front": "What is the net gain of ATP from one molecule of glucose during glycolysis?",
          "back": "2 ATP."
        },
        {
          "front": "What is the net gain of ATP from one molecule of glucose during the Krebs cycle?",
          "back": "2 ATP (one for each pyruvate)."
        },
        {
          "front": "Why is the total ATP yield from cellular respiration an estimate (around 32-38 ATP)?",
          "back": "Because the number of ATPs produced per NADH and $FADH_2$ can vary, and some energy is used for transport."
        },
        {
          "front": "What is the first step of the Calvin cycle?",
          "back": "**Carbon fixation**, where $CO_2$ is incorporated into an organic molecule."
        },
        {
          "front": "What is the main purpose of photosynthesis from a biological perspective?",
          "back": "To convert solar energy into chemical energy stored in glucose, which can be used by the plant and by organisms that eat the plant."
        }
      ]
    }
  ]
}
