{
  "flashcards": [
    {
      "category": "Evolutionary Biology",
      "cards": [
        {
          "front": "What is the key principle of Darwin's theory of natural selection?",
          "back": "Individuals with inherited traits better suited to the local environment are more likely to survive and reproduce."
        },
        {
          "front": "How is **genetic variation** important for natural selection?",
          "back": "It provides the raw material for evolution; without it, there would be no differences for selection to act upon."
        },
        {
          "front": "What is the difference between a **phenotypic adaptation** and a **genotypic adaptation**?",
          "back": "A phenotypic adaptation is a temporary, non-heritable change (e.g., getting a tan); a genotypic adaptation is a heritable change in a trait over generations."
        },
        {
          "front": "Define **directional selection**.",
          "back": "A mode of natural selection that favors individuals at one extreme of a phenotypic range, shifting the population's trait distribution in that direction."
        },
        {
          "front": "Define **stabilizing selection**.",
          "back": "A mode of natural selection that favors intermediate phenotypes and acts against extreme variants, narrowing the range of variation."
        },
        {
          "front": "Define **disruptive selection**.",
          "back": "A mode of natural selection that favors individuals at both extremes of a phenotypic range over individuals with intermediate phenotypes."
        },
        {
          "front": "What is **speciation**?",
          "back": "The process by which one species splits into two or more new species."
        },
        {
          "front": "What is the difference between **allopatric** and **sympatric** speciation?",
          "back": "Allopatric speciation occurs when a population is geographically isolated; sympatric speciation occurs within the same geographic area."
        },
        {
          "front": "What are **prezygotic barriers**?",
          "back": "Reproductive isolating mechanisms that prevent different species from interbreeding or from forming a zygote."
        },
        {
          "front": "What are some examples of **prezygotic barriers**?",
          "back": "Habitat isolation, temporal isolation (mating at different times), behavioral isolation, mechanical isolation, and gametic isolation."
        },
        {
          "front": "What are **postzygotic barriers**?",
          "back": "Reproductive isolating mechanisms that prevent a hybrid zygote from developing into a fertile adult."
        },
        {
          "front": "What are some examples of **postzygotic barriers**?",
          "back": "Reduced hybrid viability (the hybrid fails to develop or dies), reduced hybrid fertility (the hybrid is sterile), and hybrid breakdown."
        },
        {
          "front": "What is a **phylogenetic tree** or **cladogram**?",
          "back": "A diagram representing a hypothesis about the evolutionary relationships among a group of organisms."
        },
        {
          "front": "On a phylogenetic tree, what does a **branch point** or **node** represent?",
          "back": "The most recent common ancestor of the lineages branching from that point."
        },
        {
          "front": "What is a **clade**?",
          "back": "A group of species that includes an ancestral species and all of its descendants."
        },
        {
          "front": "What is a **shared derived character**?",
          "back": "A unique feature that arose in a specific lineage and is shared by all of its members, but not by their ancestors."
        },
        {
          "front": "What is **adaptive radiation**?",
          "back": "The rapid evolution of many new species from a single common ancestor when they colonize a new area with diverse opportunities."
        },
        {
          "front": "How does the **fossil record** provide evidence for evolution?",
          "back": "It shows a historical sequence of organisms, from older, simpler forms to younger, more complex ones, and includes transitional forms."
        },
        {
          "front": "What are **homologous structures**?",
          "back": "Anatomical similarities between organisms that indicate a shared ancestry (e.g., the forelimbs of a human, bat, and whale)."
        },
        {
          "front": "What is **convergent evolution**?",
          "back": "The process by which unrelated species evolve similar traits because they have to adapt to similar environmental pressures."
        },
        {
          "front": "How does **biogeography** support the theory of evolution?",
          "back": "The geographic distribution of species provides evidence of how they have evolved from common ancestors in a particular location."
        },
        {
          "front": "How does **comparative embryology** provide evidence for evolution?",
          "back": "Similarities in the embryonic development of different species suggest a shared evolutionary history."
        },
        {
          "front": "How does **molecular evidence** (DNA/proteins) support evolution?",
          "back": "The more similar the DNA or protein sequences are between two species, the more recently they shared a common ancestor."
        },
        {
          "front": "What is **gene flow**?",
          "back": "The movement of alleles between populations, which can change allele frequencies and reduce genetic differences between populations."
        },
        {
          "front": "What is the difference between a gene pool and allele frequency?",
          "back": "The gene pool is all the genes in a population; allele frequency is the proportion of a specific allele in that pool."
        },
        {
          "front": "What is the **Hardy-Weinberg equation**?",
          "back": "$$p^2 + 2pq + q^2 = 1$$"
        },
        {
          "front": "What does '$p$' represent in the Hardy-Weinberg equation?",
          "back": "The frequency of the dominant allele in the population."
        },
        {
          "front": "What does '$q$' represent in the Hardy-Weinberg equation?",
          "back": "The frequency of the recessive allele in the population."
        },
        {
          "front": "What does '$2pq$' represent in the Hardy-Weinberg equation?",
          "back": "The frequency of the heterozygous genotype."
        },
        {
          "front": "How does **genetic drift** affect a population?",
          "back": "It can cause random changes in allele frequencies, often leading to a loss of genetic variation, and is more significant in small populations."
        },
        {
          "front": "What is the difference between the **bottleneck effect** and the **founder effect**?",
          "back": "The bottleneck effect is a population reduction due to a disaster; the founder effect is a new population started by a few individuals."
        },
        {
          "front": "What is **coevolution**?",
          "back": "The process by which two or more species reciprocally influence each other's evolution."
        },
        {
          "front": "How is a **vestigial structure** evidence of evolution?",
          "back": "It suggests that the organism's ancestors had a use for the structure, indicating a change in the species over time."
        },
        {
          "front": "What is the role of **mutations** in evolution?",
          "back": "Mutations are the ultimate source of new genetic variation, creating new alleles that can be acted on by natural selection."
        },
        {
          "front": "What is a **molecular clock**?",
          "back": "A method used to estimate the time of evolutionary divergence between two species based on the number of genetic differences."
        },
        {
          "front": "What is **punctuated equilibrium**?",
          "back": "A model of evolution that proposes that species remain relatively unchanged for long periods and then undergo rapid bursts of change."
        },
        {
          "front": "What is **gradualism**?",
          "back": "A model of evolution that proposes that species change slowly and steadily over long periods of time."
        },
        {
          "front": "What is a **species** according to the biological species concept?",
          "back": "A group of populations whose members have the potential to interbreed and produce viable, fertile offspring."
        },
        {
          "front": "What is **hybrid breakdown**?",
          "back": "A postzygotic barrier where the first-generation hybrids are fertile, but their offspring are sterile or inviable."
        },
        {
          "front": "What is **sexual selection**?",
          "back": "A form of natural selection in which individuals with certain inherited characteristics are more likely than others to obtain mates."
        }
      ]
    }
  ]
}
