{
  "flashcards": [
    {
      "category": "Mendelian Genetics",
      "cards": [
        {
          "front": "What is a **gene**?",
          "back": "A segment of DNA that codes for a specific protein or RNA molecule, determining a trait."
        },
        {
          "front": "What is an **allele**?",
          "back": "An alternative version of a gene."
        },
        {
          "front": "What is a **genotype**?",
          "back": "The genetic makeup or set of alleles of an organism."
        },
        {
          "front": "What is a **phenotype**?",
          "back": "The observable physical and physiological traits of an organism, determined by its genotype."
        },
        {
          "front": "What does it mean to be **homozygous**?",
          "back": "Having two identical alleles for a given gene (e.g., **AA** or **aa**)."
        },
        {
          "front": "What does it mean to be **heterozygous**?",
          "back": "Having two different alleles for a given gene (e.g., **Aa**)."
        },
        {
          "front": "What is Mendel's **Law of Segregation**?",
          "back": "The two alleles for a heritable trait separate (segregate) during gamete formation and end up in different gametes."
        },
        {
          "front": "What is Mendel's **Law of Independent Assortment**?",
          "back": "Alleles for different genes assort independently of each other during gamete formation."
        },
        {
          "front": "What is a **Punnett square**?",
          "back": "A diagram used to predict the outcomes of a particular cross or breeding experiment."
        },
        {
          "front": "In a monohybrid cross of two heterozygous parents (Aa x Aa), what is the expected genotypic ratio?",
          "back": "1 AA : 2 Aa : 1 aa."
        },
        {
          "front": "In a monohybrid cross of two heterozygous parents (Aa x Aa), what is the expected phenotypic ratio?",
          "back": "3 dominant phenotype : 1 recessive phenotype."
        },
        {
          "front": "What is the **multiplication rule** of probability?",
          "back": "The probability of two or more independent events occurring together is the product of their individual probabilities."
        },
        {
          "front": "What is the **addition rule** of probability?",
          "back": "The probability of any one of two or more mutually exclusive events occurring is the sum of their individual probabilities."
        },
        {
          "front": "What is a **pedigree**?",
          "back": "A family tree that describes the relationships among parents and children and the patterns of inheritance of a particular trait."
        },
        {
          "front": "In a pedigree, how are affected individuals typically represented?",
          "back": "By a shaded circle (female) or square (male)."
        },
        {
          "front": "How can you identify an **autosomal recessive** trait from a pedigree?",
          "back": "It skips generations, and affected individuals often have unaffected parents who are carriers."
        },
        {
          "front": "How can you identify an **autosomal dominant** trait from a pedigree?",
          "back": "It appears in every generation, and affected individuals have at least one affected parent."
        },
        {
          "front": "How can you identify an **X-linked recessive** trait from a pedigree?",
          "back": "More males than females are affected, and it often skips a generation through an unaffected carrier mother."
        },
        {
          "front": "What is the genotype of a carrier for a recessive genetic disorder?",
          "back": "Heterozygous (e.g., **Aa**)."
        },
        {
          "front": "What is an example of an autosomal recessive disorder?",
          "back": "Cystic fibrosis or sickle-cell disease."
        },
        {
          "front": "What is an example of an autosomal dominant disorder?",
          "back": "Huntington's disease or achondroplasia."
        },
        {
          "front": "What is an example of an X-linked recessive disorder?",
          "back": "Color blindness or hemophilia."
        },
        {
          "front": "If an allele is dominant, does that mean it is more common in the population?",
          "back": "No, a dominant allele is not necessarily more common. For example, the allele for six fingers is dominant, but it is very rare."
        },
        {
          "front": "What is **codominance**?",
          "back": "When both alleles are fully expressed in the phenotype of a heterozygote (e.g., AB blood type)."
        },
        {
          "front": "What is **incomplete dominance**?",
          "back": "When the phenotype of a heterozygote is an intermediate blend of the two homozygous phenotypes (e.g., red and white flowers creating pink flowers)."
        },
        {
          "front": "What is a **test cross**?",
          "back": "A cross between an individual with an unknown genotype (showing the dominant phenotype) and a homozygous recessive individual to determine the unknown genotype."
        },
        {
          "front": "What is **polygenic inheritance**?",
          "back": "When two or more genes have an additive effect on a single phenotype (e.g., skin color or height)."
        },
        {
          "front": "What is a **karyotype**?",
          "back": "An ordered display of the pairs of chromosomes from a cell, often used to detect chromosomal abnormalities."
        },
        {
          "front": "Why are males more susceptible to X-linked recessive disorders?",
          "back": "Because they only have one X chromosome, so a single recessive allele on that chromosome will be expressed."
        },
        {
          "front": "What is the probability of a heterozygous carrier mother and an unaffected father having an affected child with an autosomal recessive disorder?",
          "back": "25% (1/4)."
        },
        {
          "front": "What is a **dihybrid cross**?",
          "back": "A cross between two individuals that are heterozygous for two different genes (e.g., AaBb x AaBb)."
        },
        {
          "front": "In a dihybrid cross of two heterozygous parents, what is the expected phenotypic ratio?",
          "back": "9:3:3:1."
        },
        {
          "front": "What is a **carrier**?",
          "back": "An individual who is heterozygous for a recessive allele but does not show the trait."
        },
        {
          "front": "How many alleles for a single gene does a human inherit from each parent?",
          "back": "One allele from each parent, for a total of two."
        },
        {
          "front": "What are **linked genes**?",
          "back": "Genes that are located close together on the same chromosome and tend to be inherited together, violating the Law of Independent Assortment."
        },
        {
          "front": "What is the name for a condition where an organism has an abnormal number of chromosomes?",
          "back": "**Aneuploidy**."
        },
        {
          "front": "What is an example of aneuploidy?",
          "back": "Down syndrome (Trisomy 21), where there is an extra copy of chromosome 21."
        },
        {
          "front": "What is the **Law of Segregation**'s connection to meiosis?",
          "back": "It reflects the separation of homologous chromosomes during anaphase I of meiosis."
        },
        {
          "front": "What is the **Law of Independent Assortment**'s connection to meiosis?",
          "back": "It reflects the random orientation of homologous pairs during metaphase I of meiosis."
        },
        {
          "front": "What does it mean for a gene to be **sex-linked**?",
          "back": "The gene is located on a sex chromosome (X or Y)."
        }
      ]
    }
  ]
}
