{
  "flashcards": [
    {
      "category": "Molecular Genetics",
      "cards": [
        {
          "front": "What are the three components of a DNA nucleotide?",
          "back": "A deoxyribose sugar, a phosphate group, and a nitrogenous base."
        },
        {
          "front": "What are the four nitrogenous bases in DNA?",
          "back": "Adenine (A), Guanine (G), Cytosine (C), and Thymine (T)."
        },
        {
          "front": "What is the name of the model that describes DNA's structure?",
          "back": "The **double-helix model**."
        },
        {
          "front": "What type of bond holds the two strands of the DNA double helix together?",
          "back": "Weak **hydrogen bonds** between the nitrogenous bases."
        },
        {
          "front": "What does it mean that DNA replication is **semi-conservative**?",
          "back": "Each new DNA molecule consists of one old strand (from the parent molecule) and one newly synthesized strand."
        },
        {
          "front": "What is the role of the enzyme **helicase** in DNA replication?",
          "back": "It unwinds and unzips the DNA double helix by breaking the hydrogen bonds."
        },
        {
          "front": "What is the role of the enzyme **DNA polymerase** in replication?",
          "back": "It adds new nucleotides to the growing DNA strand, building the new strand in the 5' to 3' direction."
        },
        {
          "front": "What is the role of the enzyme **ligase**?",
          "back": "It joins the fragments of DNA on the lagging strand together."
        },
        {
          "front": "What is the **Central Dogma of Molecular Biology**?",
          "back": "The flow of genetic information from DNA to RNA to protein."
        },
        {
          "front": "What is **transcription**?",
          "back": "The synthesis of an RNA molecule from a DNA template."
        },
        {
          "front": "What is **translation**?",
          "back": "The synthesis of a polypeptide (protein) from an mRNA template."
        },
        {
          "front": "Where does transcription occur in a eukaryotic cell?",
          "back": "In the **nucleus**."
        },
        {
          "front": "Where does translation occur?",
          "back": "On the **ribosomes** in the cytoplasm."
        },
        {
          "front": "What is the role of **mRNA**?",
          "back": "Messenger RNA carries the genetic message from the DNA in the nucleus to the ribosomes in the cytoplasm."
        },
        {
          "front": "What is the role of **tRNA**?",
          "back": "Transfer RNA carries specific amino acids to the ribosome to be added to the growing polypeptide chain."
        },
        {
          "front": "What is a **codon**?",
          "back": "A three-nucleotide sequence on mRNA that codes for a specific amino acid."
        },
        {
          "front": "What is the start codon for translation?",
          "back": "**AUG**."
        },
        {
          "front": "What is the process of **gene regulation**?",
          "back": "The mechanisms that control which genes are expressed and at what level."
        },
        {
          "front": "What is a **mutation**?",
          "back": "A permanent change in the DNA sequence."
        },
        {
          "front": "What is the difference between a point mutation and a frameshift mutation?",
          "back": "A point mutation changes a single nucleotide; a frameshift mutation is an insertion or deletion that shifts the reading frame of the codons."
        },
        {
          "front": "What is an **operon**?",
          "back": "A cluster of genes in a prokaryote with a single promoter that are transcribed together."
        },
        {
          "front": "What is the purpose of the **lac operon**?",
          "back": "To regulate the expression of genes needed to metabolize lactose in bacteria."
        },
        {
          "front": "How does the lac operon work in the presence of lactose?",
          "back": "Lactose acts as an inducer, binding to the repressor and inactivating it, allowing transcription to proceed."
        },
        {
          "front": "How does the lac operon work in the absence of lactose?",
          "back": "The active repressor protein binds to the operator, preventing RNA polymerase from transcribing the genes."
        },
        {
          "front": "What is the purpose of the **trp operon**?",
          "back": "To regulate the expression of genes needed to synthesize tryptophan."
        },
        {
          "front": "How does the trp operon work in the presence of tryptophan?",
          "back": "Tryptophan acts as a corepressor, binding to the repressor and activating it, which then blocks transcription."
        },
        {
          "front": "What is a **promoter** in gene regulation?",
          "back": "A specific DNA sequence where RNA polymerase binds and initiates transcription."
        },
        {
          "front": "What is a **transcription factor**?",
          "back": "A protein that binds to DNA and regulates gene expression, common in eukaryotes."
        },
        {
          "front": "What is the function of **histone modification** in eukaryotic gene regulation?",
          "back": "Adding or removing chemical groups to histones can either loosen or tighten DNA packing, affecting access for transcription."
        },
        {
          "front": "What is the difference between a template strand and a coding strand of DNA?",
          "back": "The template strand is the one used by RNA polymerase to synthesize mRNA; the coding strand has the same sequence as the mRNA (with T instead of U)."
        },
        {
          "front": "What is the function of **RNA polymerase** in transcription?",
          "back": "It unzips the DNA and adds complementary RNA nucleotides to build the mRNA strand."
        },
        {
          "front": "What is a **start codon** and a **stop codon**?",
          "back": "A start codon signals the beginning of translation; a stop codon signals the end of translation."
        },
        {
          "front": "What is **post-transcriptional regulation**?",
          "back": "Control of gene expression that occurs after transcription, such as alternative RNA splicing."
        },
        {
          "front": "What is **alternative splicing**?",
          "back": "The process by which different mRNA molecules are produced from the same primary transcript, allowing one gene to code for multiple proteins."
        },
        {
          "front": "What is a **ribosome** made of?",
          "back": "Ribosomal RNA (rRNA) and proteins."
        },
        {
          "front": "What is the role of a **repressor** protein?",
          "back": "To prevent or reduce gene transcription by binding to the operator region of an operon."
        },
        {
          "front": "What is the function of **Okazaki fragments**?",
          "back": "Short segments of DNA synthesized on the lagging strand during DNA replication."
        },
        {
          "front": "What is the role of the **operator** in an operon?",
          "back": "A DNA segment that serves as a binding site for the repressor protein."
        },
        {
          "front": "What is a **silent mutation**?",
          "back": "A mutation that changes a codon but does not change the amino acid it codes for, so there is no change in the protein."
        },
        {
          "front": "What is the final product of translation?",
          "back": "A polypeptide chain (a protein)."
        }
      ]
    }
  ]
}
