{
  "flashcards": [
    {
      "category": "Review & Practice",
      "cards": [
        {
          "front": "In a lab, you add an enzyme to a substrate solution. How would you measure the rate of the reaction?",
          "back": "By measuring the rate of product formation or the rate of substrate consumption over time."
        },
        {
          "front": "A student adds a strong acid to a solution with an enzyme. What will happen to the enzyme's activity?",
          "back": "The enzyme will likely denature, losing its shape and function, so its activity will decrease significantly or stop completely."
        },
        {
          "front": "How would you identify the products of a hydrolysis reaction in a lab setting?",
          "back": "You could use specific chemical indicators or tests to detect the presence of the monomers that were produced."
        },
        {
          "front": "A lab involves using a dialysis bag to represent a cell membrane. If you place a bag with a 20% sucrose solution into a beaker with a 10% sucrose solution, what will happen to the bag's mass?",
          "back": "The bag's mass will increase because water will move into the bag by osmosis to balance the solute concentrations."
        },
        {
          "front": "What is the purpose of a control group in an experiment on enzyme activity?",
          "back": "To serve as a baseline for comparison, showing what happens in the absence of the variable being tested (e.g., without the enzyme or with a denatured enzyme)."
        },
        {
          "front": "A student observes a red blood cell placed in an unknown solution. The cell shrinks. Is the solution hypertonic, hypotonic, or isotonic?",
          "back": "The solution is **hypertonic** because water moved out of the cell, causing it to shrink."
        },
        {
          "front": "You are given a graph showing reaction rate vs. temperature. The rate increases to a peak and then drops sharply. What does the peak represent?",
          "back": "The **optimal temperature** for the enzyme's activity before it begins to denature."
        },
        {
          "front": "What type of macromolecule would you test for using the Benedict's test?",
          "back": "Monosaccharides (simple sugars) or other reducing sugars."
        },
        {
          "front": "You are asked to analyze a diagram of a cell. What feature would definitively tell you it is a eukaryotic cell?",
          "back": "The presence of a **membrane-bound nucleus** or other membrane-bound organelles like mitochondria or chloroplasts."
        },
        {
          "front": "What is the primary role of the Golgi apparatus as shown in a diagram of a cell?",
          "back": "To modify, sort, and package proteins and lipids for transport."
        },
        {
          "front": "Based on its function, which organelle would you expect to be numerous in a muscle cell, and why?",
          "back": "**Mitochondria**, because muscle cells require a large amount of ATP for contraction."
        },
        {
          "front": "A diagram shows a cell membrane with a substance moving from a high concentration to a low concentration with the help of a protein channel. What type of transport is this?",
          "back": "**Facilitated diffusion**."
        },
        {
          "front": "A molecule is shown binding to a receptor on a cell surface, triggering a cascade of intracellular reactions. What is the overall process called?",
          "back": "Signal transduction."
        },
        {
          "front": "If a cell is unable to produce ribosomes, what would be the immediate effect on the cell's function?",
          "back": "The cell would be unable to synthesize proteins, leading to a complete cessation of most cellular functions."
        },
        {
          "front": "In a lab measuring photosynthesis, you find that increasing the light intensity beyond a certain point no longer increases the rate of oxygen production. What is this point called?",
          "back": "The **light saturation point**, where light is no longer the limiting factor."
        },
        {
          "front": "What is the independent variable in a lab where you test the effect of pH on enzyme activity?",
          "back": "The **pH** level."
        },
        {
          "front": "What is the dependent variable in a lab where you test the effect of pH on enzyme activity?",
          "back": "The **rate of enzyme activity** (e.g., product formation)."
        },
        {
          "front": "An MCQ asks you to identify a characteristic of a prokaryotic cell. What would be a correct answer?",
          "back": "It lacks a nucleus and other membrane-bound organelles."
        },
        {
          "front": "An FRQ asks you to describe how a cell maintains homeostasis. What is a key mechanism you should mention?",
          "back": "The **cell membrane**'s ability to regulate the movement of substances via passive and active transport."
        },
        {
          "front": "How would you explain the concept of induced fit in the context of an enzyme-substrate interaction?",
          "back": "The enzyme's active site changes shape slightly after the substrate binds, providing a more precise fit for catalysis."
        },
        {
          "front": "You are given a diagram showing a cell completing mitosis. What is a key feature you would look for to confirm it is an animal cell?",
          "back": "The presence of a **cleavage furrow** during cytokinesis, rather than a cell plate."
        },
        {
          "front": "What is the purpose of the mitotic spindle?",
          "back": "To organize and separate the chromosomes during mitosis."
        },
        {
          "front": "In a lab, you test the effects of a substance on a cell and observe that the cell cycle stops at the G1 checkpoint. What is the substance most likely affecting?",
          "back": "The cell's ability to grow and replicate its DNA, likely by inhibiting the synthesis of proteins needed for the S phase."
        },
        {
          "front": "An MCQ asks about the final electron acceptor in cellular respiration. What is the correct answer?",
          "back": "**Oxygen**."
        },
        {
          "front": "If a plant cell is placed in a hypotonic solution, what prevents it from bursting?",
          "back": "The rigid **cell wall**."
        },
        {
          "front": "What is the relationship between an enzyme and its substrate?",
          "back": "An enzyme is highly specific to a particular substrate due to the shape of its active site."
        },
        {
          "front": "Why is the inner mitochondrial membrane highly folded?",
          "back": "To increase its surface area, which allows for more space for the electron transport chain and ATP synthase to function."
        },
        {
          "front": "An FRQ asks you to justify why enzymes are essential for life. What is a key point you would make?",
          "back": "They lower activation energy, allowing chemical reactions to occur at a rate necessary to sustain life under physiological conditions."
        },
        {
          "front": "In a lab, you use a spectrophotometer to measure the concentration of a colored product. How does this relate to reaction rate?",
          "back": "The rate of change in absorbance over time is proportional to the rate of the reaction."
        },
        {
          "front": "What is the role of cholesterol in the cell membrane?",
          "back": "It acts as a buffer, maintaining membrane fluidity and stability across a range of temperatures."
        },
        {
          "front": "A student incorrectly states that both mitosis and meiosis produce genetically identical cells. What is the correct statement?",
          "back": "Mitosis produces genetically identical cells, but meiosis produces genetically unique cells."
        },
        {
          "front": "What is the role of ATP in active transport?",
          "back": "ATP provides the energy needed to change the shape of transport proteins to move molecules against their concentration gradient."
        },
        {
          "front": "An FRQ asks you to explain the difference between osmosis and diffusion. What is a key distinction?",
          "back": "Diffusion is the movement of any substance from high to low concentration, while osmosis is specifically the diffusion of water across a membrane."
        },
        {
          "front": "A scientist observes that a cell does not divide even though it has a large amount of DNA. Which cell cycle checkpoint is likely being regulated?",
          "back": "The **G2 checkpoint**, which ensures that DNA replication is complete and accurate before entering mitosis."
        },
        {
          "front": "You are given a diagram of a cell and notice a large central vacuole. Is this cell from a plant or an animal?",
          "back": "A **plant** cell."
        },
        {
          "front": "In an enzyme experiment, you add a substance and observe that the maximum reaction rate is unchanged, but a higher substrate concentration is needed to reach it. What type of inhibitor did you add?",
          "back": "A **competitive inhibitor**, which competes with the substrate for the active site."
        },
        {
          "front": "A lab involves staining cells to observe their nuclei. What dye would you use?",
          "back": "A dye that binds to DNA, such as methylene blue or DAPI."
        },
        {
          "front": "What would be the effect of a mutation that permanently activates a cell cycle-promoting gene?",
          "back": "It could lead to uncontrolled cell division and cancer."
        },
        {
          "front": "In a graph of an enzyme reaction, what is represented by the slope of the line during the initial phase?",
          "back": "The **initial reaction rate**."
        },
        {
          "front": "An MCQ asks you to identify the organelle responsible for protein synthesis. What is the correct answer?",
          "back": "The **ribosome**."
        }
      ]
    }
  ]
}
