{
  "flashcards": [
    {
      "category": "Electricity & Magnetism",
      "cards": [
        {
          "front": "What is an **electric charge**?",
          "back": "A fundamental property of matter that causes it to experience a force when placed in an electromagnetic field."
        },
        {
          "front": "What is the SI unit of electric charge?",
          "back": "The Coulomb (C)."
        },
        {
          "front": "What does **Coulomb's Law** state?",
          "back": "The force between two point charges is directly proportional to the product of the charges and inversely proportional to the square of the distance between them."
        },
        {
          "front": "What is the formula for Coulomb's Law?",
          "back": "$$F = k\\frac{q_1q_2}{r^2}$$"
        },
        {
          "front": "What is an **electric field**?",
          "back": "A region around an electric charge or a group of charges where a force would be exerted on another charge."
        },
        {
          "front": "What is the formula for an electric field created by a point charge?",
          "back": "$$E = k\\frac{q}{r^2}$$"
        },
        {
          "front": "What is **electric potential energy**?",
          "back": "The potential energy of a charged particle in an electric field."
        },
        {
          "front": "What is **voltage (electric potential difference)**?",
          "back": "The work required per unit charge to move a test charge between two points in an electric field."
        },
        {
          "front": "What is the SI unit of voltage?",
          "back": "The Volt (V)."
        },
        {
          "front": "What is **electric current**?",
          "back": "The flow of electric charge."
        },
        {
          "front": "What is the SI unit of electric current?",
          "back": "The Ampere (A)."
        },
        {
          "front": "What is **Ohm's Law**?",
          "back": "The voltage across a conductor is directly proportional to the current passing through it, given a constant resistance ($$V=IR$$)."
        },
        {
          "front": "What is **resistance**?",
          "back": "A measure of the opposition to the flow of electric current."
        },
        {
          "front": "What is the SI unit of resistance?",
          "back": "The Ohm ($$\\Omega$$)."
        },
        {
          "front": "What is a **series circuit**?",
          "back": "A circuit where components are connected end-to-end, so there is only one path for the current to flow."
        },
        {
          "front": "In a series circuit, what is constant?",
          "back": "The current is the same at all points."
        },
        {
          "front": "What is a **parallel circuit**?",
          "back": "A circuit where components are connected across the same two points, creating multiple paths for the current."
        },
        {
          "front": "In a parallel circuit, what is constant?",
          "back": "The voltage is the same across all components."
        },
        {
          "front": "What is **electric power**?",
          "back": "The rate at which electric energy is consumed or generated."
        },
        {
          "front": "What is the formula for electric power?",
          "back": "$$P = IV$$"
        },
        {
          "front": "What is a **magnet**?",
          "back": "An object that produces a magnetic field and has a North and a South pole."
        },
        {
          "front": "What is a **magnetic field**?",
          "back": "A region around a magnet or a moving electric charge in which magnetic forces are present."
        },
        {
          "front": "How do magnetic field lines flow?",
          "back": "They flow from the North pole to the South pole outside the magnet."
        },
        {
          "front": "What is the relationship between electricity and magnetism?",
          "back": "Moving electric charges create magnetic fields, and changing magnetic fields create electric fields."
        },
        {
          "front": "What is **electromagnetic induction**?",
          "back": "The process of using a changing magnetic field to produce an electric current."
        },
        {
          "front": "What is the **Lorentz force**?",
          "back": "The force exerted on a moving charged particle in an electric and magnetic field."
        },
        {
          "front": "What is the formula for the magnetic force on a moving charge?",
          "back": "$$F = qvB\\sin\\theta$$"
        },
        {
          "front": "What is a **solenoid**?",
          "back": "A coil of wire that acts as an electromagnet when an electric current passes through it."
        },
        {
          "front": "What is a **generator**?",
          "back": "A device that converts mechanical energy into electrical energy using electromagnetic induction."
        },
        {
          "front": "What is a **motor**?",
          "back": "A device that converts electrical energy into mechanical energy."
        },
        {
          "front": "What does the **right-hand rule** predict for a moving charge in a magnetic field?",
          "back": "The direction of the magnetic force on the charge."
        },
        {
          "front": "What is the **magnetic flux**?",
          "back": "A measure of the total number of magnetic field lines passing through a given area."
        },
        {
          "front": "What is **Faraday's Law of Induction**?",
          "back": "The induced electromotive force (EMF) in a closed loop is equal to the negative of the rate of change of magnetic flux through the loop."
        },
        {
          "front": "How does a transformer work?",
          "back": "It uses electromagnetic induction to change the voltage of an alternating current."
        },
        {
          "front": "What is the difference between a step-up and a step-down transformer?",
          "back": "A step-up transformer increases voltage, while a step-down transformer decreases it."
        },
        {
          "front": "What is **AC (alternating current)**?",
          "back": "Electric current that periodically reverses direction."
        },
        {
          "front": "What is **DC (direct current)**?",
          "back": "Electric current that flows in a single direction."
        },
        {
          "front": "What is a **semiconductor**?",
          "back": "A material that has an electrical conductivity between that of a conductor and an insulator."
        },
        {
          "front": "What is **superconductivity**?",
          "back": "The property of certain materials to conduct electric current with zero resistance below a certain temperature."
        },
        {
          "front": "What is the relationship between electric current and a magnetic field?",
          "back": "An electric current produces a magnetic field around the conductor."
        }
      ]
    }
  ]
}
