{
  "flashcards": [
    {
      "category": "Energy & Power",
      "cards": [
        {
          "front": "What is **work** in physics?",
          "back": "The energy transferred to or from an object via the application of force along a displacement."
        },
        {
          "front": "What is the formula for work?",
          "back": "$$W = Fd\\cos\\theta$$"
        },
        {
          "front": "When is **work** done?",
          "back": "When a force causes a displacement, and the force has a component in the direction of the displacement."
        },
        {
          "front": "What is the unit of work?",
          "back": "The Joule (J)."
        },
        {
          "front": "What is the **work-energy theorem**?",
          "back": "The net work done on an object is equal to its change in kinetic energy ($$W_{net} = \\Delta E_k$$)."
        },
        {
          "front": "What is **energy**?",
          "back": "The ability to do work."
        },
        {
          "front": "What is **kinetic energy**?",
          "back": "The energy of motion."
        },
        {
          "front": "What is the formula for kinetic energy?",
          "back": "$$E_k = \\frac{1}{2}mv^2$$"
        },
        {
          "front": "What is **potential energy**?",
          "back": "Stored energy due to an object's position or configuration."
        },
        {
          "front": "What is **gravitational potential energy**?",
          "back": "Energy stored in an object due to its height in a gravitational field."
        },
        {
          "front": "What is the formula for gravitational potential energy?",
          "back": "$$E_p = mgh$$"
        },
        {
          "front": "What is **elastic potential energy**?",
          "back": "Energy stored in a deformed elastic object, like a stretched spring."
        },
        {
          "front": "What is the **Law of Conservation of Energy**?",
          "back": "Energy cannot be created or destroyed, only converted from one form to another."
        },
        {
          "front": "What is **mechanical energy**?",
          "back": "The sum of an object's kinetic and potential energy ($$ME = E_k + E_p$$)."
        },
        {
          "front": "What is **power**?",
          "back": "The rate at which work is done or energy is transferred."
        },
        {
          "front": "What is the formula for power?",
          "back": "$$P = \\frac{W}{t}$$"
        },
        {
          "front": "What is the unit of power?",
          "back": "The Watt (W)."
        },
        {
          "front": "What is another formula for power, in terms of force and velocity?",
          "back": "$$P = Fv$$"
        },
        {
          "front": "When is negative work done on an object?",
          "back": "When the force is applied in the direction opposite to the displacement (e.g., friction)."
        },
        {
          "front": "What is the kinetic energy of a stationary object?",
          "back": "Zero."
        },
        {
          "front": "What is the gravitational potential energy of an object at ground level?",
          "back": "Zero (assuming the ground is the reference height)."
        },
        {
          "front": "How does a car's kinetic energy change if its speed is doubled?",
          "back": "Its kinetic energy increases by a factor of four ($$E_k \\propto v^2$$)."
        },
        {
          "front": "What is the work done by the force of gravity on an object sliding horizontally?",
          "back": "Zero, because gravity is perpendicular to the displacement."
        },
        {
          "front": "If a person lifts a box from the floor to a table, what is the work done by the person?",
          "back": "Positive work, as the force and displacement are in the same direction."
        },
        {
          "front": "If a person lowers a box from a table to the floor, what is the work done by gravity?",
          "back": "Positive work, as the force and displacement are in the same direction (downward)."
        },
        {
          "front": "What is the work done by gravity on a satellite in a circular orbit around Earth?",
          "back": "Zero, because the gravitational force is perpendicular to the satellite's displacement."
        },
        {
          "front": "Why does the Law of Conservation of Energy appear to be violated when a moving object slows down?",
          "back": "The mechanical energy is converted into other forms, like thermal energy due to friction."
        },
        {
          "front": "What is the relationship between horsepower (hp) and watts (W)?",
          "back": "1 horsepower is equal to approximately 746 watts."
        },
        {
          "front": "What is **1 kilowatt-hour** a measure of?",
          "back": "Electric energy, commonly used for billing."
        },
        {
          "front": "What is the efficiency of a machine?",
          "back": "The ratio of useful work output to total energy input."
        },
        {
          "front": "Why is the efficiency of any real machine always less than 100%?",
          "back": "Because some energy is always converted to a non-useful form, like heat due to friction."
        },
        {
          "front": "If a machine does a lot of work in a short amount of time, is its power high or low?",
          "back": "High, because power is inversely proportional to time."
        },
        {
          "front": "A force is applied to a wall, but the wall does not move. How much work is done?",
          "back": "Zero, because there is no displacement."
        },
        {
          "front": "What happens to the kinetic and potential energy of a falling object (ignoring air resistance)?",
          "back": "Potential energy is converted into kinetic energy, but the total mechanical energy remains constant."
        },
        {
          "front": "In a swinging pendulum, where is the kinetic energy maximum?",
          "back": "At the lowest point of its swing."
        },
        {
          "front": "In a swinging pendulum, where is the gravitational potential energy maximum?",
          "back": "At the highest points of its swing."
        },
        {
          "front": "What is the **conservation of mechanical energy**?",
          "back": "In a system where only conservative forces (like gravity) are at work, the total mechanical energy remains constant."
        },
        {
          "front": "Why is work done on a spring a type of potential energy?",
          "back": "Because the work done to compress or stretch it is stored as elastic potential energy."
        },
        {
          "front": "What is the difference between positive and negative work?",
          "back": "Positive work increases an object's energy; negative work decreases an object's energy."
        },
        {
          "front": "What does a negative change in potential energy mean?",
          "back": "The potential energy has decreased, meaning the object has lost energy, usually converted to kinetic energy."
        }
      ]
    }
  ]
}
