{
  "flashcards": [
    {
      "category": "Fluid Mechanics",
      "cards": [
        {
          "front": "What is a **fluid**?",
          "back": "A substance that flows, such as a liquid or a gas."
        },
        {
          "front": "What is **density**?",
          "back": "The mass of a substance per unit volume."
        },
        {
          "front": "What is the formula for density?",
          "back": "$$\\rho = \\frac{m}{V}$$"
        },
        {
          "front": "What is **pressure**?",
          "back": "The force exerted per unit area."
        },
        {
          "front": "What is the formula for pressure?",
          "back": "$$P = \\frac{F}{A}$$"
        },
        {
          "front": "What is the SI unit of pressure?",
          "back": "The Pascal (Pa)."
        },
        {
          "front": "What is **atmospheric pressure**?",
          "back": "The pressure exerted by the weight of the air in the atmosphere."
        },
        {
          "front": "What does **Pascal's Principle** state?",
          "back": "A change in pressure applied to an enclosed fluid is transmitted undiminished to every portion of the fluid and to the walls of the container."
        },
        {
          "front": "What is **hydrostatic pressure**?",
          "back": "The pressure exerted by a fluid at rest due to the force of gravity."
        },
        {
          "front": "What is the formula for hydrostatic pressure?",
          "back": "$$P = \\rho gh$$"
        },
        {
          "front": "What does **Archimedes' Principle** state?",
          "back": "The buoyant force on an object is equal to the weight of the fluid it displaces."
        },
        {
          "front": "What is **buoyancy**?",
          "back": "The upward force exerted by a fluid that opposes the weight of an immersed object."
        },
        {
          "front": "What is the formula for buoyant force?",
          "back": "$$F_b = \\rho_{fluid} V_{displaced} g$$"
        },
        {
          "front": "Why does an object float?",
          "back": "Because the buoyant force is greater than or equal to the object's weight."
        },
        {
          "front": "Why does a steel ship float while a steel ball sinks?",
          "back": "The ship is hollow, so its average density is less than water. The ball's density is greater than water."
        },
        {
          "front": "What is a **streamline**?",
          "back": "The path a particle in a moving fluid follows."
        },
        {
          "front": "What is **turbulent flow**?",
          "back": "Irregular flow characterized by chaotic changes in pressure and flow speed."
        },
        {
          "front": "What does the **continuity equation** for an incompressible fluid state?",
          "back": "The product of the cross-sectional area and the flow speed is constant ($$A_1v_1 = A_2v_2$$)."
        },
        {
          "front": "What does the continuity equation imply for a fluid flowing through a constricted pipe?",
          "back": "The fluid must speed up in the narrow sections."
        },
        {
          "front": "What does **Bernoulli's Principle** state?",
          "back": "Where the velocity of a fluid is high, the pressure is low, and where the velocity is low, the pressure is high."
        },
        {
          "front": "What is the Bernoulli's Equation for an ideal fluid?",
          "back": "$$P_1 + \\frac{1}{2}\\rho v_1^2 + \\rho gh_1 = P_2 + \\frac{1}{2}\\rho v_2^2 + \\rho gh_2$$"
        },
        {
          "front": "What does Bernoulli's Principle explain?",
          "back": "Why an airplane wing generates lift."
        },
        {
          "front": "How does an airplane wing create lift?",
          "back": "The curved shape causes air to flow faster over the top surface, creating lower pressure there and a net upward force."
        },
        {
          "front": "What is **viscosity**?",
          "back": "A fluid's resistance to flow."
        },
        {
          "front": "Give an example of a fluid with high viscosity.",
          "back": "Honey."
        },
        {
          "front": "What is an **ideal fluid**?",
          "back": "A fluid with no viscosity, no turbulence, and that is incompressible."
        },
        {
          "front": "What is the unit of density?",
          "back": "Kilograms per cubic meter ($$kg/m^3$$)."
        },
        {
          "front": "How does pressure change with depth in a fluid?",
          "back": "Pressure increases linearly with depth."
        },
        {
          "front": "What is **surface tension**?",
          "back": "The property of the surface of a liquid that allows it to resist an external force due to the cohesive nature of its molecules."
        },
        {
          "front": "Why does a water strider walk on water?",
          "back": "Because its weight is supported by the surface tension of the water."
        },
        {
          "front": "What is the relationship between the forces in a hydraulic press?",
          "back": "The ratio of the forces equals the ratio of the piston areas ($$\\frac{F_1}{A_1} = \\frac{F_2}{A_2}$$)."
        },
        {
          "front": "If an object is suspended in a fluid, with a weight greater than the buoyant force, what happens?",
          "back": "It sinks."
        },
        {
          "front": "What happens to the buoyant force on a submerged object as it is lowered to a greater depth?",
          "back": "It remains the same, because the buoyant force depends on the volume of fluid displaced, not the depth."
        },
        {
          "front": "What is the difference between gauge pressure and absolute pressure?",
          "back": "Gauge pressure is relative to atmospheric pressure; absolute pressure includes atmospheric pressure."
        },
        {
          "front": "What is the principle behind a siphon?",
          "back": "The combination of pressure difference and gravity."
        },
        {
          "front": "What is **laminar flow**?",
          "back": "Smooth, orderly fluid flow in layers or sheets."
        },
        {
          "front": "Why does the water coming out of a faucet get thinner as it falls?",
          "back": "As it falls, it gains speed due to gravity. By the continuity equation, as velocity increases, the cross-sectional area must decrease."
        },
        {
          "front": "What happens to the pressure of a fluid when its speed increases?",
          "back": "Its pressure decreases."
        },
        {
          "front": "What is the difference between a liquid and a gas?",
          "back": "A liquid has a fixed volume but can change shape; a gas has no fixed shape or volume."
        },
        {
          "front": "What is the role of viscosity in a fluid's motion?",
          "back": "It resists the fluid's motion, converting kinetic energy into thermal energy."
        }
      ]
    }
  ]
}
