{
  "flashcards": [
    {
      "category": "Advanced Kinematics",
      "cards": [
        {
          "front": "What is the difference between a **scalar** and a **vector** quantity?",
          "back": "A scalar has magnitude only; a vector has both magnitude and direction."
        },
        {
          "front": "Is **distance** a scalar or a vector?",
          "back": "Scalar."
        },
        {
          "front": "Is **displacement** a scalar or a vector?",
          "back": "Vector."
        },
        {
          "front": "Is **speed** a scalar or a vector?",
          "back": "Scalar."
        },
        {
          "front": "Is **velocity** a scalar or a vector?",
          "back": "Vector."
        },
        {
          "front": "Is **acceleration** a scalar or a vector?",
          "back": "Vector."
        },
        {
          "front": "What is the formula for the final velocity of an object with uniform acceleration?",
          "back": "$$v_f = v_i + at$$"
        },
        {
          "front": "What is the formula for the displacement of an object with uniform acceleration?",
          "back": "$$\\Delta d = v_i t + \\frac{1}{2}at^2$$"
        },
        {
          "front": "What is the 'timeless' kinematic equation?",
          "back": "$$v_f^2 = v_i^2 + 2a\\Delta d$$"
        },
        {
          "front": "What is the formula for displacement using average velocity?",
          "back": "$$\\Delta d = \\frac{1}{2}(v_i + v_f)t$$"
        },
        {
          "front": "What is **free-fall**?",
          "back": "The motion of an object solely under the influence of gravity, with no air resistance."
        },
        {
          "front": "What is the value of acceleration due to gravity on Earth?",
          "back": "$$g \\approx 9.8\\text{ m/s²}$$"
        },
        {
          "front": "What is the acceleration of a projectile at its highest point?",
          "back": "$$9.8\\text{ m/s²}$$ downward."
        },
        {
          "front": "What is the horizontal acceleration of a projectile (ignoring air resistance)?",
          "back": "Zero."
        },
        {
          "front": "What is a **projectile**?",
          "back": "An object that is thrown or launched into the air and is subject only to the force of gravity."
        },
        {
          "front": "How does the time it takes for an object to fall from a height compare to an identical object thrown horizontally from the same height?",
          "back": "The time is the same, as the vertical motion is independent of the horizontal motion."
        },
        {
          "front": "What is the slope of a **position-time graph**?",
          "back": "Velocity."
        },
        {
          "front": "What does a horizontal line on a position-time graph represent?",
          "back": "An object at rest (zero velocity)."
        },
        {
          "front": "What does a straight, sloped line on a position-time graph represent?",
          "back": "Constant velocity."
        },
        {
          "front": "What is the slope of a **velocity-time graph**?",
          "back": "Acceleration."
        },
        {
          "front": "What does a horizontal line on a velocity-time graph represent?",
          "back": "Constant velocity (zero acceleration)."
        },
        {
          "front": "What does a straight, sloped line on a velocity-time graph represent?",
          "back": "Constant acceleration."
        },
        {
          "front": "What is the area under a **velocity-time graph**?",
          "back": "Displacement."
        },
        {
          "front": "What is the area under an **acceleration-time graph**?",
          "back": "Change in velocity."
        },
        {
          "front": "What is **terminal velocity**?",
          "back": "The constant speed that a freely falling object eventually reaches when the resistance of the medium (air) prevents further acceleration."
        },
        {
          "front": "What is **uniform acceleration**?",
          "back": "A constant rate of change of velocity."
        },
        {
          "front": "What is the **trajectory** of a projectile?",
          "back": "The path that the projectile follows, which is a parabola."
        },
        {
          "front": "What is the **range** of a projectile?",
          "back": "The total horizontal distance traveled by the projectile."
        },
        {
          "front": "What is **relative velocity**?",
          "back": "The velocity of an object with respect to another object or frame of reference."
        },
        {
          "front": "If a car is traveling at $$100\\text{ km/h}$$ and a truck is traveling at $$80\\text{ km/h}$$ in the same direction, what is the car's speed relative to the truck?",
          "back": "$$20\\text{ km/h}$$"
        },
        {
          "front": "What is the vertical velocity of a projectile at its maximum height?",
          "back": "Zero."
        },
        {
          "front": "What is the horizontal velocity of a projectile at its maximum height?",
          "back": "It is constant and equal to its initial horizontal velocity."
        },
        {
          "front": "What is the significance of the sign (+/-) in kinematic quantities?",
          "back": "It indicates the direction of the vector."
        },
        {
          "front": "What is the difference between instantaneous and average velocity?",
          "back": "Instantaneous velocity is at a specific moment in time; average velocity is over a time interval."
        },
        {
          "front": "When can the kinematic equations be used?",
          "back": "Only when the acceleration is uniform (constant)."
        },
        {
          "front": "What is the shape of a position-time graph for an object with constant acceleration?",
          "back": "A parabola (a curved line)."
        },
        {
          "front": "What does the initial velocity ($$v_i$$) represent in a free-fall problem?",
          "back": "The velocity at the moment the object begins to fall (often zero)."
        },
        {
          "front": "In a kinematic problem, why is the negative sign for acceleration crucial?",
          "back": "It indicates that the object is slowing down or accelerating in the opposite direction."
        },
        {
          "front": "What is the relationship between the time to reach the peak and the total flight time for a projectile launched and landing at the same height?",
          "back": "The time to the peak is exactly half of the total flight time."
        },
        {
          "front": "What is a **frame of reference**?",
          "back": "A system of coordinates used to describe the position and motion of an object."
        }
      ]
    }
  ]
}