{
  "flashcards": [
    {
      "category": "Introduction to Modern Physics",
      "cards": [
        {
          "front": "What is the key difference between **classical physics** and **modern physics**?",
          "back": "Classical physics describes macroscopic objects and low speeds, while modern physics explains the universe at very high speeds and on an atomic or subatomic scale."
        },
        {
          "front": "What does **Relativity** address?",
          "back": "The relationship between mass, energy, space, and time, especially for objects moving at speeds close to the speed of light."
        },
        {
          "front": "Who is the primary figure associated with Relativity?",
          "back": "Albert Einstein."
        },
        {
          "front": "What is **time dilation**?",
          "back": "The phenomenon where time passes more slowly for an object in motion relative to a stationary observer."
        },
        {
          "front": "What is **length contraction**?",
          "back": "The phenomenon where an object's length appears shorter in the direction of motion relative to a stationary observer."
        },
        {
          "front": "What does the equation $$E=mc^2$$ mean?",
          "back": "It describes the equivalence of mass and energy. A small amount of mass can be converted into a very large amount of energy, and vice versa."
        },
        {
          "front": "What does **Quantum Mechanics** address?",
          "back": "The physics of the very small, dealing with the behavior of particles at the atomic and subatomic levels."
        },
        {
          "front": "What is a **quantum**?",
          "back": "A discrete, indivisible packet of energy or other physical property."
        },
        {
          "front": "What is the **photoelectric effect**?",
          "back": "The emission of electrons from a metal when light is shined on it."
        },
        {
          "front": "How does the photoelectric effect support the idea that light is a particle?",
          "back": "It shows that light is made of discrete packets of energy called photons. An electron is emitted only if a photon has enough energy to knock it loose."
        },
        {
          "front": "What is the formula for the energy of a photon?",
          "back": "$$E = hf$$ where $$h$$ is Planck's constant and $$f$$ is frequency."
        },
        {
          "front": "What does the **de Broglie hypothesis** state?",
          "back": "All particles, like electrons and protons, have wave-like properties. Their wavelength is related to their momentum ($$\\lambda = \\frac{h}{p}$$)."
        },
        {
          "front": "What is **wave-particle duality**?",
          "back": "The concept that every particle or quantum entity may be described as either a particle or a wave."
        },
        {
          "front": "What does the **Heisenberg Uncertainty Principle** state?",
          "back": "It is impossible to simultaneously know both the exact position and the exact momentum of a particle with perfect accuracy."
        },
        {
          "front": "What did the **Bohr Model of the atom** propose?",
          "back": "That electrons can only exist in specific, discrete orbits or energy levels around the nucleus."
        },
        {
          "front": "How did the Bohr model explain the stability of atoms?",
          "back": "It proposed that electrons in these specific energy levels do not lose energy by radiating light."
        },
        {
          "front": "What is a **blackbody**?",
          "back": "An idealized object that absorbs all electromagnetic radiation that falls on it and emits thermal radiation."
        },
        {
          "front": "How did Max Planck's work on blackbody radiation lay the foundation for quantum mechanics?",
          "back": "He proposed that energy is quantized, meaning it can only be emitted or absorbed in discrete packets."
        },
        {
          "front": "What is the **strong nuclear force**?",
          "back": "The force that binds protons and neutrons together in the nucleus of an atom."
        },
        {
          "front": "What is the **weak nuclear force**?",
          "back": "A fundamental force involved in radioactive decay."
        },
        {
          "front": "What does **nuclear fusion** involve?",
          "back": "The process by which two or more light atomic nuclei fuse together to form a single, heavier nucleus."
        },
        {
          "front": "What does **nuclear fission** involve?",
          "back": "The process by which a large atomic nucleus splits into smaller nuclei, releasing a large amount of energy."
        },
        {
          "front": "What is a **chain reaction**?",
          "back": "A self-sustaining process in which one fission event triggers additional fission events."
        },
        {
          "front": "What is a **photon**?",
          "back": "A quantum of light and other forms of electromagnetic radiation."
        },
        {
          "front": "How are photons and electrons different?",
          "back": "A photon is a massless particle of light, while an electron is a particle of matter with mass."
        },
        {
          "front": "What is the **Standard Model** of particle physics?",
          "back": "A theory that describes the fundamental particles and forces of the universe."
        },
        {
          "front": "What is an **elementary particle**?",
          "back": "A particle that has no known substructure."
        },
        {
          "front": "What are the two major classes of particles in the Standard Model?",
          "back": "Fermions and Bosons."
        },
        {
          "front": "What is a **fermion**?",
          "back": "A type of particle that makes up matter, such as quarks and leptons (e.g., electrons)."
        },
        {
          "front": "What is a **boson**?",
          "back": "A type of particle that mediates forces, such as photons and gluons."
        },
        {
          "front": "How does Einstein's General Relativity differ from Special Relativity?",
          "back": "General Relativity extends the theory to include gravity and accelerated reference frames, describing gravity as a curvature of spacetime."
        },
        {
          "front": "What is the **Pauli Exclusion Principle**?",
          "back": "No two identical fermions can occupy the same quantum state simultaneously."
        },
        {
          "front": "What is the **Schrödinger Equation**?",
          "back": "A fundamental equation in quantum mechanics that describes the wave function of a quantum system over time."
        },
        {
          "front": "What is a **wave function**?",
          "back": "A mathematical function that describes the quantum state of a particle or system."
        },
        {
          "front": "What is the probability of finding a particle in a certain region according to quantum mechanics?",
          "back": "The probability is proportional to the square of the magnitude of the wave function in that region."
        },
        {
          "front": "What is a **semiconductor**?",
          "back": "A material with electrical conductivity between that of a conductor and an insulator, a key component in modern electronics."
        },
        {
          "front": "What is the difference between a conductor and an insulator?",
          "back": "A conductor has freely moving electrons that can easily carry a current, while an insulator's electrons are tightly bound."
        },
        {
          "front": "What is the difference between nuclear fission and fusion in terms of energy release?",
          "back": "Both processes release immense energy, but fission releases energy by splitting large atoms, while fusion releases energy by combining small atoms."
        },
        {
          "front": "What is **radioactive decay**?",
          "back": "The process by which an unstable atomic nucleus loses energy by emitting radiation."
        },
        {
          "front": "What is the **half-life** of a radioactive isotope?",
          "back": "The time it takes for half of the radioactive atoms in a sample to decay."
        }
      ]
    }
  ]
}
