{
  "flashcards": [
    {
      "category": "Momentum & Impulse",
      "cards": [
        {
          "front": "What is **momentum**?",
          "back": "A measure of the mass in motion. It is the product of an object's mass and its velocity."
        },
        {
          "front": "What is the formula for momentum?",
          "back": "$$p = mv$$"
        },
        {
          "front": "What is the unit of momentum?",
          "back": "Kilogram-meter per second ($$kg \\cdot m/s$$)."
        },
        {
          "front": "Is momentum a scalar or a vector quantity?",
          "back": "A vector, because it has both magnitude and direction."
        },
        {
          "front": "What is **impulse**?",
          "back": "The product of the average net force on an object and the time interval over which the force acts."
        },
        {
          "front": "What is the formula for impulse?",
          "back": "$$J = F\\Delta t$$"
        },
        {
          "front": "What is the unit of impulse?",
          "back": "Newton-second ($$N \\cdot s$$)."
        },
        {
          "front": "What does the **Impulse-Momentum Theorem** state?",
          "back": "The impulse on an object equals its change in momentum ($$J = \\Delta p$$)."
        },
        {
          "front": "What is the **Law of Conservation of Momentum**?",
          "back": "The total momentum of an isolated system remains constant."
        },
        {
          "front": "What is an **isolated system**?",
          "back": "A system on which no net external force acts."
        },
        {
          "front": "What is a perfectly **elastic collision**?",
          "back": "A collision in which both momentum and kinetic energy are conserved."
        },
        {
          "front": "What is a perfectly **inelastic collision**?",
          "back": "A collision in which the objects stick together and move as one. Momentum is conserved, but kinetic energy is not."
        },
        {
          "front": "In a collision, if objects bounce off each other, is it likely elastic or inelastic?",
          "back": "Elastic."
        },
        {
          "front": "In a collision, if objects stick together, is it likely elastic or inelastic?",
          "back": "Inelastic."
        },
        {
          "front": "Why do airbags and crumple zones save lives in a car crash?",
          "back": "They increase the time of impact, which reduces the force on the occupants, as $$F = \\frac{\\Delta p}{\\Delta t}$$."
        },
        {
          "front": "A force is applied to an object for a short time vs. a long time. Which produces a greater change in momentum?",
          "back": "A longer time, as change in momentum is directly proportional to the time of force application ($$\\Delta p = F\\Delta t$$)."
        },
        {
          "front": "If two objects collide, is the force they exert on each other equal and opposite?",
          "back": "Yes, according to Newton's Third Law of Motion."
        },
        {
          "front": "A person fires a rifle. The momentum of the bullet is equal and opposite to what?",
          "back": "The momentum of the rifle's recoil."
        },
        {
          "front": "If a bowling ball and a tennis ball have the same momentum, which has the greater velocity?",
          "back": "The tennis ball, since its mass is smaller and $$p=mv$$."
        },
        {
          "front": "What is a **recoil**?",
          "back": "The backward motion of an object after a forward push, like a gun firing a bullet."
        },
        {
          "front": "In an explosion, what is the total momentum of the fragments immediately after the explosion?",
          "back": "The same as the total momentum of the system before the explosion."
        },
        {
          "front": "How can you determine the final velocity of an object after a perfectly inelastic collision?",
          "back": "By setting the initial total momentum equal to the final total momentum: $$m_1v_1 + m_2v_2 = (m_1 + m_2)v_f$$."
        },
        {
          "front": "Why is kinetic energy not conserved in an inelastic collision?",
          "back": "Energy is converted to other forms, such as heat, sound, or deformation of the objects."
        },
        {
          "front": "A karate chop can break a brick. What physics principle is being applied?",
          "back": "A large force is delivered over a very short time, which results in a large impulse and a rapid change in momentum."
        },
        {
          "front": "Is momentum conserved in an explosion?",
          "back": "Yes, assuming the system is isolated."
        },
        {
          "front": "What is the relationship between force and the rate of change of momentum?",
          "back": "According to Newton's Second Law, force is equal to the rate of change of momentum ($$F = \\frac{\\Delta p}{\\Delta t}$$)."
        },
        {
          "front": "A small object and a large object have the same kinetic energy. Which has a greater momentum?",
          "back": "The larger object."
        },
        {
          "front": "A small object and a large object have the same momentum. Which has a greater kinetic energy?",
          "back": "The smaller object."
        },
        {
          "front": "What is the difference between a collision and an explosion?",
          "back": "In a collision, objects come together. In an explosion, an object breaks apart."
        },
        {
          "front": "A person pushes on a box. If the box moves, what can you say about the impulse on the person?",
          "back": "It is equal in magnitude and opposite in direction to the impulse on the box."
        },
        {
          "front": "Why do athletes land on soft surfaces like foam when jumping?",
          "back": "The soft surface increases the time of impact, reducing the force on their body."
        },
        {
          "front": "A baseball player follows through with a swing. What effect does this have on the impulse?",
          "back": "It increases the time of impact, which increases the impulse and thus the final momentum of the ball."
        },
        {
          "front": "What is the momentum of a stationary object?",
          "back": "Zero."
        },
        {
          "front": "What is the change in momentum of an object that is thrown and then caught?",
          "back": "The initial momentum minus the final momentum, which would be a large negative value."
        },
        {
          "front": "A system of two billiard balls collides. What can you say about their total momentum?",
          "back": "It remains constant (conserved) before and after the collision."
        },
        {
          "front": "Is momentum a vector or scalar? How does that affect calculations?",
          "back": "It's a vector. Direction must be taken into account using positive and negative signs."
        },
        {
          "front": "What does a zero net external force on a system imply about its momentum?",
          "back": "That the total momentum of the system is conserved."
        },
        {
          "front": "A hockey puck is gliding across frictionless ice. Is its momentum conserved?",
          "back": "Yes, because there is no net external force acting on it."
        },
        {
          "front": "In a 'perfectly' elastic collision, what happens to the total kinetic energy of the system?",
          "back": "It remains constant."
        },
        {
          "front": "What is the unit equivalence of the Impulse-Momentum Theorem?",
          "back": "$$N \\cdot s = kg \\cdot m/s$$"
        }
      ]
    }
  ]
}
