{
  "flashcards": [
    {
      "category": "Newton's Laws Applications",
      "cards": [
        {
          "front": "What does **Newton's First Law of Motion** state?",
          "back": "An object in motion stays in motion with the same velocity, and an object at rest stays at rest, unless acted upon by an external net force."
        },
        {
          "front": "What is **inertia**?",
          "back": "The tendency of an object to resist changes in its state of motion."
        },
        {
          "front": "What property of an object is a measure of its inertia?",
          "back": "Mass."
        },
        {
          "front": "What does **Newton's Second Law of Motion** state?",
          "back": "The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass."
        },
        {
          "front": "What is the formula for Newton's Second Law?",
          "back": "$$F_{net} = ma$$"
        },
        {
          "front": "What is **Newton's Third Law of Motion**?",
          "back": "For every action, there is an equal and opposite reaction."
        },
        {
          "front": "What is the unit of force?",
          "back": "The Newton (N)."
        },
        {
          "front": "What is the relationship between **mass** and **weight**?",
          "back": "Mass is a measure of inertia, while weight is the gravitational force acting on an object ($$W = mg$$)."
        },
        {
          "front": "What is a **free-body diagram**?",
          "back": "A diagram showing a single object isolated from its surroundings with all external forces acting on it represented by vectors."
        },
        {
          "front": "What is **net force**?",
          "back": "The vector sum of all forces acting on an object."
        },
        {
          "front": "What does it mean for an object to be in **equilibrium**?",
          "back": "The net force acting on the object is zero, so it has zero acceleration."
        },
        {
          "front": "What is **normal force**?",
          "back": "The force exerted by a surface on an object in contact with it, acting perpendicular to the surface."
        },
        {
          "front": "What is **tension**?",
          "back": "The force exerted by a string, rope, or cable when it is pulled taut."
        },
        {
          "front": "What is the force of **friction**?",
          "back": "A force that opposes motion or attempted motion between two surfaces in contact."
        },
        {
          "front": "What is the difference between **static** and **kinetic friction**?",
          "back": "Static friction prevents an object from starting to move, while kinetic friction acts on a moving object."
        },
        {
          "front": "How does the force of friction depend on the normal force?",
          "back": "Friction is directly proportional to the normal force ($$f = \\mu N$$)."
        },
        {
          "front": "In a horizontal push, if friction is the only opposing force, what is the net force?",
          "back": "$$F_{net} = F_{push} - F_{friction}$$"
        },
        {
          "front": "When an object is in free fall, what is its net force (ignoring air resistance)?",
          "back": "$$F_{net} = mg$$ (its weight)."
        },
        {
          "front": "What is the acceleration of a falling object when it reaches terminal velocity?",
          "back": "Zero."
        },
        {
          "front": "Why is the normal force on a box on a horizontal surface equal to its weight?",
          "back": "Because there is no vertical acceleration, the upward normal force must balance the downward gravitational force."
        },
        {
          "front": "What is the force of gravity on a $$10\\text{ kg}$$ object on Earth?",
          "back": "$$W = mg = (10)(9.8) = 98\\text{ N}$$."
        },
        {
          "front": "When you push on a wall, what is the reaction force?",
          "back": "The wall pushing back on you with an equal and opposite force."
        },
        {
          "front": "Do action-reaction pairs act on the same object?",
          "back": "No, they act on different objects."
        },
        {
          "front": "Why does an object accelerate if the action-reaction forces are equal and opposite?",
          "back": "Because the forces in the pair act on *different* objects. The acceleration of an object depends on the net force *on that object*."
        },
        {
          "front": "An elevator is moving up at a constant velocity. What is the net force on the elevator?",
          "back": "Zero."
        },
        {
          "front": "An elevator is accelerating upward. How does the tension in the cable compare to the elevator's weight?",
          "back": "The tension is greater than the weight."
        },
        {
          "front": "An elevator is accelerating downward. How does the tension in the cable compare to the elevator's weight?",
          "back": "The tension is less than the weight."
        },
        {
          "front": "A person in an accelerating elevator feels a different apparent weight. What is this 'apparent weight'?",
          "back": "The normal force acting on the person."
        },
        {
          "front": "If a rocket pushes hot gas downward, what is the reaction force?",
          "back": "The gas pushing the rocket upward (thrust)."
        },
        {
          "front": "What is the formula relating friction, the coefficient of friction, and the normal force?",
          "back": "$$f = \\mu N$$"
        },
        {
          "front": "What is a **coefficient of friction**?",
          "back": "A dimensionless number representing the ratio of the friction force to the normal force between two surfaces."
        },
        {
          "front": "Why is it often harder to start pushing an object than to keep it moving?",
          "back": "Because the coefficient of static friction is usually greater than the coefficient of kinetic friction."
        },
        {
          "front": "An object is pulled at a constant velocity. What can you say about the applied force and the friction force?",
          "back": "They are equal in magnitude and opposite in direction."
        },
        {
          "front": "If an object is pushed with a force and it accelerates, what is the net force?",
          "back": "$$F_{net} = F_{push} - F_{friction}$$"
        },
        {
          "front": "What is the difference between an object's weight on Earth and its weight on the Moon?",
          "back": "Its weight will be less on the Moon due to the weaker gravitational pull, but its mass will remain the same."
        },
        {
          "front": "What is a **newton** defined as?",
          "back": "$$1\\text{ kg} \\cdot \\text{m/s}^2$$"
        },
        {
          "front": "A rope is pulled by two people with equal and opposite forces. What is the tension in the rope?",
          "back": "The tension is equal to the force exerted by one person."
        },
        {
          "front": "When a car skids to a stop, which type of friction is acting on it?",
          "back": "Kinetic friction."
        },
        {
          "front": "What is the purpose of drawing a free-body diagram?",
          "back": "To visualize all the forces on a single object to help calculate the net force and acceleration."
        },
        {
          "front": "What is the normal force on a book sitting on a table in an elevator accelerating upwards?",
          "back": "Greater than the book's weight ($$N = mg + ma$$)."
        }
      ]
    }
  ]
}
