{
  "flashcards": [
    {
      "category": "Oscillations & Waves",
      "cards": [
        {
          "front": "What is **simple harmonic motion (SHM)**?",
          "back": "A type of periodic motion where the restoring force is directly proportional to the displacement and acts in the opposite direction."
        },
        {
          "front": "What is **Hooke's Law**?",
          "back": "The force exerted by a spring is directly proportional to its displacement from equilibrium ($$F = -kx$$)."
        },
        {
          "front": "What is the **equilibrium position** in SHM?",
          "back": "The position where the net force on the oscillating object is zero."
        },
        {
          "front": "What is the **amplitude** of an oscillation?",
          "back": "The maximum displacement or distance moved by a point on a vibrating body or wave measured from its equilibrium position."
        },
        {
          "front": "What is the **period** of an oscillation?",
          "back": "The time it takes for one complete cycle of motion."
        },
        {
          "front": "What is the **frequency** of an oscillation?",
          "back": "The number of cycles per unit of time."
        },
        {
          "front": "What is the relationship between period and frequency?",
          "back": "They are inversely related: $$f = \\frac{1}{T}$$."
        },
        {
          "front": "Where is the velocity of an oscillator at its maximum in SHM?",
          "back": "At the equilibrium position."
        },
        {
          "front": "Where is the velocity of an oscillator at its minimum (zero) in SHM?",
          "back": "At the points of maximum displacement (amplitude)."
        },
        {
          "front": "Where is the restoring force at its maximum in SHM?",
          "back": "At the points of maximum displacement (amplitude)."
        },
        {
          "front": "What is a **wave**?",
          "back": "A disturbance that transfers energy through a medium or a vacuum."
        },
        {
          "front": "What is a **medium**?",
          "back": "The substance through which a wave travels."
        },
        {
          "front": "What is the difference between a mechanical wave and an electromagnetic wave?",
          "back": "A mechanical wave requires a medium to travel (e.g., sound), while an electromagnetic wave does not (e.g., light)."
        },
        {
          "front": "What is a **transverse wave**?",
          "back": "A wave in which the particles of the medium vibrate perpendicular to the direction of wave propagation."
        },
        {
          "front": "What is a **longitudinal wave**?",
          "back": "A wave in which the particles of the medium vibrate parallel to the direction of wave propagation."
        },
        {
          "front": "Give an example of a transverse wave.",
          "back": "Light waves or waves on a string."
        },
        {
          "front": "Give an example of a longitudinal wave.",
          "back": "Sound waves."
        },
        {
          "front": "What is the **wavelength** ($$\\lambda$$)?",
          "back": "The distance between two consecutive identical points on a wave, such as two crests or two troughs."
        },
        {
          "front": "What is the relationship between wave speed, frequency, and wavelength?",
          "back": "Wave speed equals frequency times wavelength ($$v = f\\lambda$$)."
        },
        {
          "front": "What is a **crests** and a **trough**?",
          "back": "The crest is the highest point of a transverse wave; the trough is the lowest point."
        },
        {
          "front": "What is **reflection**?",
          "back": "The bouncing back of a wave when it hits a boundary."
        },
        {
          "front": "What is **refraction**?",
          "back": "The bending of a wave as it passes from one medium to another."
        },
        {
          "front": "What is **diffraction**?",
          "back": "The bending of a wave as it passes through an opening or around an obstacle."
        },
        {
          "front": "What is the **principle of superposition**?",
          "back": "When two or more waves meet, the resulting disturbance is the vector sum of the individual disturbances."
        },
        {
          "front": "What is **constructive interference**?",
          "back": "When two waves combine to form a wave with a larger amplitude."
        },
        {
          "front": "What is **destructive interference**?",
          "back": "When two waves combine to form a wave with a smaller or zero amplitude."
        },
        {
          "front": "What are **nodes** and **antinodes**?",
          "back": "Nodes are points of zero amplitude in a standing wave; antinodes are points of maximum amplitude."
        },
        {
          "front": "What is a **standing wave**?",
          "back": "A wave that appears to stand still, created by the interference of two waves traveling in opposite directions."
        },
        {
          "front": "What is the relationship between the period and frequency of a wave?",
          "back": "They are inversely proportional ($$T = \\frac{1}{f}$$)."
        },
        {
          "front": "How does the speed of sound change in different mediums?",
          "back": "It is fastest in solids, slower in liquids, and slowest in gases."
        },
        {
          "front": "What determines the pitch of a sound?",
          "back": "The frequency of the sound wave."
        },
        {
          "front": "What determines the loudness of a sound?",
          "back": "The amplitude of the sound wave."
        },
        {
          "front": "What is a **seismic wave**?",
          "back": "An elastic wave in the Earth produced by an earthquake or other means."
        },
        {
          "front": "What happens to a wave's frequency when it travels from one medium to another?",
          "back": "Its frequency remains unchanged."
        },
        {
          "front": "What happens to a wave's speed and wavelength when it travels from one medium to another?",
          "back": "They both change."
        },
        {
          "front": "What is the relationship between potential and kinetic energy in SHM?",
          "back": "When potential energy is maximum, kinetic energy is zero, and vice versa."
        },
        {
          "front": "Where is the potential energy of a pendulum at its maximum?",
          "back": "At the highest points of its swing."
        },
        {
          "front": "Where is the kinetic energy of a pendulum at its maximum?",
          "back": "At the lowest point of its swing."
        },
        {
          "front": "What is the **Doppler Effect**?",
          "back": "The apparent change in the frequency of a wave due to the relative motion between the source and the observer."
        },
        {
          "front": "What is the **Doppler effect** for a source moving towards an observer?",
          "back": "The observer detects a higher frequency."
        }
      ]
    }
  ]
}
