{
  "flashcards": [
    {
      "category": "Thermodynamics",
      "cards": [
        {
          "front": "What is **thermodynamics**?",
          "back": "The branch of physics that deals with heat, work, and temperature, and their relation to energy, radiation, and the physical properties of matter."
        },
        {
          "front": "What is the **Zeroth Law of Thermodynamics**?",
          "back": "If two systems are in thermal equilibrium with a third system, then they are in thermal equilibrium with each other."
        },
        {
          "front": "What is **temperature**?",
          "back": "A measure of the average kinetic energy of the particles in a substance."
        },
        {
          "front": "What is **heat**?",
          "back": "The transfer of thermal energy from one system to another due to a temperature difference."
        },
        {
          "front": "What are the three methods of **heat transfer**?",
          "back": "Conduction, convection, and radiation."
        },
        {
          "front": "What is **conduction**?",
          "back": "Heat transfer through direct contact, without the movement of the material itself."
        },
        {
          "front": "What is **convection**?",
          "back": "Heat transfer through the movement of fluids (liquids or gases)."
        },
        {
          "front": "What is **radiation**?",
          "back": "Heat transfer through electromagnetic waves, which can occur through a vacuum."
        },
        {
          "front": "What is **internal energy**?",
          "back": "The total energy of all the particles within a substance, including both kinetic and potential energy."
        },
        {
          "front": "What is the **First Law of Thermodynamics**?",
          "back": "The change in a system's internal energy is equal to the heat added to the system minus the work done by the system ($$\\Delta U = Q - W$$)."
        },
        {
          "front": "What is the symbol for heat added to a system?",
          "back": "$$Q$$"
        },
        {
          "front": "What is the symbol for work done by a system?",
          "back": "$$W$$"
        },
        {
          "front": "What is **specific heat capacity**?",
          "back": "The amount of heat energy required to raise the temperature of a unit mass of a substance by one degree Celsius."
        },
        {
          "front": "What is the formula for heat absorbed or released during a temperature change?",
          "back": "$$Q = mc\\Delta T$$"
        },
        {
          "front": "What is **latent heat**?",
          "back": "The energy absorbed or released during a phase change without a change in temperature."
        },
        {
          "front": "What is **latent heat of fusion**?",
          "back": "The energy required to change a substance from a solid to a liquid at its melting point."
        },
        {
          "front": "What is **latent heat of vaporization**?",
          "back": "The energy required to change a substance from a liquid to a gas at its boiling point."
        },
        {
          "front": "What is **entropy**?",
          "back": "A measure of the disorder or randomness in a system."
        },
        {
          "front": "What is the **Second Law of Thermodynamics**?",
          "back": "The total entropy of an isolated system can only increase over time."
        },
        {
          "front": "What is the Kelvin-Planck statement of the Second Law of Thermodynamics?",
          "back": "It is impossible to create a heat engine that operates in a cycle and converts all heat into work."
        },
        {
          "front": "What is a **heat engine**?",
          "back": "A device that converts thermal energy into mechanical work."
        },
        {
          "front": "What is the **Third Law of Thermodynamics**?",
          "back": "The entropy of a system approaches a constant value as the temperature approaches absolute zero."
        },
        {
          "front": "What is **absolute zero**?",
          "back": "The theoretical temperature at which all particle motion ceases ($$0\\text{ K}$$ or $$-273.15°\\text{C}$$)."
        },
        {
          "front": "How does a refrigerator work?",
          "back": "It transfers heat from a cold reservoir (inside) to a hot reservoir (outside) using work."
        },
        {
          "front": "What is the formula for the efficiency of a heat engine?",
          "back": "$$\\text{Efficiency} = \\frac{W}{Q_H}$$"
        },
        {
          "front": "What is **Carnot efficiency**?",
          "back": "The maximum possible efficiency for a heat engine operating between two temperatures."
        },
        {
          "front": "What is the formula for Carnot efficiency?",
          "back": "$$\\text{Efficiency}_{Carnot} = 1 - \\frac{T_C}{T_H}$$ where T is in Kelvin."
        },
        {
          "front": "Does a substance's temperature change during a phase change?",
          "back": "No, the added energy is used to break intermolecular bonds."
        },
        {
          "front": "Why does sweat cool the human body?",
          "back": "When sweat evaporates (phase change), it absorbs latent heat of vaporization from the body, cooling it down."
        },
        {
          "front": "If work is done on a system, is $$W$$ in the First Law of Thermodynamics positive or negative?",
          "back": "Negative. The work is done on the system, not by it, so $$W$$ is negative."
        },
        {
          "front": "Why is a good radiator of heat also a good absorber?",
          "back": "According to the principles of radiation, a surface that emits radiation efficiently also absorbs it efficiently."
        },
        {
          "front": "What is the specific heat capacity of water?",
          "back": "Approximately $$4186\\text{ J/(kg·°C)}$$."
        },
        {
          "front": "Why does sand get hotter than water on a sunny beach?",
          "back": "Sand has a lower specific heat capacity than water, so it requires less energy to increase its temperature."
        },
        {
          "front": "What happens to the internal energy of an ideal gas when its temperature is increased?",
          "back": "Its internal energy increases."
        },
        {
          "front": "What is the difference between a spontaneous and a non-spontaneous process?",
          "back": "A spontaneous process increases the entropy of the universe, while a non-spontaneous one requires energy input to occur."
        },
        {
          "front": "What does the Second Law of Thermodynamics imply about energy transformations?",
          "back": "Some energy is always lost as unusable heat, so no process can be 100% efficient."
        },
        {
          "front": "What happens to the entropy of a substance as it changes from solid to liquid to gas?",
          "back": "It increases, because the particles become more disordered."
        },
        {
          "front": "What is a **cyclic process** in thermodynamics?",
          "back": "A process in which a system returns to its initial state."
        },
        {
          "front": "If heat is added to a system but no work is done, what happens to its internal energy?",
          "back": "It increases by an amount equal to the added heat ($$\\Delta U = Q$$)."
        },
        {
          "front": "What is the difference between a heat engine and a heat pump?",
          "back": "A heat engine converts heat to work, while a heat pump uses work to transfer heat."
        }
      ]
    }
  ]
}
