{
  "flashcards": [
    {
      "category": "Electricity Basics",
      "cards": [
        {
          "front": "What is **electricity**?",
          "back": "The flow of electric charge, typically carried by electrons."
        },
        {
          "front": "What are the two types of electric charge?",
          "back": "Positive (+) and negative (-)."
        },
        {
          "front": "What is **static electricity**?",
          "back": "An imbalance of electric charges on the surface of a material, often caused by friction."
        },
        {
          "front": "What is **current electricity**?",
          "back": "The continuous flow of electric charge through a conductor."
        },
        {
          "front": "What is an **electric circuit**?",
          "back": "A complete, closed path through which electric charges can flow."
        },
        {
          "front": "What is **voltage**?",
          "back": "The electric potential energy difference per unit charge between two points in a circuit. It's the 'push' that moves the electrons."
        },
        {
          "front": "What is the SI unit for voltage?",
          "back": "The Volt (V)."
        },
        {
          "front": "What is **electric current**?",
          "back": "The rate of flow of electric charge."
        },
        {
          "front": "What is the SI unit for electric current?",
          "back": "The Ampere (A)."
        },
        {
          "front": "What is **resistance**?",
          "back": "The opposition to the flow of electric current."
        },
        {
          "front": "What is the SI unit for resistance?",
          "back": "The Ohm (Ω)."
        },
        {
          "front": "What is **Ohm's Law**?",
          "back": "The relationship between voltage, current, and resistance in a circuit."
        },
        {
          "front": "What is the formula for Ohm's Law?",
          "back": "V = IR (Voltage = Current x Resistance)."
        },
        {
          "front": "A circuit has a voltage of 12 V and a resistance of 3 Ω. What is the current?",
          "back": "4 A (I = V / R = 12 / 3 = 4)."
        },
        {
          "front": "A circuit has a current of 2 A and a resistance of 6 Ω. What is the voltage?",
          "back": "12 V (V = IR = 2 x 6 = 12)."
        },
        {
          "front": "What is the resistance of a circuit with a voltage of 9 V and a current of 3 A?",
          "back": "3 Ω (R = V / I = 9 / 3 = 3)."
        },
        {
          "front": "What is a **series circuit**?",
          "back": "A circuit in which components are connected end-to-end, so there is only one path for the current to flow."
        },
        {
          "front": "What is a **parallel circuit**?",
          "back": "A circuit in which components are connected across the same two points, creating multiple paths for the current to flow."
        },
        {
          "front": "What happens if one bulb goes out in a series circuit?",
          "back": "All the other bulbs will also go out, because the circuit is broken."
        },
        {
          "front": "What happens if one bulb goes out in a parallel circuit?",
          "back": "The other bulbs will stay on, because the current can still flow through the other paths."
        },
        {
          "front": "What is a **conductor**?",
          "back": "A material that allows electric current to flow easily through it (e.g., copper, silver)."
        },
        {
          "front": "What is an **insulator**?",
          "back": "A material that does not allow electric current to flow easily through it (e.g., plastic, rubber)."
        },
        {
          "front": "Why are electrical wires often covered in rubber or plastic?",
          "back": "Because these materials are insulators that prevent electric shock and short circuits."
        },
        {
          "front": "What is a **short circuit**?",
          "back": "An unintended, low-resistance path for electric current to flow, which can cause a large current and generate a lot of heat."
        },
        {
          "front": "What is a **fuse** or a **circuit breaker**?",
          "back": "Safety devices that stop the flow of electric current if it becomes too high."
        },
        {
          "front": "What is the difference between direct current (DC) and alternating current (AC)?",
          "back": "DC flows in only one direction, while AC periodically reverses direction."
        },
        {
          "front": "What is a **battery**?",
          "back": "A device that converts chemical energy into electrical energy to produce a direct current (DC)."
        },
        {
          "front": "What is the role of a **resistor** in a circuit?",
          "back": "To reduce the flow of current and control the amount of energy that is converted into heat or light."
        },
        {
          "front": "In a series circuit, how is the total resistance calculated?",
          "back": "By adding the individual resistances (R_total = R₁ + R₂ + ...)."
        },
        {
          "front": "In a parallel circuit, how is the total resistance calculated?",
          "back": "By using the reciprocal formula (1/R_total = 1/R₁ + 1/R₂ + ...)."
        },
        {
          "front": "How does the total voltage in a series circuit relate to the voltage drops across each resistor?",
          "back": "The total voltage is the sum of the individual voltage drops."
        },
        {
          "front": "In a parallel circuit, how does the voltage across each component relate?",
          "back": "The voltage is the same across all components."
        },
        {
          "front": "A current of 0.5 A flows through a 20 Ω resistor. What is the voltage across the resistor?",
          "back": "10 V (V = 0.5 x 20 = 10)."
        },
        {
          "front": "What is **power** in an electrical circuit?",
          "back": "The rate at which electrical energy is converted into another form, such as heat or light."
        },
        {
          "front": "What is the formula for electrical power?",
          "back": "P = IV (Power = Current x Voltage)."
        },
        {
          "front": "A lightbulb is rated at 60 W and operates on a 120 V circuit. What is the current flowing through it?",
          "back": "0.5 A (I = P / V = 60 / 120 = 0.5)."
        },
        {
          "front": "What does the symbol 'Ω' stand for?",
          "back": "The Ohm, the unit of resistance."
        },
        {
          "front": "Why do we use alternating current (AC) in our homes?",
          "back": "It is more efficient to transmit over long distances."
        },
        {
          "front": "What is an **ammeter** used for?",
          "back": "To measure electric current."
        },
        {
          "front": "What is a **voltmeter** used for?",
          "back": "To measure voltage."
        }
      ]
    }
  ]
}
