{
  "flashcards": [
    {
      "category": "Forces & Newton's Laws",
      "cards": [
        {
          "front": "What is a **force**?",
          "back": "A push or a pull on an object."
        },
        {
          "front": "What is the SI unit for force?",
          "back": "The Newton (N)."
        },
        {
          "front": "What is a **vector quantity**?",
          "back": "A quantity that has both magnitude and direction."
        },
        {
          "front": "What is **net force**?",
          "back": "The overall force acting on an object when all individual forces are combined."
        },
        {
          "front": "What does it mean for forces to be **balanced**?",
          "back": "The net force is zero, resulting in no change in the object's motion."
        },
        {
          "front": "What does it mean for forces to be **unbalanced**?",
          "back": "The net force is greater than zero, causing the object to accelerate."
        },
        {
          "front": "What is **Newton's First Law**?",
          "back": "An object in motion stays in motion and an object at rest stays at rest unless acted upon by an unbalanced force."
        },
        {
          "front": "What is **inertia**?",
          "back": "The tendency of an object to resist a change in its motion."
        },
        {
          "front": "What does an object's **mass** tell you about its inertia?",
          "back": "The more mass an object has, the more inertia it has and the more it resists a change in motion."
        },
        {
          "front": "What is **Newton's Second Law**?",
          "back": "The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass ($F=ma$)."
        },
        {
          "front": "What is the formula for Newton's Second Law?",
          "back": "$$F = ma$$ (Force = mass x acceleration)."
        },
        {
          "front": "What is the force required to accelerate a 5 kg object at 2 m/s²?",
          "back": "10 Newtons ($F = 5 \\times 2 = 10$ N)."
        },
        {
          "front": "If a net force of 20 N is applied to a 4 kg object, what is its acceleration?",
          "back": "5 m/s² ($a = 20 / 4 = 5$ m/s²)."
        },
        {
          "front": "What is **Newton's Third Law**?",
          "back": "For every action, there is an equal and opposite reaction."
        },
        {
          "front": "When a rocket pushes gas downward, what is the reaction force?",
          "back": "The gas pushes the rocket upward, causing it to launch."
        },
        {
          "front": "What is a **contact force**?",
          "back": "A force that acts on an object by direct physical contact (e.g., friction, a push)."
        },
        {
          "front": "What is a **non-contact force**?",
          "back": "A force that acts on an object at a distance without touching it (e.g., gravity, magnetism)."
        },
        {
          "front": "What is **gravity**?",
          "back": "A non-contact force that pulls objects toward each other, especially toward the center of a planet."
        },
        {
          "front": "What is the difference between **mass** and **weight**?",
          "back": "Mass is the amount of matter in an object; weight is the force of gravity acting on that mass."
        },
        {
          "front": "What is the formula for calculating an object's weight on Earth?",
          "back": "$$Weight = mass \\times g$$ (where g is the acceleration due to gravity, approx. 9.8 m/s²)."
        },
        {
          "front": "What is **friction**?",
          "back": "A force that opposes motion between two surfaces in contact."
        },
        {
          "front": "What is the difference between **static friction** and **kinetic friction**?",
          "back": "Static friction prevents an object from starting to move; kinetic friction acts on a moving object."
        },
        {
          "front": "Why is a car seat belt an example of Newton's First Law?",
          "back": "When the car stops, your body continues to move forward due to its inertia until the seat belt applies an unbalanced force to stop you."
        },
        {
          "front": "If you push a wall, why does the wall not move?",
          "back": "The wall pushes back on you with an equal and opposite force, and its mass is too large for your force to cause a noticeable acceleration."
        },
        {
          "front": "What is **air resistance**?",
          "back": "A type of friction or drag force that acts on objects moving through the air."
        },
        {
          "front": "What is **terminal velocity**?",
          "back": "The constant speed that a freely falling object eventually reaches when the resistance of the medium (like air) prevents further acceleration."
        },
        {
          "front": "What is a **free-body diagram**?",
          "back": "A diagram showing all the forces acting on an object, represented as arrows."
        },
        {
          "front": "What is the **normal force**?",
          "back": "The support force exerted upon an object that is in contact with another stable object, acting perpendicular to the surface."
        },
        {
          "front": "What is **thrust**?",
          "back": "The force that propels a rocket or other vehicle forward, often produced by pushing a gas in the opposite direction."
        },
        {
          "front": "What is the relationship between force and acceleration?",
          "back": "They are directly proportional; if you increase the force, you increase the acceleration."
        },
        {
          "front": "What is the relationship between mass and acceleration?",
          "back": "They are inversely proportional; if you increase the mass, you decrease the acceleration (for the same force)."
        },
        {
          "front": "Why does a bowling ball require more force to accelerate than a tennis ball?",
          "back": "Because the bowling ball has a greater mass, and thus greater inertia."
        },
        {
          "front": "If a force of 10 N pushes an object with a mass of 2 kg, what is the object's acceleration?",
          "back": "5 m/s²."
        },
        {
          "front": "What is the force required to accelerate a 70 kg person at 3 m/s²?",
          "back": "210 N."
        },
        {
          "front": "In a tug-of-war, if the net force is zero, what can you say about the teams?",
          "back": "They are pulling with equal and opposite forces, so neither team is accelerating."
        },
        {
          "front": "How does Newton's Third Law apply to walking?",
          "back": "Your feet push on the ground (action force), and the ground pushes back on your feet (reaction force) to propel you forward."
        },
        {
          "front": "A force of 15 N pushes an object. If the object's mass is 3 kg, what is its acceleration?",
          "back": "5 m/s²."
        },
        {
          "front": "What is the formula for weight?",
          "back": "$$W = mg$$."
        },
        {
          "front": "What is the force of gravity on a 5 kg object on Earth?",
          "back": "Approximately 49 N ($5 \\times 9.8 = 49$)."
        },
        {
          "front": "What is the difference between a push and a pull?",
          "back": "A push is a force that moves an object away from you, while a pull is a force that moves an object toward you."
        }
      ]
    }
  ]
}
