{
  "flashcards": [
    {
      "category": "Heat & Temperature",
      "cards": [
        {
          "front": "What is the difference between **heat** and **temperature**?",
          "back": "Temperature is a measure of the average kinetic energy of particles in a substance. Heat is the transfer of thermal energy from one object to another."
        },
        {
          "front": "What is the SI unit for **temperature**?",
          "back": "The Kelvin (K)."
        },
        {
          "front": "What is the SI unit for **heat** or energy?",
          "back": "The Joule (J)."
        },
        {
          "front": "What are the three main temperature scales?",
          "back": "Fahrenheit, Celsius, and Kelvin."
        },
        {
          "front": "At what temperature does water freeze on the Celsius scale?",
          "back": "0°C."
        },
        {
          "front": "At what temperature does water boil on the Celsius scale?",
          "back": "100°C."
        },
        {
          "front": "What is **absolute zero**?",
          "back": "The lowest possible temperature at which all molecular motion stops (0 K or -273.15 °C)."
        },
        {
          "front": "What are the three methods of **heat transfer**?",
          "back": "Conduction, convection, and radiation."
        },
        {
          "front": "What is **conduction**?",
          "back": "The transfer of heat through direct contact between particles, without the movement of the material itself."
        },
        {
          "front": "What is **convection**?",
          "back": "The transfer of heat through the movement of fluids (liquids or gases)."
        },
        {
          "front": "What is **radiation**?",
          "back": "The transfer of heat through electromagnetic waves, which can occur in a vacuum."
        },
        {
          "front": "Give an example of **conduction**.",
          "back": "The handle of a metal spoon getting hot while in a pot of hot soup."
        },
        {
          "front": "Give an example of **convection**.",
          "back": "The boiling of water in a pot, where hot water rises and cooler water sinks."
        },
        {
          "front": "Give an example of **radiation**.",
          "back": "Feeling the heat from the sun or a campfire."
        },
        {
          "front": "What is a **conductor**?",
          "back": "A material that transfers heat and electricity well (e.g., metals)."
        },
        {
          "front": "What is an **insulator**?",
          "back": "A material that does not transfer heat or electricity well (e.g., plastic, wood)."
        },
        {
          "front": "What is **specific heat capacity**?",
          "back": "The amount of heat energy required to raise the temperature of 1 gram of a substance by 1°C."
        },
        {
          "front": "Why does sand get hot faster than water at the beach?",
          "back": "Sand has a lower specific heat capacity than water, so it requires less energy to increase its temperature."
        },
        {
          "front": "What is **thermal expansion**?",
          "back": "The tendency of matter to change in volume in response to a change in temperature."
        },
        {
          "front": "Why do bridges have expansion joints?",
          "back": "To allow the bridge to expand and contract with temperature changes without cracking."
        },
        {
          "front": "What is a **phase change**?",
          "back": "The transition of matter from one state (solid, liquid, gas) to another."
        },
        {
          "front": "What is the process of a solid turning into a liquid?",
          "back": "Melting."
        },
        {
          "front": "What is the process of a liquid turning into a gas?",
          "back": "Boiling or vaporization."
        },
        {
          "front": "What is the process of a liquid turning into a solid?",
          "back": "Freezing or solidification."
        },
        {
          "front": "What is the process of a gas turning into a liquid?",
          "back": "Condensation."
        },
        {
          "front": "What is the **Law of Conservation of Energy** in the context of heat?",
          "back": "The total amount of thermal energy in an isolated system remains constant; heat lost by one object equals the heat gained by another."
        },
        {
          "front": "What is **thermal equilibrium**?",
          "back": "A state where two objects in contact have reached the same temperature and there is no net transfer of heat between them."
        },
        {
          "front": "What is the formula for calculating heat energy?",
          "back": "$$Q = mcΔT$$ where Q is heat, m is mass, c is specific heat, and ΔT is change in temperature."
        },
        {
          "front": "What is the freezing point of water on the Fahrenheit scale?",
          "back": "32°F."
        },
        {
          "front": "What is the boiling point of water on the Fahrenheit scale?",
          "back": "212°F."
        },
        {
          "front": "How does the kinetic theory of matter relate to temperature?",
          "back": "It states that all matter is made of particles in constant motion, and temperature is a measure of their average kinetic energy."
        },
        {
          "front": "Why are some cooking pots made of a metal base and a plastic handle?",
          "back": "The metal is a good conductor to heat the food, and the plastic handle is an insulator to protect your hand."
        },
        {
          "front": "What happens to the molecules of a substance as its temperature increases?",
          "back": "They move faster and vibrate more, and the substance generally expands."
        },
        {
          "front": "How do ocean currents transfer heat around the globe?",
          "back": "Through convection, where warm water from the equator moves towards the poles and cooler water moves towards the equator."
        },
        {
          "front": "What is **latent heat**?",
          "back": "The energy absorbed or released during a phase change, without a change in temperature."
        },
        {
          "front": "Is heat a form of energy?",
          "back": "Yes, it is the transfer of thermal energy."
        },
        {
          "front": "What is the difference between a hot object and a cold object at the molecular level?",
          "back": "The molecules in the hot object are, on average, moving faster than the molecules in the cold object."
        },
        {
          "front": "In a hot air balloon, how is the air inside heated?",
          "back": "The air is heated by a burner, and the hot air rises through convection, causing the balloon to lift."
        },
        {
          "front": "Why does steam cause a more severe burn than boiling water?",
          "back": "Steam has a large amount of latent heat of vaporization, which is released when it condenses on your skin."
        },
        {
          "front": "Why is a good thermos designed to prevent all three types of heat transfer?",
          "back": "It has a vacuum to prevent conduction and convection, and a reflective surface to prevent radiation, keeping the contents at a stable temperature."
        }
      ]
    }
  ]
}
