{
  "flashcards": [
    {
      "category": "Light & Reflection",
      "cards": [
        {
          "front": "What is **light** in physics?",
          "back": "Light is a form of electromagnetic radiation that travels as a transverse wave."
        },
        {
          "front": "How fast does light travel in a vacuum?",
          "back": "Approximately 3 x 10⁸ m/s, or 300,000,000 m/s."
        },
        {
          "front": "What is the difference between a **luminous object** and an **illuminated object**?",
          "back": "A luminous object produces its own light (e.g., the Sun), while an illuminated object reflects light (e.g., the Moon)."
        },
        {
          "front": "What is a **ray** in the study of light?",
          "back": "A straight line with an arrowhead showing the direction in which light waves are traveling."
        },
        {
          "front": "What is **reflection**?",
          "back": "The bouncing back of light from a surface."
        },
        {
          "front": "What is the **Law of Reflection**?",
          "back": "The angle of incidence is equal to the angle of reflection."
        },
        {
          "front": "What is the **angle of incidence**?",
          "back": "The angle between an incoming light ray and the normal."
        },
        {
          "front": "What is the **angle of reflection**?",
          "back": "The angle between the reflected light ray and the normal."
        },
        {
          "front": "What is the **normal**?",
          "back": "An imaginary line drawn perpendicular to a surface at the point where a light ray strikes it."
        },
        {
          "front": "What is the difference between **specular reflection** and **diffuse reflection**?",
          "back": "Specular reflection is from a smooth surface and produces a clear image. Diffuse reflection is from a rough surface and scatters light in many directions."
        },
        {
          "front": "Give an example of **specular reflection**.",
          "back": "Light reflecting off a mirror or a still body of water."
        },
        {
          "front": "Give an example of **diffuse reflection**.",
          "back": "Light reflecting off a piece of paper or a brick wall."
        },
        {
          "front": "What is a **plane mirror**?",
          "back": "A flat mirror that produces a virtual, upright image that is the same size as the object and laterally inverted."
        },
        {
          "front": "What does it mean for an image to be **virtual**?",
          "back": "The image is formed where light rays appear to diverge from; it cannot be projected onto a screen."
        },
        {
          "front": "What does it mean for an image to be **real**?",
          "back": "The image is formed where light rays actually converge; it can be projected onto a screen."
        },
        {
          "front": "What is a **concave mirror**?",
          "back": "A curved mirror where the reflecting surface is on the inside, like a spoon's bowl. It can form both real and virtual images."
        },
        {
          "front": "What is a **convex mirror**?",
          "back": "A curved mirror where the reflecting surface is on the outside, like the back of a spoon. It only forms virtual, upright, and smaller images."
        },
        {
          "front": "What is the **focal point** of a concave mirror?",
          "back": "The point on the principal axis where light rays parallel to the axis converge after reflecting off the mirror."
        },
        {
          "front": "What is the **focal point** of a convex mirror?",
          "back": "The point on the principal axis from which reflected parallel light rays appear to diverge."
        },
        {
          "front": "Why are convex mirrors used as security mirrors in stores?",
          "back": "They provide a wide field of view, showing a large area in a small, upright image."
        },
        {
          "front": "Why are concave mirrors used in car headlights?",
          "back": "They are used to focus light from the bulb into a concentrated, parallel beam."
        },
        {
          "front": "How do we see an object?",
          "back": "Light reflects off the object and travels into our eyes."
        },
        {
          "front": "What is the **principal axis** of a curved mirror?",
          "back": "The straight line passing through the center of curvature and the vertex of the mirror."
        },
        {
          "front": "What is the term for a virtual image that appears reversed left-to-right?",
          "back": "Laterally inverted."
        },
        {
          "front": "What is **magnification**?",
          "back": "The ratio of the image height to the object height."
        },
        {
          "front": "When an object is placed in front of a plane mirror, what is the relationship between the object distance and the image distance?",
          "back": "The object distance is equal to the image distance."
        },
        {
          "front": "If you move towards a plane mirror, what happens to your image?",
          "back": "Your image also moves towards you at the same speed."
        },
        {
          "front": "In a concave mirror, where should an object be placed to create a real, inverted, and magnified image?",
          "back": "Between the focal point and the center of curvature."
        },
        {
          "front": "In a concave mirror, where should an object be placed to create a virtual, upright, and magnified image?",
          "back": "Inside the focal point (between the mirror and the focal point)."
        },
        {
          "front": "When looking at yourself in a convex mirror, is the image you see real or virtual?",
          "back": "Virtual."
        },
        {
          "front": "What is the **center of curvature** of a curved mirror?",
          "back": "The center of the sphere from which the mirror was a part."
        },
        {
          "front": "What is the law that governs the behavior of light as it reflects off a surface?",
          "back": "The Law of Reflection."
        },
        {
          "front": "What kind of image is formed by a plane mirror?",
          "back": "A virtual, upright, and laterally inverted image."
        },
        {
          "front": "What type of light source is the Sun?",
          "back": "A luminous source."
        },
        {
          "front": "What is the speed of light in water?",
          "back": "It is slower than in a vacuum."
        },
        {
          "front": "If a light ray strikes a mirror at an angle of incidence of 30°, what is the angle of reflection?",
          "back": "30°."
        },
        {
          "front": "When light rays from a distant object hit a concave mirror, they are reflected and converge at what point?",
          "back": "The focal point."
        },
        {
          "front": "How can you tell the difference between a concave and a convex mirror by looking at your reflection?",
          "back": "A concave mirror can produce an inverted image, while a convex mirror always produces an upright image."
        },
        {
          "front": "What is the term for the process of a light wave bouncing off an object?",
          "back": "Reflection."
        },
        {
          "front": "In a ray diagram, what does a solid line represent?",
          "back": "The actual path of a light ray."
        }
      ]
    }
  ]
}
