{
  "flashcards": [
    {
      "category": "Motion & Graphs",
      "cards": [
        {
          "front": "What is **distance**?",
          "back": "The total length of the path an object travels."
        },
        {
          "front": "What is **displacement**?",
          "back": "The change in an object's position, including the direction of the change."
        },
        {
          "front": "Is distance a scalar or vector quantity?",
          "back": "Distance is a **scalar** quantity because it only has magnitude (size)."
        },
        {
          "front": "Is displacement a scalar or vector quantity?",
          "back": "Displacement is a **vector** quantity because it has both magnitude and direction."
        },
        {
          "front": "What is **speed**?",
          "back": "The rate at which an object covers distance."
        },
        {
          "front": "What is **velocity**?",
          "back": "The rate at which an object changes its position, including the direction of motion."
        },
        {
          "front": "Is speed a scalar or vector quantity?",
          "back": "Speed is a **scalar** quantity."
        },
        {
          "front": "Is velocity a scalar or vector quantity?",
          "back": "Velocity is a **vector** quantity."
        },
        {
          "front": "What is the formula for average speed?",
          "back": "$$Average Speed = \\frac{Total Distance}{Total Time}$$"
        },
        {
          "front": "What is the formula for average velocity?",
          "back": "$$Average Velocity = \\frac{Displacement}{Total Time}$$"
        },
        {
          "front": "What is **acceleration**?",
          "back": "The rate at which an object's velocity changes."
        },
        {
          "front": "What are the three ways an object can accelerate?",
          "back": "By speeding up, slowing down, or changing direction."
        },
        {
          "front": "What is the SI unit for **speed** and **velocity**?",
          "back": "Meters per second (m/s)."
        },
        {
          "front": "What is the SI unit for **acceleration**?",
          "back": "Meters per second squared (m/s²)."
        },
        {
          "front": "On a **position-time graph**, what does the slope of the line represent?",
          "back": "The object's **velocity**."
        },
        {
          "front": "On a position-time graph, what does a straight, horizontal line mean?",
          "back": "The object is **at rest** (not moving)."
        },
        {
          "front": "On a position-time graph, what does a straight line with a constant slope mean?",
          "back": "The object is moving at a **constant velocity**."
        },
        {
          "front": "On a position-time graph, what does a curved line mean?",
          "back": "The object is **accelerating** (its velocity is changing)."
        },
        {
          "front": "On a **velocity-time graph**, what does the slope of the line represent?",
          "back": "The object's **acceleration**."
        },
        {
          "front": "On a velocity-time graph, what does a straight, horizontal line mean?",
          "back": "The object is moving at a **constant velocity** (zero acceleration)."
        },
        {
          "front": "On a velocity-time graph, what does a positive slope mean?",
          "back": "The object is **speeding up** (positive acceleration)."
        },
        {
          "front": "On a velocity-time graph, what does a negative slope mean?",
          "back": "The object is **slowing down** (negative acceleration or deceleration)."
        },
        {
          "front": "On a velocity-time graph, what does the area under the curve represent?",
          "back": "The object's **displacement**."
        },
        {
          "front": "What is the formula for average acceleration?",
          "back": "$$a = \\frac{v_f - v_i}{t}$$ (change in velocity divided by time)."
        },
        {
          "front": "What is the difference between average speed and instantaneous speed?",
          "back": "Average speed is the total distance over the total time; instantaneous speed is the speed at a particular moment."
        },
        {
          "front": "If a car travels 50 km and returns to its starting point, what is its total displacement?",
          "back": "Zero."
        },
        {
          "front": "A runner takes 10 seconds to run 100 meters. What is their average speed?",
          "back": "10 m/s."
        },
        {
          "front": "An object is moving at a constant velocity. What is its acceleration?",
          "back": "Zero."
        },
        {
          "front": "What is the difference between a scalar and a vector quantity?",
          "back": "A scalar has only magnitude; a vector has both magnitude and direction."
        },
        {
          "front": "On a velocity-time graph, if the line crosses the x-axis, what does that mean?",
          "back": "The object has changed direction."
        },
        {
          "front": "What is **uniform motion**?",
          "back": "Motion at a constant velocity (constant speed and direction)."
        },
        {
          "front": "What is **non-uniform motion**?",
          "back": "Motion in which the velocity is changing (the object is accelerating)."
        },
        {
          "front": "What is the slope of a line on a graph?",
          "back": "The steepness of the line, calculated as 'rise over run' or the change in the y-variable divided by the change in the x-variable."
        },
        {
          "front": "What does a line with a steeper slope represent on a position-time graph?",
          "back": "A **faster velocity**."
        },
        {
          "front": "What does a line with a steeper slope represent on a velocity-time graph?",
          "back": "A **greater acceleration**."
        },
        {
          "front": "If an object's position-time graph is a straight line going downwards, what does that mean?",
          "back": "The object is moving at a constant velocity in the negative direction."
        },
        {
          "front": "What is the term for negative acceleration?",
          "back": "Deceleration or slowing down."
        },
        {
          "front": "If a car's speed is 50 mph, what can you say about its velocity?",
          "back": "You cannot determine its velocity because you do not know its direction."
        },
        {
          "front": "In a velocity-time graph, what does a horizontal line above the x-axis represent?",
          "back": "A constant positive velocity."
        },
        {
          "front": "How do you calculate the displacement from a velocity-time graph?",
          "back": "By finding the area of the shape under the curve."
        }
      ]
    }
  ]
}
