{
  "flashcards": [
    {
      "category": "Waves & Sound",
      "cards": [
        {
          "front": "What is a **wave**?",
          "back": "A disturbance that transfers energy through matter or space."
        },
        {
          "front": "What is the difference between a **transverse wave** and a **longitudinal wave**?",
          "back": "In a transverse wave, particles move perpendicular to the wave's direction. In a longitudinal wave, particles move parallel to the wave's direction."
        },
        {
          "front": "Give an example of a **transverse wave**.",
          "back": "Light waves or waves on a string."
        },
        {
          "front": "Give an example of a **longitudinal wave**.",
          "back": "Sound waves."
        },
        {
          "front": "What is **wavelength**?",
          "back": "The distance between two consecutive points on a wave, such as from crest to crest."
        },
        {
          "front": "What is **frequency**?",
          "back": "The number of waves that pass a single point in a given amount of time."
        },
        {
          "front": "What is the SI unit for frequency?",
          "back": "The Hertz (Hz)."
        },
        {
          "front": "What is **amplitude**?",
          "back": "The maximum displacement or distance moved by a point on a vibrating body or wave measured from its equilibrium position."
        },
        {
          "front": "What is the relationship between a wave's amplitude and its energy?",
          "back": "The greater the amplitude, the more energy the wave carries."
        },
        {
          "front": "What is the formula for wave speed?",
          "back": "Wave Speed = Frequency x Wavelength ($v = fλ$)."
        },
        {
          "front": "A wave has a frequency of 10 Hz and a wavelength of 2 m. What is its speed?",
          "back": "20 m/s ($v = 10 \\times 2 = 20$)."
        },
        {
          "front": "What is **sound**?",
          "back": "A longitudinal wave that is created by vibrations and requires a medium to travel through."
        },
        {
          "front": "What is a **medium**?",
          "back": "The substance or material that a wave travels through (e.g., air, water, or a solid)."
        },
        {
          "front": "Why can't sound travel in a vacuum?",
          "back": "Because a vacuum contains no particles to vibrate and carry the sound wave."
        },
        {
          "front": "In which medium does sound travel fastest: a solid, a liquid, or a gas?",
          "back": "A solid, because the particles are closer together."
        },
        {
          "front": "What is the difference between a loud sound and a quiet sound?",
          "back": "A loud sound has a larger amplitude."
        },
        {
          "front": "What is the difference between a high-pitched sound and a low-pitched sound?",
          "back": "A high-pitched sound has a higher frequency."
        },
        {
          "front": "What is an **echo**?",
          "back": "A reflected sound wave."
        },
        {
          "front": "What is **reflection**?",
          "back": "The bouncing back of a wave when it hits a surface."
        },
        {
          "front": "What is **refraction**?",
          "back": "The bending of a wave as it passes from one medium to another."
        },
        {
          "front": "What is **diffraction**?",
          "back": "The bending of a wave as it moves around an obstacle or passes through a narrow opening."
        },
        {
          "front": "What is **interference**?",
          "back": "The effect that occurs when two or more waves overlap."
        },
        {
          "front": "What is **constructive interference**?",
          "back": "When waves overlap to create a larger wave."
        },
        {
          "front": "What is **destructive interference**?",
          "back": "When waves overlap and cancel each other out."
        },
        {
          "front": "What is the **Doppler effect**?",
          "back": "The apparent change in frequency of a wave due to the relative motion of the source and the observer."
        },
        {
          "front": "How does the Doppler effect apply to an ambulance siren?",
          "back": "As the ambulance approaches, the sound waves are compressed, creating a higher-pitched sound. As it moves away, the waves are stretched, creating a lower-pitched sound."
        },
        {
          "front": "What is the relationship between frequency and period?",
          "back": "They are inversely proportional; Period = 1/Frequency."
        },
        {
          "front": "What is the speed of sound in air (at room temperature)?",
          "back": "Approximately 343 m/s."
        },
        {
          "front": "What is the **pitch** of a sound?",
          "back": "How high or low a sound is, determined by the sound's frequency."
        },
        {
          "front": "What is the **loudness** of a sound?",
          "back": "How loud or soft a sound is, determined by the sound's amplitude."
        },
        {
          "front": "What is the unit for loudness?",
          "back": "The decibel (dB)."
        },
        {
          "front": "A sound wave has a speed of 340 m/s and a frequency of 85 Hz. What is its wavelength?",
          "back": "4 m ($λ = 340 / 85 = 4$)."
        },
        {
          "front": "A wave travels 10 meters in 2 seconds. What is its speed?",
          "back": "5 m/s ($v = 10 / 2 = 5$)."
        },
        {
          "front": "What is the **crest** of a wave?",
          "back": "The highest point of a transverse wave."
        },
        {
          "front": "What is the **trough** of a wave?",
          "back": "The lowest point of a transverse wave."
        },
        {
          "front": "What is a **compression** in a longitudinal wave?",
          "back": "The region where the particles of the medium are close together."
        },
        {
          "front": "What is a **rarefaction** in a longitudinal wave?",
          "back": "The region where the particles of the medium are spread apart."
        },
        {
          "front": "How is a sound wave transmitted through the air?",
          "back": "The vibrating source pushes air molecules, which then collide with their neighbors, creating a series of compressions and rarefactions that travel away from the source."
        },
        {
          "front": "What is the relationship between pitch and frequency?",
          "back": "Higher frequency means a higher pitch."
        },
        {
          "front": "Why do you see lightning before you hear thunder?",
          "back": "Because light travels much faster than sound."
        }
      ]
    }
  ]
}
