{
  "flashcards": [
    {
      "category": "Work, Energy, and Power",
      "cards": [
        {
          "front": "What is **work** in physics?",
          "back": "The transfer of energy that occurs when a force causes an object to move in the same direction as the force."
        },
        {
          "front": "What is the formula for work?",
          "back": "Work = Force x distance x cos(θ)."
        },
        {
          "front": "What is the SI unit for **work**?",
          "back": "The Joule (J)."
        },
        {
          "front": "If you push a wall with a force of 100 N but the wall doesn't move, how much work have you done?",
          "back": "Zero work, because there was no displacement."
        },
        {
          "front": "What is **energy**?",
          "back": "The ability to do work or cause a change."
        },
        {
          "front": "What is the SI unit for **energy**?",
          "back": "The Joule (J)."
        },
        {
          "front": "What is **kinetic energy**?",
          "back": "The energy of motion."
        },
        {
          "front": "What is the formula for kinetic energy?",
          "back": "KE = ½mv²."
        },
        {
          "front": "A 2 kg object is moving at 3 m/s. What is its kinetic energy?",
          "back": "9 Joules (KE = 0.5 x 2 x 3² = 9 J)."
        },
        {
          "front": "What is **potential energy**?",
          "back": "Stored energy due to an object's position or state."
        },
        {
          "front": "What is **gravitational potential energy**?",
          "back": "The energy an object has due to its position above the ground."
        },
        {
          "front": "What is the formula for gravitational potential energy?",
          "back": "PE = mgh."
        },
        {
          "front": "A 5 kg ball is held 2 meters above the ground. What is its potential energy?",
          "back": "98 Joules (PE = 5 x 9.8 x 2 = 98 J)."
        },
        {
          "front": "What is the **Law of Conservation of Energy**?",
          "back": "Energy cannot be created or destroyed, but it can be transformed from one form to another."
        },
        {
          "front": "What is **mechanical energy**?",
          "back": "The sum of an object's kinetic energy and potential energy."
        },
        {
          "front": "When a roller coaster car goes down a hill, what energy conversion is happening?",
          "back": "Gravitational potential energy is being converted into kinetic energy."
        },
        {
          "front": "When a rubber band is stretched, what kind of energy is stored in it?",
          "back": "Elastic potential energy."
        },
        {
          "front": "What is **power** in physics?",
          "back": "The rate at which work is done or energy is transferred."
        },
        {
          "front": "What is the formula for power?",
          "back": "Power = Work / Time or P = E / t."
        },
        {
          "front": "What is the SI unit for **power**?",
          "back": "The Watt (W)."
        },
        {
          "front": "A person does 100 Joules of work in 5 seconds. What is their power?",
          "back": "20 Watts (P = 100 / 5 = 20 W)."
        },
        {
          "front": "If you lift a 10 kg box 1 meter, how much work have you done?",
          "back": "98 Joules (W = Fd = (10 x 9.8) x 1 = 98 J)."
        },
        {
          "front": "What is **efficiency**?",
          "back": "The ratio of useful energy output to the total energy input."
        },
        {
          "front": "What is a common example of an energy transformation from chemical to kinetic energy?",
          "back": "A car engine using gasoline to move the car."
        },
        {
          "front": "What is the difference between kinetic energy and thermal energy?",
          "back": "Kinetic energy is the energy of a moving object, while thermal energy is the internal kinetic energy of its particles."
        },
        {
          "front": "When a car brakes, what happens to its kinetic energy?",
          "back": "It is converted into thermal energy (heat) due to friction."
        },
        {
          "front": "What does it mean if an object has zero kinetic energy?",
          "back": "The object is not moving."
        },
        {
          "front": "An object is lifted to a certain height. How does its potential energy change?",
          "back": "Its potential energy increases as its height increases."
        },
        {
          "front": "A lightbulb uses 100 J of electrical energy and produces 20 J of light energy. What is its efficiency?",
          "back": "20% (Efficiency = (20 / 100) x 100% = 20%)."
        },
        {
          "front": "What is a kilowatt-hour (kWh)?",
          "back": "A unit of energy equal to 1000 Watts of power expended for one hour."
        },
        {
          "front": "What is the relationship between power, force, and velocity?",
          "back": "P = Fv (Power equals force times velocity)."
        },
        {
          "front": "If a person runs up stairs, are they doing work?",
          "back": "Yes, they are applying a force to lift their body against gravity, causing a displacement."
        },
        {
          "front": "An object is at rest. What is its kinetic energy?",
          "back": "Zero."
        },
        {
          "front": "A ball is thrown straight up into the air. At its highest point, what is its kinetic energy?",
          "back": "Zero (for an instant before it begins to fall)."
        },
        {
          "front": "A ball is thrown straight up. At its highest point, what is its potential energy?",
          "back": "Maximum."
        },
        {
          "front": "An elevator lifts a 500 kg object 10 meters in 20 seconds. How much power is used?",
          "back": "2450 Watts (W = (500 x 9.8) x 10 = 49000 J. P = 49000 / 20 = 2450 W)."
        },
        {
          "front": "What is the difference between a high-power and a low-power device?",
          "back": "A high-power device does a lot of work in a short amount of time; a low-power device does the same amount of work over a longer time."
        },
        {
          "front": "Can work be negative?",
          "back": "Yes, when a force is applied in the direction opposite to the displacement."
        },
        {
          "front": "What is the definition of a Joule?",
          "back": "The work done when a force of one Newton moves an object one meter."
        },
        {
          "front": "What is an energy transformation?",
          "back": "The process of changing energy from one form to another."
        }
      ]
    }
  ]
}
