{
  "flashcards": [
    {
      "category": "Circular Motion",
      "cards": [
        {
          "front": "What is **uniform circular motion**?",
          "back": "The motion of an object traveling at a constant speed in a circular path."
        },
        {
          "front": "What is **tangential velocity**?",
          "back": "The velocity of an object at any point in its circular path, which is always tangent to the circle."
        },
        {
          "front": "In uniform circular motion, is velocity constant?",
          "back": "No. The speed is constant, but the velocity is always changing direction."
        },
        {
          "front": "What is the formula for the magnitude of tangential velocity?",
          "back": "$$v_t = \\frac{2\\pi r}{T}$$"
        },
        {
          "front": "What is the **centripetal force**?",
          "back": "The net force that causes an object to move in a circular path. It is always directed toward the center of the circle."
        },
        {
          "front": "What is the formula for centripetal force?",
          "back": "$$F_c = \\frac{mv^2}{r}$$"
        },
        {
          "front": "What is the SI unit for centripetal force?",
          "back": "The Newton (N)."
        },
        {
          "front": "What is **centripetal acceleration**?",
          "back": "The acceleration of an object moving in a circle, always directed toward the center."
        },
        {
          "front": "What is the formula for centripetal acceleration?",
          "back": "$$a_c = \\frac{v^2}{r}$$"
        },
        {
          "front": "What is the relationship between centripetal force and centripetal acceleration?",
          "back": "$$F_c = ma_c$$"
        },
        {
          "front": "What is **centrifugal force**?",
          "back": "A fictitious force that appears to push an object away from the center of a circular path. It is not a real force."
        },
        {
          "front": "What is the difference between centripetal and centrifugal force?",
          "back": "Centripetal force is a real force directed inward, while centrifugal force is an apparent force directed outward due to inertia."
        },
        {
          "front": "What is the **period (T)** of circular motion?",
          "back": "The time it takes for an object to complete one full revolution."
        },
        {
          "front": "What is the SI unit for period?",
          "back": "The second (s)."
        },
        {
          "front": "What is the **frequency (f)** of circular motion?",
          "back": "The number of revolutions per unit of time."
        },
        {
          "front": "What is the SI unit for frequency?",
          "back": "Hertz (Hz)."
        },
        {
          "front": "What is the relationship between period and frequency?",
          "back": "$$T = \\frac{1}{f}$$"
        },
        {
          "front": "How does the centripetal force change if the mass of the object is doubled?",
          "back": "It doubles."
        },
        {
          "front": "How does the centripetal force change if the radius is halved?",
          "back": "It doubles."
        },
        {
          "front": "How does the centripetal force change if the speed is doubled?",
          "back": "It quadruples."
        },
        {
          "front": "What force provides the centripetal force for a car turning a corner?",
          "back": "Friction between the tires and the road."
        },
        {
          "front": "What force provides the centripetal force for a satellite orbiting Earth?",
          "back": "Gravity."
        },
        {
          "front": "What force provides the centripetal force for a ball swung on a string?",
          "back": "Tension in the string."
        },
        {
          "front": "At the top of a vertical circle, what two forces provide the centripetal force?",
          "back": "Tension (or Normal Force) and the force of gravity (weight)."
        },
        {
          "front": "At the bottom of a vertical circle, what two forces provide the centripetal force?",
          "back": "Tension (or Normal Force) minus the force of gravity (weight)."
        },
        {
          "front": "What is the minimum speed needed for an object to complete a vertical loop?",
          "back": "The speed at the top where tension is zero."
        },
        {
          "front": "How does the centripetal acceleration change if the radius is doubled?",
          "back": "It is halved."
        },
        {
          "front": "What happens to a satellite's speed if it moves into a larger orbit?",
          "back": "Its speed decreases."
        },
        {
          "front": "What is the formula for centripetal force using period?",
          "back": "$$F_c = \\frac{4\\pi^2 mr}{T^2}$$"
        },
        {
          "front": "What is the formula for centripetal acceleration using period?",
          "back": "$$a_c = \\frac{4\\pi^2 r}{T^2}$$"
        },
        {
          "front": "What is the formula for tangential speed using frequency?",
          "back": "$$v_t = 2\\pi rf$$"
        },
        {
          "front": "On a vertical loop, at what point is the tension in the string highest?",
          "back": "The bottom."
        },
        {
          "front": "On a vertical loop, at what point is the tension in the string lowest?",
          "back": "The top."
        },
        {
          "front": "What is the formula for the net force at the bottom of a vertical loop?",
          "back": "$$\\Sigma F_{net} = F_T - F_g = \\frac{mv^2}{r}$$"
        },
        {
          "front": "What is the formula for the net force at the top of a vertical loop?",
          "back": "$$\\Sigma F_{net} = F_T + F_g = \\frac{mv^2}{r}$$"
        },
        {
          "front": "Why do passengers in a car feel pushed outward when turning a corner?",
          "back": "Their inertia causes them to want to continue in a straight line, while the car turns."
        },
        {
          "front": "What happens to an object's path if the centripetal force suddenly vanishes?",
          "back": "It will fly off in a straight line tangent to the circular path."
        },
        {
          "front": "Why are banked curves used on racetracks and highways?",
          "back": "To use a component of the normal force to provide the necessary centripetal force."
        },
        {
          "front": "What is the relationship between the radius of a turn and the centripetal force required?",
          "back": "The force is inversely proportional to the radius."
        },
        {
          "front": "What is the angular velocity of an object in circular motion?",
          "back": "The rate of change of the angle, measured in radians per second."
        }
      ]
    }
  ]
}
