{
  "flashcards": [
    {
      "category": "Dynamics & Forces",
      "cards": [
        {
          "front": "What is a **force**?",
          "back": "A push or pull on an object."
        },
        {
          "front": "What is the SI unit for force?",
          "back": "The Newton (N)."
        },
        {
          "front": "What is **dynamics**?",
          "back": "The study of how forces affect motion."
        },
        {
          "front": "What is the difference between **mass** and **weight**?",
          "back": "Mass is the amount of matter in an object, while weight is the force of gravity on that mass."
        },
        {
          "front": "What is the formula for calculating weight?",
          "back": "$$W = mg$$"
        },
        {
          "front": "What is **Newton's First Law of Motion**?",
          "back": "An object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced force (Law of Inertia)."
        },
        {
          "front": "What is **Newton's Second Law of Motion**?",
          "back": "The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass."
        },
        {
          "front": "What is the formula for Newton's Second Law?",
          "back": "$$\\Sigma F = ma$$"
        },
        {
          "front": "What is **Newton's Third Law of Motion**?",
          "back": "For every action, there is an equal and opposite reaction."
        },
        {
          "front": "What is **inertia**?",
          "back": "The tendency of an object to resist changes in its state of motion."
        },
        {
          "front": "How does mass relate to inertia?",
          "back": "The greater the mass of an object, the greater its inertia."
        },
        {
          "front": "What is a **free-body diagram**?",
          "back": "A diagram that shows all the forces acting on a single object."
        },
        {
          "front": "What is **net force**?",
          "back": "The vector sum of all forces acting on an object."
        },
        {
          "front": "What is the **force of gravity** on an object?",
          "back": "The force that pulls an object toward the center of the Earth. It's also called weight."
        },
        {
          "front": "What is the **normal force**?",
          "back": "The perpendicular force exerted by a surface to support the weight of an object resting on it."
        },
        {
          "front": "What is **tension**?",
          "back": "The force exerted by a rope, string, or cable when it is pulled taut."
        },
        {
          "front": "What is **friction**?",
          "back": "A force that opposes motion between two surfaces that are in contact."
        },
        {
          "front": "What is the difference between **static friction** and **kinetic friction**?",
          "back": "Static friction prevents an object from starting to move, while kinetic friction acts on a moving object."
        },
        {
          "front": "What is the formula for kinetic friction?",
          "back": "$$f_k = \\mu_k N$$"
        },
        {
          "front": "What is the formula for maximum static friction?",
          "back": "$$f_{s,max} = \\mu_s N$$"
        },
        {
          "front": "What is a **coefficient of friction**?",
          "back": "A dimensionless number that represents the roughness between two surfaces."
        },
        {
          "front": "What is the relationship between $\\mu_s$ and $\\mu_k$?",
          "back": "The coefficient of static friction ($\\mu_s$) is always greater than or equal to the coefficient of kinetic friction ($\\mu_k$)."
        },
        {
          "front": "What is an **applied force**?",
          "back": "A force that is exerted on an object by a person or another object."
        },
        {
          "front": "What is **air resistance**?",
          "back": "A type of fluid friction that acts on objects moving through the air."
        },
        {
          "front": "When is the net force on an object zero?",
          "back": "When the object is at rest or moving with a constant velocity (zero acceleration)."
        },
        {
          "front": "What is the principle of a simple **pulley system**?",
          "back": "It changes the direction of a force, making it easier to lift heavy objects."
        },
        {
          "front": "How does the force of gravity change with altitude?",
          "back": "It decreases as altitude increases."
        },
        {
          "front": "What is the formula for gravitational force between two objects?",
          "back": "$$F_g = G \\frac{m_1 m_2}{r^2}$$"
        },
        {
          "front": "What is the value of the universal gravitational constant, $G$?",
          "back": "$$6.67 \\times 10^{-11} \\text{ N} \\cdot \\text{m}^2/\\text{kg}^2$$"
        },
        {
          "front": "When an object is in **free-fall**, what is the only force acting on it (ignoring air resistance)?",
          "back": "The force of gravity (its weight)."
        },
        {
          "front": "How does the acceleration of a falling object change as it approaches terminal velocity?",
          "back": "Its acceleration decreases until it reaches zero."
        },
        {
          "front": "What is **terminal velocity**?",
          "back": "The constant speed that a freely falling object eventually reaches when the resistance of the medium (like air) prevents further acceleration."
        },
        {
          "front": "What are the two main types of forces?",
          "back": "Contact forces (e.g., friction, applied force) and non-contact forces (e.g., gravity, magnetic force)."
        },
        {
          "front": "Why is it harder to push a box from rest than to keep it moving?",
          "back": "Static friction is greater than kinetic friction."
        },
        {
          "front": "If you push on a wall, why doesn't the wall move?",
          "back": "The wall exerts an equal and opposite force on you, according to Newton's Third Law."
        },
        {
          "front": "What is the difference between balanced and unbalanced forces?",
          "back": "Balanced forces result in zero net force and no change in motion. Unbalanced forces result in a net force and acceleration."
        },
        {
          "front": "What force causes an object to slow down and eventually stop when it slides across a surface?",
          "back": "Friction."
        },
        {
          "front": "What is the formula for the impulse-momentum theorem?",
          "back": "$$J = \\Delta p$$ or $$F\\Delta t = m\\Delta v$$"
        },
        {
          "front": "What is **impulse**?",
          "back": "The change in momentum of an object."
        },
        {
          "front": "What happens to the normal force on a box if you push down on it?",
          "back": "The normal force increases to support the additional downward force."
        }
      ]
    }
  ]
}
