{
  "flashcards": [
    {
      "category": "Electricity & Circuits",
      "cards": [
        {
          "front": "What is **electric charge**?",
          "back": "A fundamental property of matter that causes it to experience a force when placed in an electromagnetic field."
        },
        {
          "front": "What is the unit of electric charge?",
          "back": "The Coulomb (C)."
        },
        {
          "front": "What is **electric current**?",
          "back": "The rate of flow of electric charge."
        },
        {
          "front": "What is the unit of electric current?",
          "back": "The Ampere (A)."
        },
        {
          "front": "What is **voltage** or **potential difference**?",
          "back": "The energy per unit charge, which drives the flow of current."
        },
        {
          "front": "What is the unit of voltage?",
          "back": "The Volt (V)."
        },
        {
          "front": "What is **resistance**?",
          "back": "The opposition to the flow of electric current."
        },
        {
          "front": "What is the unit of resistance?",
          "back": "The Ohm (Ω)."
        },
        {
          "front": "What is **Ohm's Law**?",
          "back": "The relationship between voltage, current, and resistance: Voltage = Current x Resistance ($$V = IR$$)."
        },
        {
          "front": "What is an **electric circuit**?",
          "back": "A complete path that allows electric charge to flow from a power source and back."
        },
        {
          "front": "What is a **series circuit**?",
          "back": "A circuit where components are connected in a single path."
        },
        {
          "front": "What is a **parallel circuit**?",
          "back": "A circuit where components are connected in multiple separate paths."
        },
        {
          "front": "How is total resistance calculated in a **series circuit**?",
          "back": "By adding all individual resistances: $$R_{total} = R_1 + R_2 + R_3 + ...$$"
        },
        {
          "front": "How is total resistance calculated in a **parallel circuit**?",
          "back": "By adding the reciprocals of all resistances: $$\\frac{1}{R_{total}} = \\frac{1}{R_1} + \\frac{1}{R_2} + \\frac{1}{R_3} + ...$$"
        },
        {
          "front": "What happens to the current in a series circuit?",
          "back": "The current is the same at every point in the circuit."
        },
        {
          "front": "What happens to the voltage in a parallel circuit?",
          "back": "The voltage is the same across each parallel branch."
        },
        {
          "front": "What is an **ammeter** used to measure?",
          "back": "Electric current."
        },
        {
          "front": "How must an ammeter be connected in a circuit?",
          "back": "In series with the component you want to measure the current of."
        },
        {
          "front": "What is a **voltmeter** used to measure?",
          "back": "Voltage or potential difference."
        },
        {
          "front": "How must a voltmeter be connected in a circuit?",
          "back": "In parallel with the component you want to measure the voltage across."
        },
        {
          "front": "What is **electric power**?",
          "back": "The rate at which electric energy is consumed or generated."
        },
        {
          "front": "What is the unit of electric power?",
          "back": "The Watt (W)."
        },
        {
          "front": "What is the formula for electric power?",
          "back": "$$P = IV$$"
        },
        {
          "front": "What is **electric energy**?",
          "back": "The total energy consumed by a circuit over a period of time."
        },
        {
          "front": "What is the formula for electric energy?",
          "back": "$$E = Pt$$ or $$E = IVt$$"
        },
        {
          "front": "What is a **conductor**?",
          "back": "A material that allows electric current to flow easily through it."
        },
        {
          "front": "What is an **insulator**?",
          "back": "A material that resists the flow of electric current."
        },
        {
          "front": "What is **AC (Alternating Current)**?",
          "back": "A type of current where the flow of charge periodically reverses direction."
        },
        {
          "front": "What is **DC (Direct Current)**?",
          "back": "A type of current where the flow of charge is in a single, constant direction."
        },
        {
          "front": "What is a **short circuit**?",
          "back": "An accidental path of very low resistance that allows a large, uncontrolled current to flow."
        },
        {
          "front": "What is **grounding**?",
          "back": "Connecting a conductor to the earth to provide a safe path for excess electric charge."
        },
        {
          "front": "What is a **fuse** or **circuit breaker**?",
          "back": "A safety device that interrupts the circuit when the current exceeds a safe level."
        },
        {
          "front": "What is **Kirchhoff's Current Law** (Junction Rule)?",
          "back": "The sum of all currents entering a junction equals the sum of all currents leaving that junction."
        },
        {
          "front": "What is **Kirchhoff's Voltage Law** (Loop Rule)?",
          "back": "The sum of all voltage drops around any closed loop in a circuit is equal to the total voltage of the sources in that loop."
        },
        {
          "front": "What happens to the brightness of light bulbs in a series circuit if one bulb is removed?",
          "back": "All the other bulbs will go out because the circuit is broken."
        },
        {
          "front": "What happens to the brightness of light bulbs in a parallel circuit if one bulb is removed?",
          "back": "The other bulbs remain lit and their brightness does not change."
        },
        {
          "front": "Why do household appliances use parallel circuits?",
          "back": "So each appliance can be operated independently and receives the full voltage from the power source."
        },
        {
          "front": "What is an **ohmmeter** used to measure?",
          "back": "Resistance."
        },
        {
          "front": "What is a **diode**?",
          "back": "A semiconductor device that allows current to flow in only one direction."
        },
        {
          "front": "What is a **capacitor**?",
          "back": "A component that stores electric energy in an electric field."
        }
      ]
    }
  ]
}
