{
  "flashcards": [
    {
      "category": "Kinematics (1D & 2D)",
      "cards": [
        {
          "front": "What is **kinematics**?",
          "back": "The branch of mechanics that describes motion without considering its causes (forces)."
        },
        {
          "front": "What is the difference between a **scalar** and a **vector**?",
          "back": "A scalar has magnitude only (e.g., speed), while a vector has both magnitude and direction (e.g., velocity)."
        },
        {
          "front": "What is the difference between **distance** and **displacement**?",
          "back": "Distance is the total path length traveled (scalar), while displacement is the change in position from start to end (vector)."
        },
        {
          "front": "What is the difference between **speed** and **velocity**?",
          "back": "Speed is the rate of change of distance (scalar), while velocity is the rate of change of displacement (vector)."
        },
        {
          "front": "What is **acceleration**?",
          "back": "The rate of change of velocity."
        },
        {
          "front": "What is the first kinematic equation for constant acceleration?",
          "back": "$$v_f = v_i + at$$"
        },
        {
          "front": "What is the second kinematic equation?",
          "back": "$$\\Delta d = v_i t + \\frac{1}{2}at^2$$"
        },
        {
          "front": "What is the third kinematic equation?",
          "back": "$$v_f^2 = v_i^2 + 2a\\Delta d$$"
        },
        {
          "front": "What is the acceleration due to gravity (g) on Earth?",
          "back": "Approximately 9.8 m/s², directed downward."
        },
        {
          "front": "What is **free-fall motion**?",
          "back": "The motion of an object solely under the influence of gravity, with air resistance ignored."
        },
        {
          "front": "On a **position-time graph**, what does a straight, horizontal line mean?",
          "back": "The object is at rest (zero velocity)."
        },
        {
          "front": "On a **velocity-time graph**, what does a straight, horizontal line mean?",
          "back": "The object has constant velocity (zero acceleration)."
        },
        {
          "front": "On a **position-time graph**, what does the slope represent?",
          "back": "Velocity."
        },
        {
          "front": "On a **velocity-time graph**, what does the slope represent?",
          "back": "Acceleration."
        },
        {
          "front": "On a **velocity-time graph**, what does the area under the curve represent?",
          "back": "Displacement."
        },
        {
          "front": "What is the formula for average velocity?",
          "back": "$$v_{avg} = \\frac{\\Delta d}{\\Delta t}$$"
        },
        {
          "front": "An object is thrown straight up. What is its velocity at the highest point of its path?",
          "back": "Zero (for an instant)."
        },
        {
          "front": "An object is thrown straight up. What is its acceleration at the highest point of its path?",
          "back": "Still 9.8 m/s² downward."
        },
        {
          "front": "What is **two-dimensional (2D) kinematics**?",
          "back": "The study of motion in two dimensions, typically broken down into separate x and y components."
        },
        {
          "front": "What is a **projectile**?",
          "back": "An object that is thrown or launched into the air and is only affected by gravity."
        },
        {
          "front": "How is a projectile's horizontal motion different from its vertical motion?",
          "back": "Horizontal motion has zero acceleration, while vertical motion is affected by the acceleration of gravity."
        },
        {
          "front": "What is the shape of a projectile's path (trajectory)?",
          "back": "A parabola."
        },
        {
          "front": "What is **vector resolution**?",
          "back": "The process of breaking a vector into its horizontal (x) and vertical (y) components."
        },
        {
          "front": "How do you calculate the horizontal component of an initial velocity ($v_i$) at an angle (θ)?",
          "back": "$$v_{ix} = v_i \\cos(\\theta)$$"
        },
        {
          "front": "How do you calculate the vertical component of an initial velocity ($v_i$) at an angle (θ)?",
          "back": "$$v_{iy} = v_i \\sin(\\theta)$$"
        },
        {
          "front": "What is **range** in projectile motion?",
          "back": "The total horizontal distance traveled by a projectile."
        },
        {
          "front": "What is the formula for horizontal displacement in projectile motion?",
          "back": "$$\\Delta d_x = v_{ix}t$$"
        },
        {
          "front": "What is the formula for average acceleration?",
          "back": "$$a_{avg} = \\frac{\\Delta v}{\\Delta t}$$"
        },
        {
          "front": "What are the common sign conventions used in kinematics?",
          "back": "Up or right is usually positive, and down or left is usually negative."
        },
        {
          "front": "What does a negative value for displacement mean?",
          "back": "The object's final position is in the negative direction from its starting point."
        },
        {
          "front": "What does a negative value for acceleration mean?",
          "back": "The object is slowing down or accelerating in the negative direction."
        },
        {
          "front": "How do you find the total distance from a velocity-time graph?",
          "back": "By adding the areas of all sections, treating all areas as positive."
        },
        {
          "front": "A cyclist travels 10 km north and then 5 km south. What is her total distance?",
          "back": "15 km."
        },
        {
          "front": "A cyclist travels 10 km north and then 5 km south. What is her final displacement?",
          "back": "5 km north."
        },
        {
          "front": "How can you tell if an object is accelerating from a velocity-time graph?",
          "back": "If the line has a non-zero slope."
        },
        {
          "front": "What is the formula for finding the magnitude of a resultant vector from its x and y components?",
          "back": "$$R = \\sqrt{R_x^2 + R_y^2}$$"
        },
        {
          "front": "When are the horizontal and vertical components of a projectile's motion independent?",
          "back": "They are always independent of each other (they don't affect each other)."
        },
        {
          "front": "What is the velocity of a projectile at its maximum height?",
          "back": "The vertical velocity is zero, but the horizontal velocity is constant (if we ignore air resistance)."
        },
        {
          "front": "What is the SI unit for displacement?",
          "back": "The meter (m)."
        },
        {
          "front": "What is the SI unit for acceleration?",
          "back": "The meter per second squared (m/s²)."
        }
      ]
    }
  ]
}