{
  "flashcards": [
    {
      "category": "Light & Optics",
      "cards": [
        {
          "front": "What is **reflection**?",
          "back": "The bouncing of light off a surface."
        },
        {
          "front": "What is the **Law of Reflection**?",
          "back": "The angle of incidence is equal to the angle of reflection ($$\\theta_i = \\theta_r$$)."
        },
        {
          "front": "What is **refraction**?",
          "back": "The bending of light as it passes from one medium to another."
        },
        {
          "front": "What is **Snell's Law**?",
          "back": "$$n_1\\sin\\theta_1 = n_2\\sin\\theta_2$$"
        },
        {
          "front": "What is a **real image**?",
          "back": "An image formed where light rays actually converge, and it can be projected onto a screen."
        },
        {
          "front": "What is a **virtual image**?",
          "back": "An image formed where light rays appear to diverge from, but do not actually converge. It cannot be projected."
        },
        {
          "front": "What is a **plane mirror**?",
          "back": "A flat mirror that produces a virtual, upright, and same-size image."
        },
        {
          "front": "What is a **concave mirror**?",
          "back": "A mirror that curves inward and can form both real and virtual images."
        },
        {
          "front": "What is a **convex mirror**?",
          "back": "A mirror that curves outward and always forms a virtual, upright, and smaller image."
        },
        {
          "front": "What is the **focal point** of a mirror or lens?",
          "back": "The point where parallel light rays converge or appear to diverge from after reflection or refraction."
        },
        {
          "front": "What is **dispersion**?",
          "back": "The separation of light into its component colors, as seen in a prism."
        },
        {
          "front": "What is the formula for the speed of light in a vacuum?",
          "back": "$$c = \\lambda f$$"
        },
        {
          "front": "What is the speed of light in a vacuum?",
          "back": "$$3.00 \\times 10^8\\text{ m/s}$$"
        },
        {
          "front": "What is **total internal reflection**?",
          "back": "The complete reflection of a light ray at the boundary of two media when the angle of incidence exceeds the critical angle."
        },
        {
          "front": "What is a **converging lens**?",
          "back": "A lens that is thicker in the middle and causes parallel light rays to converge to a focal point."
        },
        {
          "front": "What is a **diverging lens**?",
          "back": "A lens that is thinner in the middle and causes parallel light rays to spread out."
        },
        {
          "front": "What is the **thin lens equation**?",
          "back": "$$\\frac{1}{f} = \\frac{1}{d_o} + \\frac{1}{d_i}$$"
        },
        {
          "front": "What is the formula for magnification?",
          "back": "$$M = \\frac{h_i}{h_o} = -\\frac{d_i}{d_o}$$"
        },
        {
          "front": "How does light travel?",
          "back": "In straight lines, as an electromagnetic wave."
        },
        {
          "front": "What color of light has the longest wavelength?",
          "back": "Red."
        },
        {
          "front": "What color of light has the shortest wavelength?",
          "back": "Violet."
        },
        {
          "front": "What is the relationship between the angle of incidence and the angle of reflection?",
          "back": "They are equal ($$\\theta_i = \\theta_r$$)."
        },
        {
          "front": "What is the **normal line**?",
          "back": "A line perpendicular to a surface at the point where a light ray strikes it."
        },
        {
          "front": "What is the **index of refraction (n)**?",
          "back": "A measure of how much a medium slows down light."
        },
        {
          "front": "When light enters a medium with a higher index of refraction, does it bend toward or away from the normal?",
          "back": "Toward the normal."
        },
        {
          "front": "When light enters a medium with a lower index of refraction, does it bend toward or away from the normal?",
          "back": "Away from the normal."
        },
        {
          "front": "What are the two types of mirrors?",
          "back": "Plane and spherical (concave and convex)."
        },
        {
          "front": "What are the two types of lenses?",
          "back": "Converging and diverging."
        },
        {
          "front": "What happens to the focal length of a concave mirror?",
          "back": "It is positive."
        },
        {
          "front": "What happens to the focal length of a convex mirror?",
          "back": "It is negative."
        },
        {
          "front": "What happens to the focal length of a converging lens?",
          "back": "It is positive."
        },
        {
          "front": "What happens to the focal length of a diverging lens?",
          "back": "It is negative."
        },
        {
          "front": "What is a **ray diagram**?",
          "back": "A drawing that uses a few representative light rays to determine the position and size of an image."
        },
        {
          "front": "How does a magnifying glass work?",
          "back": "It is a converging lens that creates a virtual, magnified, and upright image."
        },
        {
          "front": "What is the property of light that allows fiber optics to work?",
          "back": "Total internal reflection."
        },
        {
          "front": "What is the primary characteristic of an image formed by a plane mirror?",
          "back": "It is virtual, upright, and laterally inverted (reversed)."
        },
        {
          "front": "How is light different from sound?",
          "back": "Light is a transverse electromagnetic wave, while sound is a longitudinal mechanical wave."
        },
        {
          "front": "What is **chromatic aberration**?",
          "back": "The failure of a lens to focus all colors of light to the same point."
        },
        {
          "front": "What is **spherical aberration**?",
          "back": "The failure of a spherical mirror to focus all parallel light rays to a single point."
        },
        {
          "front": "What is the primary function of a telescope?",
          "back": "To make distant objects appear closer by gathering more light and magnifying the image."
        }
      ]
    }
  ]
}
