{
  "flashcards": [
    {
      "category": "Magnetism",
      "cards": [
        {
          "front": "What is **magnetism**?",
          "back": "A force of attraction or repulsion that arises between electrically charged particles due to their motion."
        },
        {
          "front": "What are the two types of magnetic poles?",
          "back": "North and South poles."
        },
        {
          "front": "What is the rule for the interaction of magnetic poles?",
          "back": "Like poles repel, and opposite poles attract."
        },
        {
          "front": "What is a **magnetic field**?",
          "back": "A region of space around a magnet or a moving charge where magnetic forces are felt."
        },
        {
          "front": "What is a **magnetic field line**?",
          "back": "A line used to represent a magnetic field, showing the direction of the force on a North pole."
        },
        {
          "front": "Which direction do magnetic field lines point *outside* a magnet?",
          "back": "From the North pole to the South pole."
        },
        {
          "front": "Where is a magnetic field strongest?",
          "back": "At the poles of a magnet where the field lines are most dense."
        },
        {
          "front": "Can you isolate a single magnetic pole?",
          "back": "No. Magnetic poles always exist in pairs (monopoles do not exist)."
        },
        {
          "front": "What is a **permanent magnet**?",
          "back": "A magnet that retains its magnetism without an external field or current."
        },
        {
          "front": "What is an **electromagnet**?",
          "back": "A temporary magnet created by passing an electric current through a coil of wire."
        },
        {
          "front": "What is a **ferromagnetic material**?",
          "back": "A material that is strongly attracted to magnets and can be permanently magnetized (e.g., iron, nickel, cobalt)."
        },
        {
          "front": "What is a **paramagnetic material**?",
          "back": "A material that is weakly attracted to magnets but cannot be permanently magnetized (e.g., aluminum, platinum)."
        },
        {
          "front": "What is a **diamagnetic material**?",
          "back": "A material that is weakly repelled by magnets (e.g., copper, water)."
        },
        {
          "front": "What is a **magnetic domain**?",
          "back": "A microscopic region in a ferromagnetic material where the magnetic fields of atoms are aligned."
        },
        {
          "front": "What is the **right-hand rule** for a current-carrying wire?",
          "back": "If the thumb points in the direction of current, the fingers curl in the direction of the magnetic field."
        },
        {
          "front": "What is the formula for the force on a current-carrying wire in a magnetic field?",
          "back": "$$F = ILB\\sin\\theta$$"
        },
        {
          "front": "What is the formula for the force on a moving charge in a magnetic field?",
          "back": "$$F = qvB\\sin\\theta$$"
        },
        {
          "front": "What is the **motor effect**?",
          "back": "The force experienced by a current-carrying conductor when it is placed in a magnetic field."
        },
        {
          "front": "What is the purpose of the **commutator** in a DC motor?",
          "back": "To reverse the direction of current every half-rotation to keep the motor spinning in the same direction."
        },
        {
          "front": "What is **electromagnetic induction**?",
          "back": "The process of generating an electric current by moving a conductor through a magnetic field."
        },
        {
          "front": "Who discovered that a changing magnetic field can induce an electric current?",
          "back": "Michael Faraday."
        },
        {
          "front": "What is a **generator**?",
          "back": "A device that converts mechanical energy into electrical energy using electromagnetic induction."
        },
        {
          "front": "What is a **transformer**?",
          "back": "A device that uses induction to change the voltage of an alternating current (AC)."
        },
        {
          "front": "What is the difference between a motor and a generator?",
          "back": "A motor uses electricity to create motion, while a generator uses motion to create electricity."
        },
        {
          "front": "How does the Earth act as a magnet?",
          "back": "Due to the motion of molten iron in its core, which generates a large magnetic field."
        },
        {
          "front": "Which of Earth's magnetic poles is located near its geographic North Pole?",
          "back": "The magnetic South pole (which attracts the North pole of a compass)."
        },
        {
          "front": "What are the **auroras** (Northern/Southern Lights)?",
          "back": "Charged particles from the sun interacting with the Earth's magnetic field."
        },
        {
          "front": "What happens to a magnet when it is cut in half?",
          "back": "It creates two new magnets, each with its own North and South pole."
        },
        {
          "front": "Why is a magnetic field considered a vector quantity?",
          "back": "Because it has both magnitude (strength) and direction."
        },
        {
          "front": "How does the density of magnetic field lines relate to field strength?",
          "back": "Denser lines indicate a stronger magnetic field."
        },
        {
          "front": "What is a **solenoid**?",
          "back": "A coil of wire that acts as an electromagnet when a current flows through it."
        },
        {
          "front": "What is the core of an electromagnet typically made of?",
          "back": "Soft iron, which is easily magnetized and demagnetized."
        },
        {
          "front": "What happens to the magnetic field of a current-carrying wire if the current is increased?",
          "back": "The magnetic field strength increases."
        },
        {
          "front": "What happens to the force on a wire in a magnetic field if the current is reversed?",
          "back": "The direction of the force is reversed."
        },
        {
          "front": "What is the principle behind a particle accelerator?",
          "back": "The force on a moving charge in a magnetic field is used to guide and accelerate charged particles."
        },
        {
          "front": "What is the key to inducing a current in a wire?",
          "back": "There must be a relative motion between the wire and the magnetic field lines."
        },
        {
          "front": "What is the difference between direct current (DC) and alternating current (AC) in this context?",
          "back": "A simple DC motor uses a commutator, while an AC generator naturally reverses its current."
        },
        {
          "front": "What is a **magnetic shield**?",
          "back": "A barrier made of ferromagnetic material used to block or deflect a magnetic field."
        },
        {
          "front": "How is the strength of an electromagnet increased?",
          "back": "By increasing the current, increasing the number of coils, or using a ferromagnetic core."
        },
        {
          "front": "In a magnetic field, what is the force on a charged particle that is stationary?",
          "back": "Zero. The force only acts on a moving charge."
        }
      ]
    }
  ]
}
