{
  "flashcards": [
    {
      "category": "Momentum & Collisions",
      "cards": [
        {
          "front": "What is **momentum**?",
          "back": "A measure of an object's mass in motion."
        },
        {
          "front": "What is the formula for momentum?",
          "back": "$$p = mv$$"
        },
        {
          "front": "What is the SI unit for momentum?",
          "back": "Kilogram-meter per second (kg·m/s)."
        },
        {
          "front": "Is momentum a scalar or vector quantity?",
          "back": "It is a **vector** quantity."
        },
        {
          "front": "What is **impulse**?",
          "back": "The change in momentum of an object."
        },
        {
          "front": "What is the formula for impulse?",
          "back": "$$J = F\\Delta t$$"
        },
        {
          "front": "What is the impulse-momentum theorem?",
          "back": "Impulse is equal to the change in an object's momentum ($$J = \\Delta p$$)."
        },
        {
          "front": "What is the SI unit for impulse?",
          "back": "Newton-second (N·s) or kg·m/s."
        },
        {
          "front": "What is the **Law of Conservation of Momentum**?",
          "back": "The total momentum of an isolated system remains constant."
        },
        {
          "front": "What is an **isolated system**?",
          "back": "A system with no net external forces acting on it."
        },
        {
          "front": "What are the two main types of collisions?",
          "back": "Elastic and inelastic collisions."
        },
        {
          "front": "In an **elastic collision**, what is conserved?",
          "back": "Both momentum and kinetic energy are conserved."
        },
        {
          "front": "In an **inelastic collision**, what is conserved?",
          "back": "Only momentum is conserved; kinetic energy is not."
        },
        {
          "front": "What is a **perfectly inelastic collision**?",
          "back": "A collision in which the colliding objects stick together after impact."
        },
        {
          "front": "What is the formula for conservation of momentum?",
          "back": "$$\\Sigma p_{initial} = \\Sigma p_{final}$$"
        },
        {
          "front": "When two objects collide in a perfectly inelastic collision, what is their final velocity?",
          "back": "They share the same final velocity."
        },
        {
          "front": "In a collision, what is the change in momentum of object 1 compared to object 2?",
          "back": "The change in momentum is equal in magnitude and opposite in direction."
        },
        {
          "front": "What is a **recoil**?",
          "back": "The backward momentum of an object (e.g., a gun) after firing."
        },
        {
          "front": "In an explosion, what is the total momentum of the pieces immediately after the explosion?",
          "back": "The same as the total momentum before the explosion."
        },
        {
          "front": "If a moving object collides with a stationary object and sticks to it, what type of collision is it?",
          "back": "Perfectly inelastic."
        },
        {
          "front": "How does the mass of an object affect its momentum?",
          "back": "Momentum is directly proportional to mass."
        },
        {
          "front": "How does the velocity of an object affect its momentum?",
          "back": "Momentum is directly proportional to velocity."
        },
        {
          "front": "Can a less massive object have more momentum than a more massive object?",
          "back": "Yes, if its velocity is high enough."
        },
        {
          "front": "When is the total momentum of a system not conserved?",
          "back": "When there is a net external force acting on the system."
        },
        {
          "front": "What force is responsible for the change in momentum during a collision?",
          "back": "The impulsive force from the impact."
        },
        {
          "front": "What is the relationship between the impulse of a force and the time it acts?",
          "back": "Impulse is directly proportional to the time interval."
        },
        {
          "front": "How can you minimize the force of impact in a collision?",
          "back": "By increasing the time of the collision (e.g., using a crumple zone)."
        },
        {
          "front": "What is the formula for the total momentum of a system of two objects?",
          "back": "$$p_{total} = m_1v_1 + m_2v_2$$"
        },
        {
          "front": "What is the principle of conservation of momentum applied to a recoil?",
          "back": "The momentum of the gun equals the momentum of the bullet, but in the opposite direction."
        },
        {
          "front": "What type of collision is a billiard ball hitting another billiard ball?",
          "back": "Approximately elastic."
        },
        {
          "front": "What type of collision is a car crash?",
          "back": "Inelastic."
        },
        {
          "front": "In an elastic collision, what happens to the total kinetic energy?",
          "back": "It remains constant."
        },
        {
          "front": "In an inelastic collision, what happens to the total kinetic energy?",
          "back": "It decreases."
        },
        {
          "front": "How is a momentum change related to Newton's Second Law?",
          "back": "Newton's Second Law can be expressed as $$F_{net} = \\frac{\\Delta p}{\\Delta t}$$."
        },
        {
          "front": "What is the formula for the final velocity in a perfectly inelastic collision?",
          "back": "$$v_f = \\frac{m_1v_{1i} + m_2v_{2i}}{m_1 + m_2}$$"
        },
        {
          "front": "What is the formula for the relative velocity of separation in an elastic collision?",
          "back": "$$v_{1f} - v_{2f} = -(v_{1i} - v_{2i})$$"
        },
        {
          "front": "What is a collision?",
          "back": "An event in which two or more bodies exert forces on each other over a short period of time."
        },
        {
          "front": "Can an isolated system lose momentum?",
          "back": "No."
        },
        {
          "front": "In a collision, why is total momentum conserved?",
          "back": "The internal forces cancel out, and there are no external forces."
        },
        {
          "front": "What is the formula for conservation of kinetic energy in an elastic collision?",
          "back": "$$\\frac{1}{2}m_1v_{1i}^2 + \\frac{1}{2}m_2v_{2i}^2 = \\frac{1}{2}m_1v_{1f}^2 + \\frac{1}{2}m_2v_{2f}^2$$"
        }
      ]
    }
  ]
}
