{
  "flashcards": [
    {
      "category": "Sound & Acoustics",
      "cards": [
        {
          "front": "What is **sound**?",
          "back": "A mechanical wave that is produced by vibrations and requires a medium to travel."
        },
        {
          "front": "What type of wave is sound?",
          "back": "A longitudinal wave (particles vibrate parallel to the direction of energy transfer)."
        },
        {
          "front": "How does the speed of sound vary in different media?",
          "back": "It is fastest in solids, slower in liquids, and slowest in gases."
        },
        {
          "front": "What determines the **pitch** of a sound?",
          "back": "The frequency of the sound wave."
        },
        {
          "front": "What determines the **loudness** of a sound?",
          "back": "The amplitude of the sound wave."
        },
        {
          "front": "What is the unit for the intensity level of sound?",
          "back": "The decibel (dB)."
        },
        {
          "front": "What is an **echo**?",
          "back": "A distinct sound produced by the reflection of sound waves."
        },
        {
          "front": "What is **reverberation**?",
          "back": "A prolonged sound caused by multiple, closely spaced reflections."
        },
        {
          "front": "What is the **Doppler effect**?",
          "back": "The apparent change in frequency of a wave due to the relative motion of the source and observer."
        },
        {
          "front": "What is the formula for the speed of sound?",
          "back": "$$v = f\\lambda$$"
        },
        {
          "front": "What is **infrasound**?",
          "back": "Sound waves with a frequency below the human hearing range ($$< 20\\text{ Hz}$$)."
        },
        {
          "front": "What is **ultrasound**?",
          "back": "Sound waves with a frequency above the human hearing range ($$> 20,000\\text{ Hz}$$)."
        },
        {
          "front": "What is the typical range of human hearing?",
          "back": "$$20\\text{ Hz to } 20,000\\text{ Hz}$$."
        },
        {
          "front": "What is the **principle of superposition**?",
          "back": "When two or more waves overlap, the resulting displacement is the sum of the individual displacements."
        },
        {
          "front": "What is **constructive interference** of sound waves?",
          "back": "When two waves overlap and their compressions and rarefactions align, resulting in a louder sound."
        },
        {
          "front": "What is **destructive interference** of sound waves?",
          "back": "When a compression of one wave overlaps with a rarefaction of another, resulting in a quieter or no sound."
        },
        {
          "front": "What are **beats**?",
          "back": "The periodic variation in loudness caused by the interference of two sound waves with slightly different frequencies."
        },
        {
          "front": "What is the formula for beat frequency?",
          "back": "$$f_{beat} = |f_1 - f_2|$$"
        },
        {
          "front": "What is **resonance**?",
          "back": "The increase in amplitude of a vibration when the frequency of an applied force matches the natural frequency of the object."
        },
        {
          "front": "How does the temperature of air affect the speed of sound?",
          "back": "The speed of sound increases as the air temperature increases."
        },
        {
          "front": "How does humidity affect the speed of sound in air?",
          "back": "It increases slightly as humidity increases."
        },
        {
          "front": "Why can't sound travel in a vacuum?",
          "back": "Because it is a mechanical wave and requires a medium to transmit energy."
        },
        {
          "front": "What is the **quality** or **timbre** of a sound?",
          "back": "The property that distinguishes two sounds with the same pitch and loudness, often due to a combination of frequencies."
        },
        {
          "front": "What is a **sound barrier**?",
          "back": "The high-drag region of air resistance encountered by an object as it approaches the speed of sound."
        },
        {
          "front": "What is the speed of sound in dry air at $$20°\\text{C}$$?",
          "back": "$$343\\text{ m/s}$$."
        },
        {
          "front": "How does the human ear process sound?",
          "back": "Sound waves are collected by the outer ear and cause the eardrum to vibrate, which then transmits the vibrations to the inner ear."
        },
        {
          "front": "What part of the ear helps with balance?",
          "back": "The semicircular canals."
        },
        {
          "front": "What is a **compression** in a sound wave?",
          "back": "A region in a longitudinal wave where the particles are crowded together."
        },
        {
          "front": "What is a **rarefaction** in a sound wave?",
          "back": "A region in a longitudinal wave where the particles are spread apart."
        },
        {
          "front": "What is **acoustics**?",
          "back": "The science that deals with the production, control, transmission, reception, and effects of sound."
        },
        {
          "front": "How does a musical instrument produce sound?",
          "back": "By creating a vibration that propagates as a sound wave."
        },
        {
          "front": "What is the effect of moving the sound source towards an observer?",
          "back": "The observer perceives a higher pitch due to the Doppler effect."
        },
        {
          "front": "What is the effect of moving the sound source away from an observer?",
          "back": "The observer perceives a lower pitch due to the Doppler effect."
        },
        {
          "front": "What is the inverse square law of sound intensity?",
          "back": "Sound intensity is inversely proportional to the square of the distance from the source."
        },
        {
          "front": "What are **overtones**?",
          "back": "Frequencies that are multiples of the fundamental frequency of a vibrating object."
        },
        {
          "front": "What is the **fundamental frequency**?",
          "back": "The lowest frequency of a standing wave that can be produced by a vibrating object."
        },
        {
          "front": "What is a **shock wave**?",
          "back": "A high-pressure wave produced by an object traveling faster than the speed of sound."
        },
        {
          "front": "What is the relationship between the period and pitch of a sound?",
          "back": "The period is the inverse of the frequency, so a shorter period means a higher pitch."
        },
        {
          "front": "Can sound waves be polarized?",
          "back": "No, because they are longitudinal waves."
        },
        {
          "front": "What is the key difference between an echo and reverberation?",
          "back": "An echo is a single, clear reflection, while reverberation is a mix of many overlapping reflections."
        }
      ]
    }
  ]
}
