{
  "flashcards": [
    {
      "category": "Waves & Simple Harmonic Motion",
      "cards": [
        {
          "front": "What is a **wave**?",
          "back": "A disturbance that transfers energy through a medium or a vacuum."
        },
        {
          "front": "What is a **mechanical wave**?",
          "back": "A wave that requires a medium to travel through."
        },
        {
          "front": "What is an **electromagnetic wave**?",
          "back": "A wave that can travel through a vacuum and does not require a medium."
        },
        {
          "front": "What is a **transverse wave**?",
          "back": "A wave in which particles of the medium vibrate perpendicular to the direction of energy transfer."
        },
        {
          "front": "What is a **longitudinal wave**?",
          "back": "A wave in which particles of the medium vibrate parallel to the direction of energy transfer."
        },
        {
          "front": "What is the **period (T)** of a wave?",
          "back": "The time it takes for a single wave cycle to pass a given point."
        },
        {
          "front": "What is the **frequency (f)** of a wave?",
          "back": "The number of wave cycles that pass a given point per unit of time."
        },
        {
          "front": "What is the relationship between period and frequency?",
          "back": "$$T = \\frac{1}{f}$$"
        },
        {
          "front": "What is **wavelength (λ)**?",
          "back": "The distance between two consecutive identical points on a wave, such as from crest to crest."
        },
        {
          "front": "What is the **amplitude** of a wave?",
          "back": "The maximum displacement of a wave from its equilibrium position."
        },
        {
          "front": "What is the formula for wave speed?",
          "back": "$$v = f\\lambda$$"
        },
        {
          "front": "What is a **standing wave**?",
          "back": "A wave pattern that remains in a constant position due to interference between two waves traveling in opposite directions."
        },
        {
          "front": "What is a **node** on a standing wave?",
          "back": "A point of zero displacement where destructive interference is at its maximum."
        },
        {
          "front": "What is an **antinode** on a standing wave?",
          "back": "A point of maximum displacement where constructive interference is at its maximum."
        },
        {
          "front": "What is **reflection**?",
          "back": "The bouncing back of a wave when it hits a boundary."
        },
        {
          "front": "What is **refraction**?",
          "back": "The change in direction of a wave as it passes from one medium to another."
        },
        {
          "front": "What is **diffraction**?",
          "back": "The bending of waves as they pass around an obstacle or through an opening."
        },
        {
          "front": "What is **constructive interference**?",
          "back": "When two waves overlap and their amplitudes add to create a larger-amplitude wave."
        },
        {
          "front": "What is **destructive interference**?",
          "back": "When two waves overlap and their amplitudes subtract, resulting in a smaller-amplitude wave."
        },
        {
          "front": "What is **Simple Harmonic Motion (SHM)**?",
          "back": "A type of periodic motion where the restoring force is directly proportional to the displacement and acts in the opposite direction."
        },
        {
          "front": "What is the **restoring force** in SHM?",
          "back": "The force that always acts to return the oscillating object to its equilibrium position."
        },
        {
          "front": "What is **Hooke's Law**?",
          "back": "The law that states the restoring force of a spring is proportional to the displacement. ($$F = -kx$$)"
        },
        {
          "front": "What is the formula for the period of a simple pendulum?",
          "back": "$$T = 2\\pi\\sqrt{\\frac{L}{g}}$$"
        },
        {
          "front": "What is the formula for the period of a mass-spring system?",
          "back": "$$T = 2\\pi\\sqrt{\\frac{m}{k}}$$"
        },
        {
          "front": "How does the period of a simple pendulum change if the mass is doubled?",
          "back": "It remains the same (the period is independent of mass)."
        },
        {
          "front": "How does the period of a mass-spring system change if the mass is doubled?",
          "back": "It increases by a factor of $$\\sqrt{2}$$."
        },
        {
          "front": "How does the period of a pendulum change if the length is doubled?",
          "back": "It increases by a factor of $$\\sqrt{2}$$."
        },
        {
          "front": "What happens to the period of a pendulum on the moon?",
          "back": "It increases because gravity is weaker ($$g$$ is smaller)."
        },
        {
          "front": "Where is the velocity of an object in SHM at its maximum?",
          "back": "At the equilibrium position."
        },
        {
          "front": "Where is the kinetic energy of an object in SHM at its maximum?",
          "back": "At the equilibrium position."
        },
        {
          "front": "Where is the potential energy of an object in SHM at its maximum?",
          "back": "At the maximum displacement from equilibrium."
        },
        {
          "front": "Where is the acceleration of an object in SHM at its maximum?",
          "back": "At the maximum displacement from equilibrium."
        },
        {
          "front": "What is the **medium** of a wave?",
          "back": "The substance or material that a mechanical wave travels through."
        },
        {
          "front": "What is the difference between a **crest** and a **trough**?",
          "back": "A crest is the highest point of a transverse wave, while a trough is the lowest point."
        },
        {
          "front": "What is the difference between a **compression** and a **rarefaction**?",
          "back": "A compression is a region of high density in a longitudinal wave, while a rarefaction is a region of low density."
        },
        {
          "front": "What is the principle of **superposition**?",
          "back": "When two or more waves overlap, the resulting displacement is the vector sum of the individual displacements."
        },
        {
          "front": "What is the **phase** of a wave?",
          "back": "The position of a point on a wave cycle, often measured in degrees or radians."
        },
        {
          "front": "Do waves transfer matter?",
          "back": "No, they transfer energy, but the particles of the medium only oscillate in place."
        },
        {
          "front": "What is the main property of a sound wave that determines its pitch?",
          "back": "Frequency."
        },
        {
          "front": "What is the main property of a sound wave that determines its loudness?",
          "back": "Amplitude."
        }
      ]
    }
  ]
}
